{
    "topic": "clinical depression",
    "mainEntity": [
        {
            "question": "How do you know if you have clinical depression?",
            "url": "https://www.quora.com/How-do-you-know-if-you-have-clinical-depression",
            "suggestedAnswer": [
                {
                    "authorName": "Onyx Raven",
                    "authorUrl": "https://www.quora.com/profile/Onyx-Raven-1",
                    "authorDescription": null,
                    "text": "Depression DSM-5 Diagnostic Criteria\n\nThe DSM-5 outlines the following criterion to make a diagnosis of depression. The individual must be experiencing five or more symptoms during the same 2-week period and at least one of the symptoms should be either (1) depressed mood or (2) loss of interest or pleasure.\n\n1. Depressed mood most of the day, nearly every day.\n2. Markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day.\n3. Significant weight loss when not dieting or weight gain, or decrease or increase in appetite nearly every day.\n4. A slowing down of thought and a reduction of physical movement (observable by others, not merely subjective feelings of restlessness or being slowed down).\n5. Fatigue or loss of energy nearly every day.\n6. Feelings of worthlessness or excessive or inappropriate guilt nearly every day.\n7. Diminished ability to think or concentrate, or indecisiveness, nearly every day.\n8. Recurrent thoughts of death, recurrent suicidal ideation [ https://www.psycom.net/suicide-warning-signs ] without a specific plan, or a suicide attempt or a specific plan for committing suicide.\n"
                },
                {
                    "authorName": "Tanisha Jain",
                    "authorUrl": "https://www.quora.com/profile/Tanisha-Jain-23",
                    "authorDescription": "former Ambassador  at dToks | Talks That DeTox (2020-2021)",
                    "text": "There is a global consensus as to what can be considered as clinical depression (published by the American Psychiatric Association). There are nine things to look for, and clinical depression is diagnosed when you have at least five of these for more than two weeks:\n\n1. Depressed mood i.e. you feel sad or empty or helpless.\n2. Inability to feel pleasure or excitement i.e. things that previously gave you pleasure, now don't.\n3. Weight loss or weight gain.\n4. Insomnia or an increased desire to sleep.\n5. Slow down i.e. you are not doing things at the same level of speed in which you used to.\n6. Loss of energy or feeling tired easily.\n7. Feeling of inappropriate guilt. Like “I can do much better” or “I'm not living up to what I can do”.\n8. Lack of concentration or unable to make decisions.\n9. Recurrent thoughts of death or suicide.\nSymptoms are usually severe enough to cause noticeable problems in relationships with others or in day-to-day activities, such as work, school or social activities. In case you observe such symptoms, it's recommended to talk to a psychiatrist."
                },
                {
                    "authorName": "Tommy Thompson",
                    "authorUrl": "https://www.quora.com/profile/Tommy-Thompson-10",
                    "authorDescription": "one of the planet dwellers",
                    "text": "The first time it happened to me I really didn't know what was wrong.  I was a child and I just believed what the teachers and my parents told me.  They said I had no initiative, I was lazy, etc.  But I was suffering.  I felt like damaged goods.  I thought there must be something terribly wrong with me.  \n\nWhen I was a teenager, it was the same thing.  Motivation was a rumor.  I fell asleep in school.  Psychic pain became a normal state that I accepted because I thought I deserved it, after all I was a kid who just didn't have any initiative or desire to make the effort to live like others in the world.  The other kids seemed different, and I did not understand their joy or happiness over what seemed like mundane things.  It's like they could see colors I could not.  The more I suffered the more I was silent about it.    Ashamed of feeling like a loser, I tried very hard each day to go through my life but it took everything I had to get out of bed and go to school.  I played sick alot.  The counselors at school called meetings with my parents because I had very high standardized test scores and a C minus grade point average.  The teachers said I was a rebel which hurt me deeply because that is the last thing I wanted to be.\n\nWhen I was twenty one years old I had an episode of depression, anxiety and panic that was so bad I couldn't get out of bed and go to work for a week.  I told work and my roomate that I was sick with the flu.  I thought I needed to go to the hospital and tried to wait in line in the ER at a large county hospital but I couldn't bear it and went home.  I went to my primary physician and he gave me huge doses of IV vitamins and cortisone.  That pulled me out of it slowly but the depression continued for a few hours every morning for weeks.\n\nIt wasn't until I was an adult and depression became a more acceptable diagnosis and there were better antidepressants that I was treated with an SSRI antidepressant and I have not fallen into a deep depression for 30 years, except for twice when I went off the antidepressants.  One of those times I ended up in a crying spell that lasted for two days.  I couldn't stop sobbing.  It was exhausting.  I thought I was going to die from it.  The psychiatrist who treated me in the ER told me that I was one of those people he would tell to never, ever go off your antidepressants.  That was 20 years ago and I have followed his advice and been relatively depression free."
                },
                {
                    "authorName": "Dave Mumm",
                    "authorUrl": "https://www.quora.com/profile/Dave-Mumm",
                    "authorDescription": "B.A. from University of Idaho (2008)",
                    "text": "It is hard not to know . It is very painful emotionally and often physically . The physical symptoms are like a bad case of the flu . Your body aches . and you just feel miserable .\n\nDepression produces , generates on its own , strongly negative , destructive thoughts , steadily attacking . People do not amways recognize that these thoughts are from depression and they believe the negative things depression says to them . Depression is a liar ! It says there is no hope , stay home , sit in the dark , sleep all the time .\n\nTberapy really helps but there are some use things in addition to that .\n\nDo not stay home all the time . Do not sit in your room watching tv or in your phone . DO go out , go have a beverage at a cafe , go for a walk , find an inexpensive restaurant , do be around other people .\n\nDepression just hates it when we do not follow its orders . Too bad for depression!!"
                },
                {
                    "authorName": "S. Spencer Baker",
                    "authorUrl": "https://www.quora.com/profile/S-Spencer-Baker",
                    "authorDescription": "Master of the universe (not this one, obviously)",
                    "text": "You don't.\n\nYou have to rely on very good and close friends to tell you (occasionally a doctor might diagnose it, but usually they aren't sufficiently qualified and in any case, how long do they get to figure it out - five minutes?) and even then you need to be able to listen to what your friends are telling you and interpret what they really mean because they are usually not qualified either, don't know how to tell you, and will probably get pissed off with you or just walk away.\n\nIt's hard. One of the problems with clinical depression is that it shuts down the ability to discern truth from feeling. What you feel IS the truth. When you are depressed, you can see clearly that life truly is not worth living and that everybody who thinks differently is delusional. You know these truths like they're ingrained in every cell in your body. Anyone who tries to convince you otherwise is a fool or ridiculously naive. Depression rocks! Depression is the searing light of truth exposing all the problems in this world and in your life. You, alone, can see this. You have seen the future and it is shit.\n\nIf you feel like this, and could step outside yourself, you would see instantly that you are seriously depressed but if you are seriously depressed then you can't think of anything but yourself and you can only see yourself from within. You are the centre of your monochromatic universe. So it's an illness that is designed to stop you from being aware of it and it's an illness that prevents you from being motivated to do anything about curing it. Very clever, like one of those mutating viruses that hide inside benign cells.\n\nBut it is 'just' an illness and can be treated. There are lots of very good treatments for it from amazing new psychoactive drugs to highly refined talking therapies and well-known behavioural modifications. They work. Listen to anyone who has suffered and overcome it or at least learned how to cope and they will tell you these treatments work. And it's not hard to find this advice because we are legion."
                },
                {
                    "authorName": "Miranda Marcus",
                    "authorUrl": "https://www.quora.com/profile/Miranda-Marcus",
                    "authorDescription": "Plastic Welding R&D Engineer, Mother, Writer",
                    "text": "How do you know if you have broken a bone, contracted malaria, got diabetes, or suffered a stroke?\n\nYou go to a doctor to find out.\n\nThey will ask questions and do some tests, and bring their expertise to bear on the question.\n\nIf you feel like something is wrong or different and you’d like it to be better, or at least just to know what’s going on, then go to a doctor.\n\nYou can start with your family physician, who might refer you to a psychotherapist. It can help to write down your concerns before you go, so you don’t forget to mention something.\n\nLike most problems, if you ignore it, it’s unlikely to go away on it’s own. It’s OK to ask for help."
                },
                {
                    "authorName": "Dawn Langer",
                    "authorUrl": "https://www.quora.com/profile/Dawn-Langer",
                    "authorDescription": "20 years of being a part of the mental health services, I know something!",
                    "text": "If you can find no reason to get up in the morning, tired yet unable to sleep. \nCrying often for reasons unclear to \nYourself, thoughts of being better off dead. Or everyone would be better off without you. Lack of goals, no appetite. Staying to yourself with no real friendships. Making plans only to cancel. Focus on regrets or \"If onlys\". \nThese are definitely signs of deep depression. Reach out, look for articles and look for simular symptoms or stories. I have been working with my depression for over 10 years and have had a lot of false starts. Keep trying. Just keep looking for something to connect with."
                },
                {
                    "authorName": "Ash Gilorn",
                    "authorUrl": "https://www.quora.com/profile/Ash-Gilorn",
                    "authorDescription": "lives in Huntsville, AL",
                    "text": "i’ll say this once again, as others have said before on quora. quora is not meant for diagnosing your problems, go see a doctor or a psychiatrist, for christ’s sake."
                },
                {
                    "authorName": "Meenal Srivastava",
                    "authorUrl": "https://www.quora.com/profile/Meenal-Srivastava-6",
                    "authorDescription": null,
                    "text": "You have clinical depression if nothing makes you happy\n\nyou feel a blank in your life\n\nyou really have no goals or a future persepective\n\nyou feel irritable, listless and a complete lack of energy\n\nyou feel a hollow pit inside\n\nnothing really makes you happy or energetic\n\nyou either start sleeping a lot or too less\n\nyou also either start eating a lot or very less\n\nyou feel worthless or useless\n\nyou have contemplated suicide\n\nMost importantly there is a complete lack of energy, happiness and excitement for a long period of time. You should definitely consult a doctor in such a case."
                },
                {
                    "authorName": "Leah Marine",
                    "authorUrl": "https://www.quora.com/profile/Leah-Marine",
                    "authorDescription": "my mind used to be a really scary place.",
                    "text": "If you suspect you might be suffering from clinical depression (aka major depression), I would strongly recommend you talk to a psychiatrist as soon as you can. Here's a list of symptoms of a major depressive episode according to the DSM-V. Please note that this is not a guide for self-diagnosis. I'm just posting it to give you a sense of what a depressive episode is. It's still imperative that you talk to a professional!\n\n\n%3E Major Depressive Episode \n\nA. Five (or more) of the following symptoms have been present during the same 2-week period and represent a change from previous functioning; at least one of the symptoms is either (1) depressed mood or (2) loss of interest or pleasure. Note: Do not include symptoms that are clearly attributable to another medical condition.\n\n1. Depressed mood most of the day, nearly every day, as indicated by either subjective report (e.g., feels sad, empty, or hopeless) or observation made by others (e.g., appears tearful). (Note: In children and adolescents, can be irritable mood.)\n\n2. Markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day (as indicated by either subjective account or observation).\n\n 3. Significant weight loss when not dieting or weight gain (e.g., a change of more than 5% of body weight in a month), or decrease or increase in appetite nearly every day. (Note: In children, consider failure to make expected weight gain.)\n\n 4. Insomnia or hypersomnia nearly every day.\n\n 5. Psychomotor agitation or retardation nearly every day (observable by others; not merely subjective feelings of restlessness or being slowed down).\n\n6. Fatigue or loss of energy nearly every day. \n\n7. Feelings of worthlessness or excessive or inappropriate guilt (which may be delusional) nearly every day (not merely self-reproach or guilt about being sick). \n\n8. Diminished ability to think or concentrate, or indecisiveness, nearly every day (either by subjective account or as observed by others). \n\n9. Recurrent thoughts of death (not just fear of dying), recurrent suicidal ideation without a specific plan, or a suicide attempt or a specific plan for committing suicide.\n\nB. The symptoms cause clinically significant distress or impairment in social, occupational, or other important areas of functioning. \n\nC. The episode is not attributable to the physiological effects of a substance or another medical condition.\n\nNote: Criteria A-C constitute a major depressive episode. Major depressive episodes are common in bipolar I disorder but are not required for the diagnosis of bipolar I disorder. \n\nNote: Responses to a significant loss (e.g., bereavement, financial ruin, losses from a natural disaster, a serious medical illness or disability) may include the feelings of intense sadness, rumination about the loss, insomnia, poor appetite, and weight loss noted in Criterion A, which may resemble a depressive episode. Although such symptoms may be understandable or considered appropriate to the loss, the presence of a major depressive episode in addition to the normal response to a significant loss should also be carefully considered. This decision inevitably requires the exercise of clinical judgment based on the individual’s history and the cultural norms for the expression of distress in the context of loss.\n"
                }
            ]
        },
        {
            "question": "How serious is clinical depression?",
            "url": "https://www.quora.com/How-serious-is-clinical-depression",
            "suggestedAnswer": [
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "It’s a serious illness.\n\nPeople don’t realize the brain is just as much an organ as your heart or liver. And that means your brain can get sick too. Depression is slow-starting and many don’t realize it until they’re deep in.\n\nIt robs you of positive emotions and feelings. You’ll feel negative things for awhile, then nothing. Apathy is worse than you’d think; there’s a difference between not giving a damn and not being able to give a damn. You feel empty and exhausted, like life is a painful existence you’re forced to endure.\nIt’ll eventual show physical symptoms. Sleep patterns are messed up, you’re starving/eating all the time, you look like a ghost haunting this world, maybe you started cutting to try and feeling something again…a lot can happen. You’ll suffer just as bad physically as you do mentally. The brain controls everything in the body so if the controls are glitching, the rest of the parts would too.\n\nAnd then there’s the end result. Some people can’t withstand the pain anymore and commit suicide. There are those who cut too deep, accidentally killing themselves. People could turn to alcohol or drugs, both possibly ending the same way. Or maybe you do live to be the average age of a person….but you’d be spending that life tormented by your condition.\n\nDepression poisons the body and spirit. It shouldn’t be passed off in some stupid excuse like “hormones” or “overdramatic personality”"
                },
                {
                    "authorName": "Ratnadeep Toorja (রত্নদীপ তূর্য)",
                    "authorUrl": "https://www.quora.com/profile/Ratnadeep-Toorja",
                    "authorDescription": "Surviving depressive illness and OCD",
                    "text": "It is a Killer. It kills a person in a stealthy manner. No one will even notice what is happening with that person unless they are very very close to them and have some sensibility.\n\nI have seen tremendously active persons to go to a state of total silence for rest of life, this thing of clinical depression made them to so. It not only destroys their mind, it causes an entire physical breakdown which is just horrible. I have seen people of 85 kg weight become less than 55 kg within months because of depression.\n\nIt does not let you have any kind of urge for getting up from bed, eat or do anything. You won`t feel hunger, you won`t feel thirst.\n\nClinical depression is same serious as any other physical illnesses. As you seek treatment for those, you have to do the same in case of clinical depression too. Otherwise, you will eventually get lost in the hollow of utter darkness.\n\nAll I said above are from what I have seen among people, in some terms in me too. Cheers !"
                },
                {
                    "authorName": "Tara Blackwell",
                    "authorUrl": "https://www.quora.com/profile/Tara-Blackwell-11",
                    "authorDescription": null,
                    "text": "It would be MUCH easier to have a physical ailment that people could “see”. With clinical depression you get misjudged by seeming to be lazy, anti-social, weird, etc. It’s very hard to live with and deal with. It’s very hard for people who don’t suffer with this to understand it no matter how hard you try to explain it. It goes hand and hand with anxiety as well. I started with depression/anxiety at age 21 (I am now 56). When it first started to rear it’s ugly head I had NO idea what was going on in my mind! I lost tons of weight, could not eat, cried for no reason at all. The anxiety was so bad and would strike at the most horrible times. At work sitting by my desk…BOOM…..horrible dooming anxiety……I would get my purse and just leave. On vacation; we were all walking about having fun………it hit……I just turned around and started running; had no idea where I was running too. So embarrassing……thank goodness for a good doctor and good medication I got a “handle” on it. It never leaves you, you’re never “cured”……..but you deal with it and on a very positive note it has made me a very sympathetic and compassionate person. My heart goes out to anybody suffering from this and I urge anybody going through this……do NOT self-medicate with drugs or alcohol…..seek a professionals help. God Bless!"
                },
                {
                    "authorName": "Grace Cocker",
                    "authorUrl": "https://www.quora.com/profile/Grace-Cocker",
                    "authorDescription": "lived in New Zealand",
                    "text": "I tend to think of clinical depression as a terminal illness, something that I could very well die from, except I have no time stamp of months, days or years. I could very well die tomorrow or live deep into old age. However the strangest thing about this whole fiasco is that I would die by my own hands. Clinical depression is a killer as it turns people into one."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "It should be considered as serious, and have the same social sympathies and support as cancer. Many forms and stages of cancers can be treated/managed successfully- as can some people with depression. However many are incurable, recurring or untreatable, and result in a long painful battle often resulting in a death sentence. The same as depression. Neither illness is the persons ‘fault’. If you see someone who has lost their hair and is gaunt pale and weak from cancer effect how do you feel? If you see a person with self harm scars, lifestyle, unemployment or personality issues how do you feel? It is a serious, and possibly life threatening Illness. Neither a person with cancer or a person with depression willingly chose to suffer from it, and I strongly feel that mental illnesses and disorders need to be destigmatised, acknowledged and supported much more."
                },
                {
                    "authorName": "Deb Klipper",
                    "authorUrl": "https://www.quora.com/profile/Deb-Klipper",
                    "authorDescription": "treatment for Major Depressive Disorder, Social Anxiety",
                    "text": "It sucks. 40+ years with it, many many many medications, self medicating with currently my favorite-Martinis with jalapeño stuffed olives. In my younger years risk taking, self destructive behavior due to profound self loathing and use of cocaine, mushrooms, LSD, uppers, downers, yeah downers! pot, always alcohol. Just to make life bearable! Yeah, even with all that and still being alive (Have made it to 65) it is bleak and in my case living with Dysthymia, and the knowledge “this is as good as it gets”. Most days my brain and entire body feel heavy, disconnected from others and without joy. Any little daily task is a burden as large as a mountain. I would pay good money for a happy lighthearted brain. So many Psych. Docs. over the years, depression becoming a smorgasbord with added sides of social anxiety, severe panic attacks, OCD, PTSD, treatment resistant depression and the cocktail of medications I have been prescribed and nothing really improves. Just managed and monitored. Never will I be released from this illness. This is as good as it gets. I really hope you aren’t asking this question because of a personal recent diagnosis or someone you love. It is a bitch to live with a person with this illness. My husband deserves a medal for sainthood."
                },
                {
                    "authorName": "Hartwell Lee",
                    "authorUrl": "https://www.quora.com/profile/Hartwell-Lee",
                    "authorDescription": null,
                    "text": "Almost 20years with severe depression or rather D.I.D diagnosed 1.5years ago. Attempted suicide so many times I can't even remember even ended up in coma and total renal failure 2days and woke up fine. Like others, the physical body is in haywire. Sleep and sleep without eating or drinking or showering or go ends with insomnia. This is my 3rd and good psychiatrist. Limits to only 3 days supply of meds since I overdose a lot when I'm not good. I see her weekly and it is a drag to just get up to pick my meds and see her amongst other medical problems. People don't give a damn and because I'm dissociative, I ended up with very few friends who I can trust. Many have told me it's gone on long enough and I should be well but they no idea what it is like. I was a very high flyer earning over 6digits p.a when I was 27yo even though I had depression but it was not diagnosed until my first suicide attempt. The world was my oyster but life really sucked even I did everything I could- spending like crazy, holidaying in the most expensive hotels over weekends, fine dining but nothing stopped it. I even gambled on high roller stakes and it didn't matter where I won or lost. I didn't have emotions. Nobody understood me. I had lost over 25kgs and was thinner than I was in Grade6!! Eventually I deliberately ate more so nobody would suspect. Now I just live from day to day."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Very serious. It is the cause of numerous physical ailments, including digestive system issues, major headaches, back pain, etc. It can lead to suicide.\n\nIt’s hard to be much more serious than that."
                },
                {
                    "authorName": "Anilin Reddy",
                    "authorUrl": "https://www.quora.com/profile/Anilin-Reddy",
                    "authorDescription": "Recovered from major depression",
                    "text": "Ohhhhh it's serious. You feel like nothing good can come from your like and you're probably contemplating suicide. Don't give in. Nothing lasts forever. Not the good, and not the Bad. If you're in serious depression and see no way out. Go to a psychiatrist. Take medication. There's nothing wrong with it. You just need to get your chemical imbalance right. The meds take a while to kick in so do it as often as is prescribed. After a few weeks you'll start being your true self. It can be unsettling, and foreign to you. Just give it your all. You may need to see your psychiatrist a few visits to figure out what works for you. Just don't give up. You'll feel like a new person :)"
                },
                {
                    "authorName": "Zander Webb",
                    "authorUrl": "https://www.quora.com/profile/Zander-Webb",
                    "authorDescription": "Small queer nerd who talks too much about art and games",
                    "text": "Depends on the subject I've found. In someone like me it's usually Pretty Serious tm as in\n\nI really shouldn't be left alone because I'll start cutting/burning myself or try to die and forget to eat or bathe or anything ever. And what even are spoons?? And memory?? That shits gone man\n\nIn some like my friends they're more sad and just wanna sleep all day and can gently be shoved into fricking doing something like normal people.\n\nEither way it's something that needs treatment and to be nice to the person! Sometimes meds help sometimes therapy sometimes other things"
                }
            ]
        },
        {
            "question": "What is clinical depression and how is it treated?",
            "url": "https://www.quora.com/What-is-clinical-depression-and-how-is-it-treated",
            "suggestedAnswer": [
                {
                    "authorName": "Joshua Lang",
                    "authorUrl": "https://www.quora.com/profile/Joshua-Lang-12",
                    "authorDescription": "I was depressed for six years and I'm only 18, I'm thankful",
                    "text": "I was never diagnosed. I fakes being fine every time I went after I had a melt down over a teacher bullying me in the 7th grade and for a long time I thought adults were useless so why listen to them?\n\nTo my understanding its the medical way of saying severly depressed.\n\nIf I knew how it was treated I wouldn't have been depressed so long(sad chuckling). If you have this, surround yourself with good friends, it's hard, but you must. If you aren't good at making friends, make friends online. One of my best friends is a guy I met on an app and we joined the same clan, been buddies for maybe more than three years.\n\nGo out, read, eat right, study, set goals and this is cliche but write a list of five good things about the world a day. Read the lists on a really bad day.\n\nThere are medications one could take, I never did but I refused to see a professional for years in fear of meds, stupid of me, but whatever. I probably would be given something bad if I stayed depressed. Thankfully one day I just started to feel better. It was weird.\n\nI am not a professional of any kind, if you are experiencing this, tell a parent, teacher or if you're old enough get help yourself. Please, if not for yourself, for me.\n\nif it's your friend, reassure them that it will be ok, make them feel warm and cozy, show them you love them, and try to get them help. They can only be helped if they are willing to get help.\n\nI hope you are are doing well."
                },
                {
                    "authorName": "Cliff Wise",
                    "authorUrl": "https://www.quora.com/profile/Cliff-Wise",
                    "authorDescription": "Author - anxiety and depression ",
                    "text": "All personal questions about anxiety and depression should be answered by a trained professional in a clinical setting. I can only give you my opinion based on my personal experience. My latest book ‘Anxiety is not Depression - Questions and Answers’ includes hundreds of answers I have written to questions here in Quora. This book is sold at below cost.\n\nAs I understand it, clinical depression is diagnosed by a professional, usually a psychiatrist, a medical doctor who specializes in psychiatry. I was diagnosed by a Psychopharmacologist, a psychiatrist specializing in the effect of medications on individuals. There are instances where the diagnosis can be made by other professionals but they vary. According to the Mayo Clinic, “clinical depression is the more-severe form of depression, also known as major depression or major depressive disorder”. I’ll defer to that.\n\nPlease consider following my space here on Quora ‘Inside Anxiety / Depression’. Click this link: Inside Anxiety/Depression [ https://insideanxietydepression.quora.com/ ]"
                },
                {
                    "authorName": "Keith Guinn",
                    "authorUrl": "https://www.quora.com/profile/Keith-Guinn",
                    "authorDescription": "B.A. Psychology & Counseling, Nevada State College (2021)",
                    "text": "So, “clinical depression” can take many forms (i.e. Major Depressive Disorder, Persistent Depressive Disorder, Manic Depression, etc.).\n\nHow’s it treated? That depends.\n\nIf someone has mild depression, it’s likely therapy alone can be very beneficial in helping decrease symptoms.\n\nIf someone has moderate-to-severe depression, it’s likely that medication in combination with therapy would be the best approach.\n\nDo I think medication is absolutely needed? Personally, no. I think medication should come into play unless someone’s condition needs to be stabilized prior to therapy (i.e. mood, suicidal ideations, anxiety which is often comorbid with depression, etc.).\n\nThere are many treatment options available depending on the severity of someone’s depression (i.e. inpatient hospitalization, Intensive Outpatient Programs, outpatient therapy, etc.).\n\nHope this helps!\n\np.s. it’s important to note that a support system is extremely crucial to helping manage depression."
                },
                {
                    "authorName": "Lynda Wade",
                    "authorUrl": "https://www.quora.com/profile/Lynda-Wade-2",
                    "authorDescription": "former Homemaker",
                    "text": "Only a Professional Health Care Provider can diagnose Clinical Depression. Major Depression Disorder is also Clinical Depression. For me when my MDD rears its ugly head, I experience a deep brain fog, I lose my appetite. I lose any interest in anything. I am 100% Emotionally Numb. My husband of 39 years says I get a wide eyed look and I walk with stiff arms and legs. Every thing is a chore to do. I hope this helps."
                },
                {
                    "authorName": "Timothy Liebenberg",
                    "authorUrl": "https://www.quora.com/profile/Timothy-Liebenberg",
                    "authorDescription": "Fellow human with feelings",
                    "text": "I believe so. I felt depressed and went to a Therapist to which she suggested medication. I declined and said I wanted to see if I can fix it myself. And so I did. It took a few years before I managed to become bigger than depression and I can honestly say its been ages since Ive been depressed. Ofcourse I still get sad sometimes but thats normal, its impossible to be in a constant state of happiness.\n\nHow did I overcome depression? Through mastery of self. I sought to understand myself and the feelings I were having. I did it by being compassionate towards myself and loving myself. It did require some work though cause I had some serious self esteem issues. I also had to change my worldviews and realise that Im not a victim. Somewhere along the way I developed a love for philosophy, psychology and my love for God. Understanding brought a sort of clarity that allowed me to create peace.\n\nIm not saying what worked for me would work for others but I do believe it possible to be happy without some form of medication."
                },
                {
                    "authorName": "Becki Hill",
                    "authorUrl": "https://www.quora.com/profile/Becki-Hill-1",
                    "authorDescription": "Veterinary Nurse (2015-present)",
                    "text": "There is a difference between mental health problems and mental illness. A 'friend' once told me I couldn’t use my mental health as an ‘excuse’ because we all deal with anxiety and depression.\n\nI agree, we do.\n\nHere’s the difference. It’s normal to feel some form of anxiety or depression as a response to external challenges in your life (starting a new job, an abusive relationship, a break-up, a death, etc) and I’m not diminishing the severity of the anxiety and depression these things can cause. Everyone can relate and understand your pain. But when there is no rational cause for the suffering, and it doesn’t improve with time or by changing your circumstances, that’s a mental disorder. And 'neurotypical' people cannot understand this.\n\nI’ve yet to meet someone who has fully overcome mental illnesses (i.e clinical depression, OCD, schizophrenia, bipolar disorder, personality disorders) - as far as I can tell, it doesn’t go away, you just learn to cope with it better. Recovery and relapse go hand in hand, and it takes every ounce of focus and intelligence you have to recover. It’s exhausting fighting your own brain all the time.\n\nThe most frustrating thing is people constantly keep asking “what is making you anxious/depressed?” I have no idea! What is making you stable?! Why are you fine???\n\nI experienced life without mental illness briefly last year when I first started taking new meds and I can’t even explain how different I felt. How easy everything was because half my brain wasn’t preoccupied with unconscious bullshit. How much energy and passion I had for things. How connected I felt to everyone because I no longer felt different.\n\nI deluded myself into thinking I’d ‘recovered’ due to hard work and effort, that it was in my control all along. But the truth is I didn’t do anything different than I normally do, the positive thoughts and behaviour came naturally to me, the way I imagine it does for people who are mentally well.\n\nSome people think we are just doing this to ourselves by being too self-critical and irrational, and not looking after ourselves properly. “You just need to eat healthy, go to the gym, shower daily, get enough sleep, and think positive.” Right. Those might be simple everyday tasks for someone without depression, but for someone with depression it is a real struggle. When you are in the depths of despair, personal care and positivity is the last thing on your mind. The first thing on your mind is “What the fuck is the point?” and trying to overcome that thought is a monumental task in itself.\n\nIt's not easy being close to someone with a mental illness. It’s frustrating as hell, for everyone involved. It might seem like an ‘excuse’ for just being rude/ignorant, lazy, weak, awkward, negative, or a shit friend, but that’s classic stigma. I explain this shit over and over because it’s a valid reason. The struggle is constant, and when external life challenges coincide with this ongoing internal battle, it can easily get too much. That doesn’t mean we are weak. We are strong as fuck to keep fighting a silent illness every day on top of dealing with difficult life circumstances."
                },
                {
                    "authorName": "Megan Holstein",
                    "authorUrl": "https://www.quora.com/profile/Megan-Holstein-1",
                    "authorDescription": "Writer at Medium (2018-present)",
                    "text": "The difference between clinical depression and a rough patch in your life is not only a difference in severity, it’s a difference in quality. When you are going through a period of sadness or grief in your life, you feel sad or you feel grief. When you are depressed, you feel nothing.\n\nPeople who are moderately/severely clinically depressed tend to identify with these statements:\n\n * I feel nothing inside. It’s just empty.\n * I would rather feel angry or sad than feel this.\n * There is no reason for me to get out of bed.\n * I feel like everyone else is so far away from me.\n * I don’t feel connected with people in my life.\n * I feel like I am made of stone / I am not alive inside.\nDepressed people typically know in their heads these statements don’t reflect reality, yet they identify with them anyways.\n\nIf you identify with any of these statements, talk to your doctor. My personal recommendation to someone who is depressed for the first time to ask their doctor to get you connected to a therapist."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "It’s a serious illness.\n\nPeople don’t realize the brain is just as much an organ as your heart or liver. And that means your brain can get sick too. Depression is slow-starting and many don’t realize it until they’re deep in.\n\nIt robs you of positive emotions and feelings. You’ll feel negative things for awhile, then nothing. Apathy is worse than you’d think; there’s a difference between not giving a damn and not being able to give a damn. You feel empty and exhausted, like life is a painful existence you’re forced to endure.\nIt’ll eventual show physical symptoms. Sleep patterns are messed up, you’re starving/eating all the time, you look like a ghost haunting this world, maybe you started cutting to try and feeling something again…a lot can happen. You’ll suffer just as bad physically as you do mentally. The brain controls everything in the body so if the controls are glitching, the rest of the parts would too.\n\nAnd then there’s the end result. Some people can’t withstand the pain anymore and commit suicide. There are those who cut too deep, accidentally killing themselves. People could turn to alcohol or drugs, both possibly ending the same way. Or maybe you do live to be the average age of a person….but you’d be spending that life tormented by your condition.\n\nDepression poisons the body and spirit. It shouldn’t be passed off in some stupid excuse like “hormones” or “overdramatic personality”"
                },
                {
                    "authorName": "Tommy Thompson",
                    "authorUrl": "https://www.quora.com/profile/Tommy-Thompson-10",
                    "authorDescription": "one of the planet dwellers",
                    "text": "The first time it happened to me I really didn't know what was wrong.  I was a child and I just believed what the teachers and my parents told me.  They said I had no initiative, I was lazy, etc.  But I was suffering.  I felt like damaged goods.  I thought there must be something terribly wrong with me.  \n\nWhen I was a teenager, it was the same thing.  Motivation was a rumor.  I fell asleep in school.  Psychic pain became a normal state that I accepted because I thought I deserved it, after all I was a kid who just didn't have any initiative or desire to make the effort to live like others in the world.  The other kids seemed different, and I did not understand their joy or happiness over what seemed like mundane things.  It's like they could see colors I could not.  The more I suffered the more I was silent about it.    Ashamed of feeling like a loser, I tried very hard each day to go through my life but it took everything I had to get out of bed and go to school.  I played sick alot.  The counselors at school called meetings with my parents because I had very high standardized test scores and a C minus grade point average.  The teachers said I was a rebel which hurt me deeply because that is the last thing I wanted to be.\n\nWhen I was twenty one years old I had an episode of depression, anxiety and panic that was so bad I couldn't get out of bed and go to work for a week.  I told work and my roomate that I was sick with the flu.  I thought I needed to go to the hospital and tried to wait in line in the ER at a large county hospital but I couldn't bear it and went home.  I went to my primary physician and he gave me huge doses of IV vitamins and cortisone.  That pulled me out of it slowly but the depression continued for a few hours every morning for weeks.\n\nIt wasn't until I was an adult and depression became a more acceptable diagnosis and there were better antidepressants that I was treated with an SSRI antidepressant and I have not fallen into a deep depression for 30 years, except for twice when I went off the antidepressants.  One of those times I ended up in a crying spell that lasted for two days.  I couldn't stop sobbing.  It was exhausting.  I thought I was going to die from it.  The psychiatrist who treated me in the ER told me that I was one of those people he would tell to never, ever go off your antidepressants.  That was 20 years ago and I have followed his advice and been relatively depression free."
                },
                {
                    "authorName": "Donna Hales",
                    "authorUrl": "https://www.quora.com/profile/Donna-Hales-2",
                    "authorDescription": "Diagnosed with depression 1996. Still ongoing",
                    "text": "The first time I was given depression as a diagnosis, it wasn’t a question of WANTING to get help, it was a friend that made me go to see my GP, because I was in complete denial that anything was wrong. And believe me, being a nurse does not make the process easier.\n\nI’ve had several relapses since my first diagnosis back in 1996. Sometimes I’m aware that I’m ‘sliding’, sometimes I’m not. If I’m completely honest, I never WANT to get help, but deep deep down, I know that if I’m going to get through it, I NEED help. Most of the time, the help I need is really really difficult to engage with, and knowing this, doesn’t make me want to get help at all."
                }
            ]
        },
        {
            "question": "What is it like being clinically depressed?",
            "url": "https://www.quora.com/What-is-it-like-being-clinically-depressed",
            "suggestedAnswer": [
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "The symptoms vary from person to person, they might overlap with other mental illnesses but the most common include:\n\n- Sleep disorders, early morning wake ups or tendency to oversleep or lack of sleep.\n- Eating disorders, tendency to eat a lot or a total lack of desire for food.\n- Loss of self-esteem, tendency to mix with the crowd, while trying to get away from friends and society.\n- Extreme feelings of guilt for no logical reasons, feeling worthless and blaming yourself with negative thoughts.\n-  Lack of motivation to do anything you wanted to do in the past. Feeling empty and exhausted.\n- Feeling tired all the time even after waking up.\n- Having thought races especially negative thoughts about yourself, the future and your past, accompanied by stress.\n- Suicidal thoughts\n\n\nIn any case visiting a psychiatrist is very much recommend. Also doing a blood test is reasonable since some physical illnesses can have the mentioned symptoms."
                },
                {
                    "authorName": "Ashley Rose",
                    "authorUrl": "https://www.quora.com/profile/Ashley-Rose-15",
                    "authorDescription": null,
                    "text": "Everyone here is trying to describe it in their own unique way. I'm just going to say it feels like utter crap. Everything just feels like crap."
                },
                {
                    "authorName": "Margie Bock",
                    "authorUrl": "https://www.quora.com/profile/Margie-Bock",
                    "authorDescription": "works at Retirement",
                    "text": "A deep dark hole where there is no light or hope. A total lack of self worth. Self hatred. The pain is so huge that death sometimes seems the only antidote. Feelings of complete isolation and loneliness. An overwhelming sense of sadness. Having no views of any future nor wanting to live in any future. Exhaustion. Body aches. Hopelessness that is a constant state. Unable to communicate or share feelings with others. Complete despair."
                },
                {
                    "authorName": "Karishma Kankaria",
                    "authorUrl": "https://www.quora.com/profile/Karishma-Kankaria",
                    "authorDescription": "typically Indian",
                    "text": "It's quite interesting; the kind that I won't even wish on my enemies.\n\nI have an observation to share — depressed folks, specially those who have the clinical kind and have had this for quite some time have better than average sense of humour. They crack better jokes and pj(s) and puns. My theory is there are two things that are at work here (a) because they are so depressed they like to make other people laugh, it lets them feel better about themselves even if it's for a moment (b) they use it as an effective mask and camouflage. Like, who will suspect you of being depressed when you are cracking jokes?\n\nAnd that is one major issue of being clinically depressed — you really obsess about not letting people know. It's really hard to seek help.\n\nTriggered depression, because it's correlated to some event(s), is easier to understand.\n\nClinical depression can also get labeled as “attention seeking behavior” or “being lazy and difficult”. Which brings us to the next issue — depression makes people mean. I can be absolutely savage and need to watch my words constantly. It comes, in part, from having a low patience threshold and continuously being on edge and in part, from the belief that you don't deserve the care, love n' attention you are getting, so you push people away.\n\nWhich leads us to the next point — how it completely kills your sense of self-worth. You constantly feel guilty for every good thing that comes your way; you can't believe that people really would want to be your friends. Of course, you know you are good or cool or something but it never feels enough or okay. And you question everyone and everything who tries to be near you or care for you. And you feel so bad for taking up people's time, or space, or eating. Some days it becomes absolutely impossible to breath.\n\nThere are good days, sporadically. Not enough. And they leave you feeling even worse later because you allow yourself to feel good for some hours, maybe days and then you feel even more guilty.\n\nIt's like walking around with a 10 pound stone on your chest all the time and trying hard to hide it from other people. Sometimes you do put the stone down, and there are a few precious breaths of freedom but then it's back on the chest and onwards you continue.\n\nAlso, the constant fascination with death. Even if you are not suicidal you think about “ceasing” a lot.\n\nAs I said, I wouldn't wish it on my enemies.\n\n\n%3E Originally Answered: What is it like to be clinically depressed?\n"
                },
                {
                    "authorName": "Michael Doherty",
                    "authorUrl": "https://www.quora.com/profile/Michael-Doherty-178",
                    "authorDescription": "studied at Grangemouth High School",
                    "text": "Like you’re drowning but you look around and see everyone else breathing.\nLike a weight is pushing down on you.\nLike nothing matters.\nLike life is pointless.\nLike people are cold, distant and strange.\nLike the world makes no sense.\nLike there is a force that is trying to grind you down but you can’t see it.\nLike your mind wants you to die.\nLike your body is weak and you can’t do anything.\n\nIt’s not as much fun as I make it sound though :/"
                },
                {
                    "authorName": "Sara McInteer",
                    "authorUrl": "https://www.quora.com/profile/Sara-McInteer",
                    "authorDescription": null,
                    "text": "For a couple months, my medicine managed my depression so well I felt as if I wasn't sick at all. I had so much energy and I didn't cry myself to sleep or even cry much at all. Everything was enjoyable, the books and video games I used to love didn't leave me feeling empty anymore. All the pain was gone, I didn't suffer from headaches or tension or general body aches. I hardly spent any time in bed and could get everything I wanted done and more. The was no fear to make art that I would just hate anyway. My head felt completely clear, not foggy in the slightest. Learning was a joy instead of a struggle to even pay attention. Interacting with people felt more natural despite that I was still suffering from anxiety. Sleeping was easy, I could fall asleep fairly quickly, woke up refreshed, and slept through the night without night terrors. There was a sense of control, everything I felt, did, or thought felt like my self.\n\nUnfortunately this didn't last and I felt more afraid than ever to take new medications after I plummeted down into depression again."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "It's an experience distinct from sadness. Like other have said, clinical depression is a void or an abyss. It's the absence of feeling--like that part of the brain has just been turned off somehow. \n\nYou realize that you are not enjoying things that you should. Receive a compliment from your boss? No feeling. Christmas Eve party with friends and family? No feeling. Snuggle up next to your loved one? No feeling, aside from disappointment at being unable to enjoy a moment that should be beautiful. This is called anhedonia, and it's terrible, especially if you can remember how great those things used to feel.\n\nAt the same time, you can't remember very well. This is related to anhedonia. People remember things that trigger strong emotional responses, and so, if you lack the normal emotional stimulus associated with important events, those events are not committed to memory. There is a two year period of my life during which I was deeply depressed, and I can remember almost nothing from that time.\n\n\nEverything feels like too much work. I mean literally everything. Answering emails, grading papers, focusing on conversation, showering, cooking and eating food--all of it feels overwhelming. You realize how ridiculous it is...how most people do not see preparing lunch as an unbearable chore, for example. And yet  somehow you just can't force yourself forward. This is called avolition, and it's just as bad as anhedonia. If left to my own devices, I would have happily layed in bed all day staring blankly at the ceiling.\n\nThese factors, along with others, combine to send your life into a tailspin. Without treatment, the level of dysfunction some people reach is stunning. I've heard stories of people alienating themselves from friends and family, locking themselves in their apartment for a weeks on end without eating or showering until the pains of starvation force them out into the world to buy groceries. In clinical depression, rock-bottom doesn't necessarily exist. And if it does, many people kill themselves long before they reach it. \n\nI was lucky enough to have a sufficient support network in place to save my life before I was able to do anything drastic. I am eternally thankful for the people who helped me, and saw that I received the treatment I needed. As terrible as depression can be, it IS treatable. Depression is not a terminal disease--which is a truth I try to remember whenever it flares up again."
                },
                {
                    "authorName": "Derek Book",
                    "authorUrl": "https://www.quora.com/profile/Derek-Book-1",
                    "authorDescription": "Worked as a homeless case planner for many years",
                    "text": "I heard there was a guy, (maybe in Chicago?) Who was not depressed, but it's just a rumour."
                },
                {
                    "authorName": "Karen Garnet",
                    "authorUrl": "https://www.quora.com/profile/Karen-Garnet-1",
                    "authorDescription": "Director  (2016-present)",
                    "text": "Really frustrating! Frustrating as it is such a hard fight everyday. There are days where everything feels more manageable and it is such a nice feeling and then bam you hit rock bottom again.\n\nI have been struggling for over two years now. I am however learning some new skills. I know how important recognising your triggers are and how important self care is.\n\nI have slowed my life right down and don’t book things in the diary like I used to as I find it too overwhelming.\n\nI take a day at a time now and see how I feel on the day. If I feel better I will plan a visit to friends/ family and if I am not good I spend the day helping myself through it.\n\nExercise is an real help so if I am having a really bad day I try to swim or go for a nice walk"
                },
                {
                    "authorName": "Kellie Burke",
                    "authorUrl": "https://www.quora.com/profile/Kellie-Burke",
                    "authorDescription": "former HR Compliance Manager at Booz Allen Hamilton (2006-2012)",
                    "text": "I can't get out of bed most days. Certainly don't leave the house much. I feel like I'm living in purgatory, because this is no life. I feel my life slip away and I'm wasting it. Except I know I can't help it.\n\nBasic care, like showering, brushing my teeth is incredibly difficult.\n\nI shut myself off from my friends because I felt ashamed about my illness, and because a close friend told me it was my own fault. So I go through life without a support system.\n\nI think I have more empathy than before I got sick, but other than that, there is nothing good about living with major depression."
                }
            ]
        }
    ]
}