{
    "topic": "post traumatic stress disorder",
    "mainEntity": [
        {
            "question": "What is it like to suffer from post-traumatic stress disorder (PTSD)?",
            "url": "https://www.quora.com/What-is-it-like-to-suffer-from-post-traumatic-stress-disorder-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Going anonymous, like many answerers to this question. That in itself is significant.\n\nHaving PTSD is isolating. It's lonely in a way that nothing else is. The very condition that makes you feel so isolated in the first place is also the one that prevents you from being able to reach out and form the connections you need to stop feeling isolated. And the loop circles on forever.\n\nIt's isolating because people don't understand it. They think that if I feel lonely that I just want to be around people. But to be around people, I have to pretend to be normal. When I manage to seem normal, I feel even lonelier because they don't see me for who I am. And when I don't succeed at seeming normal, because I'm trying to be myself, it's obvious how much people prefer the fake me, which makes me feel even more isolated, and like a freak.\n\nSometimes people try to relate by saying \"I've experienced some traumatic stuff, too\" but they don't have any idea what they're actually talking about. They don't understand that they're diminishing your pain, because they really have no frame of reference for what you experienced. They think they're sympathizing, but they're just reminding you how alone you are.\n\nThey may try to comfort you, because they think your psyche is something that can be repaired by a hug and a few nice words, the same way their bad mood can be. They may try to get you to talk about it, so they can comfort you. And, on the rare occasions you do offhandedly, emotionlessly mention something that you just took for granted as a part of life, they look at you in horror and exclaim about it. And then you realize again that you could never share with them any of the really bad stuff, the stuff that wakes you in the night with your heart pounding and your body drenched in sweat.\n\nIsolating.\n\nThey don't understand why you don't want comfort, don't want to cry it out. They don't understand why people equals danger, why the only time you feel safe is when you're alone, but that you're never alone because of the things inside your head. They don't understand that, for you, the entire world has been altered and that you don't live in the same place they live any more.\n\nIsolating.\n\nGetting to know new people is risky and hard. But the people who you know don't know you any more. You aren't the person you used to be. You never will be. You can see how much they prefer the old you, see them waiting for you to go back to being that person, but you know you will never be that person again. People feel rejected by you, and pull away. You let them.\n\nIsolating.\n\nYou're on edge, irritated by everything. You scan doorways, watch windows, avoid touching anyone, avoid being touched. Emotions make you uncomfortable. You're afraid of overreacting, so you don't react. People treat you like you feel nothing, and sometimes they're right. You move through the world like an automaton, waiting for something to trigger your crazy switch. Something always does.\n\nIsolating."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Imagine this.\n\nTonight, since you’re home alone, you decided that you were going to prepare yourself pasta, and you decide to make everything that you will eat yourself, so you get out some tomatoes to make some marinara sauce.\n\nYou clean the tomatoes, taking them out of the water, and you take out the knife to cut them into chunks.\n\nEverything is going well, you’ve already gotten through two of the four tomatoes you are preparing to reduce to chunks.\n\nThe little red cubes that you’ve already crafted are waiting impatiently in the glass bowl that you placed next to your kitchen-space to prepare the sauce.\n\nIn your hurry, you make a big mistake.\n\nThe knife slips.\n\nYour finger is suddenly ablaze with pain.\n\nThe half-sliced tomato is drowning in crimson liquid, only a shade darker than the food that you were preparing for yourself.\n\nYou clumsily drop the knife and grab a paper towel, trying to stop up the flow of blood escaping from your sliced finger.\n\nIt’s bad.\n\nYou have to call your family to take you to the hospital.\n\nThe blood won’t just stop coming out, filling every crease and spilling over your clothes, your dignity coming out with it.\n\nA couple hours later, the doctors have glued your finger back to rightful place, but it still hurts like when it happened.\n\nYour finger is blue and purple. The doctors told it was going to leave a scar.\n\nYou sleep, but something keeps nagging at the back of your mind, something isn’t right.\n\nNext morning, you feel jittery, all of your fingers tremble and shake, they’re useless, so you take the day off work.\n\nBut when you try to eat your breakfast, the glint of silver spoon you’re using reminds you of the knife that you cut yourself with last night.\n\nYou choke on your cereal, and switch out your metal spoon for a plastic one from the ones kept in the drawer where you put the cutlery that take-out gives you when you order out.\n\nYou want to put on your favorite red t-shirt, but as you look at yourself in the mirror, all you see is blood, running down your body.\n\nThe day after next, you try to prepare yourself dinner, but your hands start shaking as soon as you open the drawer where you kept the knife.\n\nYou order out instead.\n\nThat night, your consciousness is plagued with your family members and best friends being chased by shiny and sharpened knifes that drip crimson-colored blood onto the floor, slicing your loved ones apart, starting from the fingers up.\n\nThe nightmares don’t stop the next night, nor the one after the next.\n\nThe day after that, you go out to dinner with your friends, to your favorite restaurant, but when you see your friend slicing open the meal with the knife, your head starts to swim, and all you can see is the reflection of light bouncing off the metal.\n\nYou excuse yourself as quickly as you can, and you have a panic attack in the bathroom stall.\n\nYou can’t deal with it anymore.\n\nEveryone is telling you that your fears are stupid, and you manage to convince yourself that they are right.\n\nBut no amount of trying to convince yourself that nothing is wrong, and that you’re just stupid will let you enter the kitchen, that your brain has labeled as out-of-limits.\n\nYou can’t step into that room without your mind drowning under the sheer amount of thoughts that crowd your brain.\n\nYour eyes start to water, and it seems as though there are not enough tears for you to cry.\n\nAll you can do is suffer in silence, while your loved one’s calls of “just get over it already” and “it wasn’t even a big deal anyways” will drown out the cries of “you are in danger” and “you are stupid and weak” coming from your brain.\n\n\nNow put this in into perspective, imagine the exact same situation, but replace it with something else.\n\nA person watching their family or friend die before their eyes, or failing to take care of them, without being able to do anything to prevent it.\n\nA child being relentlessly bullied at school for years.\n\nA soldier watching the comrades they trusted with their lives fall in war.\n\nA person getting raped by someone they thought they trusted, or a complete stranger, in somewhere they thought was safe.\n\nA person in an abusive relationship that they can’t get out of.\n\nA child being beaten by their parents, other friends or family members without any way to retaliate or protect themself.\n\nA student coming to school only to realize that their best friend committed suicide and they couldn’t do anything to help.\n\nAnd so many more situations.\n\nThis is exactly what we feel like.\n\nPeople tell us to get over it, but that’s the one thing that we just can’t do.\n\nThat is the one thing that is wrong with our minds.\n\nWe are forced to constantly relive our past traumas, and feel the same feelings we felt then, right there in that moment.\n\nWe are plagued by the feeling we could have done something, or that it was all our faults, when it really wasn’t.\n\nSo next time, don’t judge for being forced to feel these things over and over again, we can’t just “get over it” or “forget about it” like you.\n\nWe have to feel it everyday, over and over again.\n\nNo matter what the situation may be.\n\n\nSend help.\n\n%3C/3"
                },
                {
                    "authorName": "Paul D. Fisher",
                    "authorUrl": "https://www.quora.com/profile/Paul-D-Fisher-1",
                    "authorDescription": "PhD, Combat Veteran, Psychologist, Mensan, author, editor",
                    "text": "I will tell of some of my combat CPTSD symptoms:\n\n * These have occurred over many decades, evolve and are stage dependent.\n * Sleep fighting, especially when stressed.\n * Nightmares of death situations.\n * Hyperalertness, especially at night.\n * A penchant for fortifying the home, sleeping places.\n * A focus upon many weapons and ammo.\n * Frequent thoughts of killing self or others.\n * Strong reactions to any potential threats.\n * Mood swings and social withdrawal.\n * Sleep disturbances, day sleeping.\n * Sociopathic behavior and characteristics.\n * Seeing most things as temporary, disposable.\n * A willingness to harm others seen as offensive.\n * Self-medicate through substance abuse.\n * Thrill, stimulus seeking and risk taking.\n * Unstable relationships.\n"
                },
                {
                    "authorName": "Kymberly Johnson",
                    "authorUrl": "https://www.quora.com/profile/Kymberly-Johnson-5",
                    "authorDescription": "Artist/designer  (1994-present)",
                    "text": "I have complex PTSD from a lifetime of trauma and abuse but I won't bore you with all the details. My husband of 12 yrs told me he was going to take a shower and kissed me on the forehead while I was watching tv. After awhile I realized he had not came to bed so I went to check on him and couldn't find him. I started looking everywhere and went into the big metal building we called the barn and didnt see him and started to leave when I heard our cat crying up above me and found my husband hanging from the 16 ft rafter. He still had tear streaks on his cheeks. All I could think about was I have to get him down brfore its too late. I grabbed a ladder and a machete and started trying to cut the rope and realized he would fall a long way to the cement floor, so I cut it most of the way jumped off the ladder while tugging his foot and mamaged to catch him and crumpled to the floor. That's when I realized he was cold. It was too late. I called my sister and she told me to call 911. I have lupus and had just got all my pain meds filled and in the 40 minutes it took for the ambulance to find us way out in the country, I repeatedly tried to swallow the pills to kill myself but I couldn't stop thinking about my kids and spit them out, only to try again and again and not be able to do it. I lost my mind for a long time. I was so angry and sad and wanted to die but couldn't seem to do it. I started using drugs and fought the police and tried to commit suicide by cop amd ended up in jail for multiple accounts of aggravated assault on a peace officer. A therapist told me I had PTSD but I didn't really understand. I was having horrific nightmares and panic attacks but I thought they would go away eventually. I did alot of self destructive things, had abusive relationships, was beaten and even raped, at one point I was homeless and almost died from having no potassium in my system from not eating and drinking enough in the 100 degree Texas heat. Eventually I got back on my feet and thought I had got past it, at least as much as I was ever going to. I stopped dating at all and was going to college and was writing a paper for my psychology class and was reading about PTSD and realized that it's not just nightmares and panic attacks… Things I just thought were my personality were classic symptoms. I cant maintain close relationships, I have a hard time getting attached or showing emotions even to my kids and grandkids, I prefer animals over people, Ive become basically agoraphobic and never want to leave my house. I have weapons everywhere in my house. I startle so easily that I cant open a can of biscuits. Any little thing makes me feel like I'm so terrified that im going to jump out of my skin. I have a constant feeling of impending doom. Sometimes I will just stop answering the phone for days and not talk to anybody. It's so hard to explain but I feel like I'm not living im just existing most of the time. Most people have no idea that there's even anythng wrong. It literally permeates e everything in my life."
                },
                {
                    "authorName": "David McPhee",
                    "authorUrl": "https://www.quora.com/profile/David-McPhee-1",
                    "authorDescription": "Ph.D. Psychology, University of Minnesota - Twin Cities (1994)",
                    "text": "I asked this question because I have an unconventional answer. I recently caught part of a very poplular series on Netflix called Outlander, a sweeping saga of historical fiction, with lots of romance and battles and a touch of historical realism, touching the 18th and 20th Centuries both.\n\nSeason 5, episode 8, finds a popular character hanged from a tree by order of the Redcoats. What makes the episode so remarkable is that parts of if are told in the style of very early silent movie.\n\nThe man is found to be alive and is cut down and revived. The rest of the old move scenes become his flashbacks for the rest of the episode and parts of the next one.\n\nIt’s a riveting portrayal of PTSD from the perspective of the trauma victim, done with high artistry and convincing imagery. It was both horrifying and fascinating, and seemed to capture the essence of what might have been one person’s deep experience. There’s also a lot of art and empathy in the portrayal of the slow recovery and ultimate resolution.\n\nYou’ll find it all in Season 5, Episode 8, with the old movie part beginning around 06:20 minutes, and continuing well into Episode 9.\n\nSome folks should consider not watching if they fear it might be triggering, or they could ask a friend who’s seen it for a description."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "For me it was being exhausted, yet afraid to go to bed, because I just knew I'd be waking up in the middle of the night feeling it happen all over again. It was buying unscented laundry soap, because the smell of clean laundry makes me want to vomit. It was being so anxious, I couldn't sit down, not even to eat. It was being unable to tolerate the weight of my newborn baby on my chest because it reminded me of being stuck under a much bigger body. It was not saying anything, despite my brain shouting at me to say no, because I too keenly remembered the feeling of “I'm going to die” when I did say no 15 years ago. It was surviving, spending entire days just trying to manage the onslaught of triggers, many unknown, trying to function somewhat. It was going to therapy, because the feelings were literally killing me, and being 8 months pregnant, I felt that suicide wasn't fair to my baby.\n\nFor me, PTSD was (is, maybe? It's better, but I'm not there yet) a constant state of overwhelm, a being triggered by even the most innocent of things. An inability to be in my body, a seeking escape somehow where none was to be found, because the very thing I was trying to escape from, had basically poisoned my mind."
                },
                {
                    "authorName": "Chloe Thompson",
                    "authorUrl": "https://www.quora.com/profile/Chloe-Thompson-168",
                    "authorDescription": "Neurological Studies at PSU (2018-present)",
                    "text": "Boring.\n\nAt first it was awful. One goes from being an outgoing, excited, happy individual to (BAM) suddenly being afraid of everyone, even people you are supposed to trust. Its a confusing, anxiety-soaked time. It’s very painful. You lose people who love you, and you love. Nobody understands you (even the ones who say they do), and it can be very lonely.\n\nSo, over the years, you pull into yourself and develop a routine that doesn’t necessitate the need to go out and interact with people often. You learn how to put on a mask so that you seem normal when you do have to go out, but wearing it is incredibly exhausting. If I spend the day outside of my apartment, engaging with other people (like, at work), I come home and crash at 6pm… then I sleep for twelve hours. If I am spending the day at home alone, I don’t do this.\n\nPeople try to encourage me to go out, saying that it will “be good for me.” I know they mean well, but they are only pushing me away. The moment anybody shows interest in being my friend or lover, I GHOST them. Even if I like them, I can’t handle needing to feel responsible for the maintenance of interpersonal relationships. Again, people don’t understand me… I am perfectly happy being alone and sleeping all the time. My ideal day would include working on a Chipotle burrito while marathoning a new Netflix release, with a hot blanket and an open window.\n\nAgain, people are surprised when they realize the incredible, fortress-esque boundaries you have. They would never have pegged you for someone with crippling anxiety and depression. They would have never, in a million years, have thought you were as scared as you are.\n\nSo… It’s not bad, after a while. You get used to it. You live your life. Every year, you creep toward progress, and I have to assume that I will be okay someday. Maybe not how I used to be, but okay.\n\nADDITIONAL THING: One symptom of PTSD that I had never really heard about, but which has affected me profoundly, is the heavy, heavy brain fog that comes with it. During the first year I felt like my IQ had dropped 30 points. I assumed I had early-onset dementia, MS, or some sort of tumor. Doctors were flummoxed. Multiple MRIs showed no abnormalities… It wasn’t until I started therapy that I was told that this is not an infrequent complaint of people suffering PTSD. This, too, is very, very slowly starting to get better. I still need an extra few seconds to answer questions, and I often stutter or forget common words like “car” or “computer.” I have forgotten a lot of peoples names, even friends or coworkers that I see daily/weekly. People are always offended, and they walk away thinking that you are both SUPER dumb AND an asshole… Yeah, the brain fog is one of the worst parts."
                },
                {
                    "authorName": "Ryan T. Riddle",
                    "authorUrl": "https://www.quora.com/profile/Ryan-T-Riddle",
                    "authorDescription": "lived in San Diego, CA",
                    "text": "Hell. Pure hell. When it’s bad, like this week, I will dream of being trapped unable to do a thing. I will wake screaming at no one or slamming my fist repeatedly into my bed or pillow. I can’t regulate my emotions, if at all. The smallest thing will elicit the strongest emotion—usually frustration and anger followed by crushing, unbearable sadness."
                },
                {
                    "authorName": "Don MacLeod",
                    "authorUrl": "https://www.quora.com/profile/Don-MacLeod-4",
                    "authorDescription": "Author, Poet, Ordained Minister (1982-present)",
                    "text": "It's essentially being trapped in a memory that's just as real as if it was happening now. Your mind can't sort out that it's not real. \nFor example, you step out into the street and a car runs a red light, you see the car coming at you and can't get out of the way and then you get hit. That memory runs over and over and your head and every time it's just like you're there."
                },
                {
                    "authorName": "Becky Blanton",
                    "authorUrl": "https://www.quora.com/profile/Becky-Blanton",
                    "authorDescription": "TED GLOBAL Speaker, ghostwriter, former cop and journalist,",
                    "text": "WARNING!! GRAPHIC GRAPHIC LANGUAGE. \n\nJUST READING THIS MAY TRIGGER PTSD IN THE READER. \n\nI think PTSD is different for everyone who experiences it. As a photojournalist who has/had PTSD I would drive past places where I had photographed a death, accident scene, severe trauma or a shooting and be able to hear the screams, smell burnt flesh or experience the event as though it was happening or had just happened. All the emotions that accompanied the original trauma were as fresh as the day I experienced them - like photographing a woman who attempted suicide by pouring kerosene on herself and lighting herself on fire. She was still on fire and her skin was falling off of her when firemen carried her out of the building. I can't drive down that street, in that neighborhood or see a Victorian house with a certain kind of porch or railing without flashing back there.\n\nI won't drive or get into cars that I have seen as part of a fatality.\n\nI've been an ambulance attendant, police officer and a journalist/photojournalist and have seen close to 100 people who have experienced severe, severe trauma - like disembowelment from being hit by a car and dragged 50 feet down a highway like an animal. I've had to scoop up brains on the pavement when cleaning up an accident scene, gone looking for and picked up severed limbs at a train wreck, watched mothers and fathers holding dead children at an accident scene while they screamed \"Don't die!\" in the most heart wrenching place possible within. \n\nI've watched colleagues do CPR on someone whose skull has been crushed and who is dead, but that you have to treat because as an EMT you're not allowed to determine who is dead until the coroner arrives - or so they reason. Arriving on scene of a suicide and having to talk to family members, or worse, being the one who must pick up personal effects at a fatality. Being shot at by gang members when rolling up to a police scene that's still hot. Photographing a car accident only to realize that what I'm looking at is a decapitated body...Feel dizzy yet? Numb? Shocked? Uncertain how to respond? Welcome to PTSD.\n\nThe worst part of PTSD for me are the nightmares, the hyper-vigilance, the adrenalin rush and the stress of always being focused on my environment. PTSD is, more than anything, an in-your-face realization of your own mortal nature and of the fragility of life itself. Headaches, fatigue, discomfort in places where there are large numbers of people (7-10 and up), emotional numbing and inability to have close relationships can be a problem as well. Therapy, reframing, EMDR, and a variety of techniques have worked well for me, but I admit, there are many days it is just a relief not to have to leave the house."
                }
            ]
        },
        {
            "question": "What is PTSD and how can you treat it?",
            "url": "https://www.quora.com/What-is-PTSD-and-how-can-you-treat-it",
            "suggestedAnswer": [
                {
                    "authorName": "Rohit Bimbrahw",
                    "authorUrl": "https://www.quora.com/profile/Rohit-Bimbrahw-1",
                    "authorDescription": "Freelancer Blogger (2004-present)",
                    "text": "Post-traumatic stress disorder (PTSD) is a mental health condition that develops after witnessing or experiencing a terrible event. Flashbacks, nightmares, and extreme anxiety are all possible symptoms, as can uncontrollable thoughts about the event.\n\nPeople with PTSD experience persistent, disturbing thoughts and feelings about the traumatic event long after it has occurred. They may have flashbacks or dreams about the event, as well as feelings of sadness, fear, or anger, as well as feeling disconnected or estranged from others. Persons who suffer from PTSD may avoid situations or people who remind them of the traumatic event, and they may have strong negative reactions to seemingly benign things like loud noises or inadvertent touching.\n\nWhat are the treatments for PTSD?\n\nCognitive Processing Therapy\n\nProlonged Exposure Therapy\n\nMedications\n\nFor more info visit:\n\nhttps://www.ammiraticounseling.com/services/private-therapy/individual-counseling/\n"
                },
                {
                    "authorName": "Marlene Matlock",
                    "authorUrl": "https://www.quora.com/profile/Marlene-Matlock",
                    "authorDescription": "Married to a Covert Malignant NPD for 47 years",
                    "text": "PTSD is an acronym for Post Traumatic Stress Disorder which is a disorder in which a person has difficulty recovering after experiencing or witnessing a terrifying event. When a person is exposed or experiencing a traumatic event(s) this condition can develop. If you have these symptoms, you need to make an appointment with a psychiatrist to work through these issues. Treatment includes different types of trauma-focused psychotherapy as well as short-term medications to manage symptoms.\n\n * Flashbacks of the traumatic event(s)\n * Feeling emotionally numb!\n * Detachment from Family & Friends\n * Difficulty sleeping!\n * Easily irritated.\n * Partaking in self-destructive behavior (i.e., alcohol, drugs, cutting)\n * Nightmares relating to the traumatic event(s)\n * Having negative thoughts about yourself\n * Physiological reactions when reminded of traumatic event(s)\n * Short term memory loss (may not remember parts of the traumatic event(s)\n * Loss of nterest in activities\n * Avoiding people people/anythingrelated to the traumatic event(s)\n * Experiencing anxiety and/or depression.\n * Difficulty concentrating\n * Feelings of hopelessness\n"
                },
                {
                    "authorName": "Marc Lambert",
                    "authorUrl": "https://www.quora.com/profile/Marc-Lambert-9",
                    "authorDescription": "Inventor/Producer of \"EGMi Metacognition for the Masses\"",
                    "text": "PTSD occurs when the faulty right brain becomes overactive both consciously and subconsciously and many anxiety symptoms can be experienced, a person may have clinical anxiety symptoms or develop sexual or other OCD that is often not recognised as connected to the PTSD.\n\nSome will seem to get aggressive for no reason but this is subconscious anxiety relief, it is diagnosed a lot now in non-combatants I got if from a bad prescription drug withdrawal.\n\nIt is treated in many ways I used EGMi this reduces right brain use so anxiety can not be generated, this also prevents stress form reactivating the right brain so we do not relapse, more info: EGMI Metacognition for the Masses [ http://www.evolutionalgoodhism.com/egmi-metacognition-for-the-masses.html ]"
                },
                {
                    "authorName": "Michael Fitzjohn",
                    "authorUrl": "https://www.quora.com/profile/Michael-Fitzjohn-1",
                    "authorDescription": "I have PTSD.",
                    "text": "PTSD: National Center for PTSD [ https://www.ptsd.va.gov/public/ptsd-overview/basics/what-is-ptsd.asp ] Here is the definition of a disease I have.\n\nThere are several ways to treat this disease.\n\nPTSD: National Center for PTSD [ https://www.ptsd.va.gov/public/treatment/therapy-med/treatment-ptsd.asp ]\n\nCognitive Behavioral Therapy helped me learn how to live in the present.\n\nPTSD is like Diabetes. There is no cure but you can learn how to live with this disease.\n\nI was diagnosed with PTSD 15 years ago. I have received talk therapy for years. This works but additional therapy helps you learn how to own the past, let it go and focus on living in the the present."
                },
                {
                    "authorName": "Angela Cales",
                    "authorUrl": "https://www.quora.com/profile/Angela-Cales-1",
                    "authorDescription": "I have Lupus, Diabetes, Cardiomyopathy, and Fibromyalgia",
                    "text": "PTSD is Post Traumatic Stress Disorder. The body’s natural response to a traumatic incident (or prolonged, repeated trauma sustained over a period of time) is to provide a coping mechanism to help process this stress. Anxiety is actually the brain’s way of trying to keep you safe, so if you’ve endured a major trauma, you begin to become hypervigilant to danger. This develops into what we label PTSD.\n\nThe symptoms of PTSD are:\n\n * Flashbacks, reliving the trauma\n * Sleep disorders such as insomnia, sleep walking, or night terrors\n * Hyperawareness and heightened startle response\n * Intrusive negative thoughts\n * Outbursts of anger or the inability to control one’s emotions\n * Loss of interest in normal activities and hobbies\n * Avoidance of triggers\n * Distorted feelings of anger, guilt, or shame\n * Trouble remembering key events of trauma\nRecovery is unfortunately a long and often difficult process. It may consist of any combination of the following: treatment from a skilled trauma-informed therapist, medications to ease symptoms (help in sleep or lessen anxiety/depression), EMDR, help from a service animal (for compression therapy, interruption of panic attacks, etc.) and support groups."
                },
                {
                    "authorName": "Lori McCullough",
                    "authorUrl": "https://www.quora.com/profile/Lori-McCullough-7",
                    "authorDescription": "Advocate for Mental Illness Awareness",
                    "text": "Post Traumatic Stress Disorder. It generally requires therapy and medication as part of a long term treatment plan. It has an infinite number of causes. Each person perceives the world through individual eyes … what would cause some people distress, others can easily dismiss. Trauma, a traumatic experience, an uncomfortable incident occurring repeatedly, or a series of small but unrelenting upsets can cause PTSD. I have never served in the military. I did, however, watch live coverage from the Vietnam war fields on my grandparents television while eating dinner. I’m sure that simply because I remember it, it has a hand in my own PTSD. Be kind because everyone has different “triggers” or causes for sudden anxiety. There is no cure, but long term relief is possible."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "PTSD is from a traumatic event( not just going to war ) where the emotions are suppressed long term and not dealt with properly after the traumatic event happens. This leads to depression and anxiety as well as detachment, hard to express affection, rage, flashbacks and panic attacks, nightmares. The best way for me so far has been medication (Zoloft, klonopin, and trazodone for sleep) in tantum with psychotherapy and EMDR therapy plus journaling and meditation. I use breathing techniques and self hypnosis to be as first aid responses before taking Klonopin. I can be hyper vigilant in the terms of security and OCD with cleaning which is my outlet when I get amped up as an attempt to control my fears. I also use various vitamin regimens, magnesium baths, exercise to regulate relaxation anc help with stress.\n\nBest treatment is having a positive attitude, being resilient, and achieving realistic goals (celebrating even the smallest victories). You can’t apways control the triggers but you can control your preception and response through the things listed earlier in this response.\n\nGood luck to you."
                },
                {
                    "authorName": "Shriya Sarda",
                    "authorUrl": "https://www.quora.com/profile/Shriya-Sarda-4",
                    "authorDescription": "studied at Jaipur National University (2019)",
                    "text": "PTSD (Post Traumatic Stress Disorder) is a mental disorder that occurs due to a traumatic event you have experienced or witnessed below-mentioned events-\n\n * Involving in Serious Accidents.\n * Natural Disaster.\n * War Attacks.\n * Rape or Sexual Assualt.\n * Serious Injury.\n * Childhood Physical Abuse.\n * Fear of being threatened, etc.\nWhile Experiencing these Events, people develop these symptoms for which they need to seek medical help immediately.\n\n * Sleeping Difficulty\n * Severe Anxiety\n * Nightmares.\n * Several Emotional Distress\n * Recurrent and Unwanted Memories of Traumatic Event.\n * Difficulty experiencing positive emotions.\n * Negative thoughts about yourself, other people, or the world.\n * Irritability, angry outbursts or aggressive behavior\n * Overwhelming guilt or shame.\nWhen should you consult a doctor?\n\nIf you experience all these symptoms more than a month about this traumatic event and finding trouble getting your normal life back. Consult a psychiatrist or mental health professional.\n\nTreatments for PTSD-\n\n1. Cognitive Behavioral Therapy (CBT)\n2. Transcranial Magnetic Stimulation (TMS)\n3. Stellate Ganglion Block (SGB)\nI saw this video of a lady, Amber Lee, who had suffered from various forms of assault, abuse, trauma, and anxiety from an early age and well into her adult life. She had opted to have the SGB procedure for PTSD treatment and recovery. See how she shares her experience on how SGB treatment has changed her life for the better.\n\nhttps://www.youtube.com/watch?v=vJVRNYanaho&amp;t=40s\nI hope it helps.\n\nVideo & Image Source- Google."
                },
                {
                    "authorName": "M.P.",
                    "authorUrl": "https://www.quora.com/profile/M-P-3018",
                    "authorDescription": "PhD, MD Medicine and Healthcare & Ophthalmology (2018)",
                    "text": "Post traumatic stress disorder. Search the wiki (online encyclopedia) for a detailed explanation.\n\nIt’s not for you to treat it. It’s for your psychologyst and psychiatrist. So get them to give you the proper treatment."
                },
                {
                    "authorName": "Mike Isbad",
                    "authorUrl": "https://www.quora.com/profile/Mike-Isbad",
                    "authorDescription": "lives in Sydney, Australia",
                    "text": "PTSD is a condition caused by one or a number of life events that are psychologically damaging, like torture or losing loved ones. It is quite common amongst soldiers, police and victims of violent crime.\n\nAt the moment there is some confusion around treatment. Unqualified therapists have tarnished the reputation of helpful treatment methods and unscrupulous drug companies have spread disinformation around anxiolytics in order to sell ineffective SSRI / SNRI medication off label (without approval from regulators).\n\nGoing to a group session and finding a therapist who specializes in PTSD is important. A very high percentage of Doctors and therapists have been misinformed and hold damaging views. As a general rule; if you feel less than comfortable when talking with a Doctor or therapist, they probably lack the skill to treat yo and you should look elsewhere before they do more harm."
                }
            ]
        },
        {
            "question": "What are the symptoms of PTSD?",
            "url": "https://www.quora.com/What-are-the-symptoms-of-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": "Jeanette Sweet",
                    "authorUrl": "https://www.quora.com/profile/Jeanette-Sweet-2",
                    "authorDescription": "peace, love, wisdom and knowledge",
                    "text": "There are no definitive first signs to recognize that someone is suffering from C-PTSD. However, some signs could include:\n\n * Sleep disturbances. Problems such as falling asleep, staying asleep or recurrent nightmares, because you are plagued by memories from the past.\n * Numbness or disconnection. Suddenly feeling emotionally numb or disconnected in response to a trigger.\n * Anger. Sudden outbursts of anger or irritability can follow emotional triggers.\n * Chronic depression and anxiety. Both are extremely common in a person suffering from C-PTSD.\n * Suicidal ideology. Feeling suicidal is a common occurrence for people suffering from C-PTSD when something has triggered them.\n * Flashbacks. Whether they are distressing memories, thoughts or emotional flashbacks that have been triggered, they can happen frequently and with a feeling of not having control over them.\n * Feeling unsafe or unable to trust others. Feeling unsafe or wary of other people, seemingly for no reason, is very common.\n * Frequent problems in relationships with other people and low self-esteem. Problems relating to other people and having low self-esteem are extremely common. As is not being able to maintain a healthy relationship with another person.\n * Addictions. Whether to alcohol, drugs, sex or food, can indicate that you are trying to numb the painful emotions that you are feeling.\n * Avoidance of places, activities or people. Avoiding places, activities or people because they remind you of difficult times in your past can also be a sign of C-PTSD.\nThanks for the A2A."
                },
                {
                    "authorName": "Betsy Ellen Usher",
                    "authorUrl": "https://www.quora.com/profile/Betsy-Ellen-Usher",
                    "authorDescription": "Doctor of psychology & Mental Health Film Writer/Director",
                    "text": "*Update as of June 2020 this question has wrongly been merged with Symptoms of PTSD. When I wrote this answer the question was “What are the first signs to recognize you are suffering from of C-PTSD.” Please note the answer below is NOT for P-TSD, it is for C-PTSD. They are two completely different diagnoses and are not exchangeable, do not have the same symptomology, nor the same treatment. Thank you~Dr. B\n\nWhat are the first signs to recognize you are suffering from of C-PTSD?\n\nThis is a very interesting question Leanna and I will do my best to answer it.\n\nThe difficulty with recognizing symptoms of C-PTSD (some are calling it C-PTSR now) is that for a long long time you do not know you have C-PTSD so the symptoms are complex to view from this point of view.\n\nFor instance: C-PTSD comes from long-term trauma of abuse, usually narcissistic abuse. The person begins to have low self worth. This is the leading symptom during the time you don’t know you have C-PTSD and when you find out you do. Let’s start out with symptoms when you don’t know first because they manifest differently and manifest differntly for different people of course.\n\nBefore: This means before you realized you were being abused, before you knew what gaslighting was, blame shifting, ect. These are kind of in order but doesn’t have to be in this order. This is just my opinion.\n\n1) Usual denial or confusion is the first place people begin. For most C-PTSD people this abuse starts in childhood. Therefore it is confusing and they don’t believe their caretaker would hurt them like that. Instead they take on the burden of badness which means they must be the person that is “bad” cause it’s too hard to fathom it’s your caregiver and too scary.\n\n2) A person will start to feel hopeless, like they can never do or be the right kind of person the abuser wants them to be. We call this learned helpless.\n\n3) A person will have a freeze or dissociative, fight, flight, or fawn (co-dependency) response to this continual state of trauma and not being able to flee that can appear more “dramatic” to the abuser or untrained eye.\n\n4) Rage or Anxiety can then manifest. We will turn this fear response outward against others and look like the abuser ourselves or we will turn it inward and internalize it again as we are bad in the form of anxiety and or depression.\n\n5) Then comes cognitive dissonance which is the state of confusion between a feeling that you know something usually about yourself is wrong, however, someone else is telling you the opposite. It becomes unbearable tension not knowing and so people with C-PTSD usually disbelieve themselves because of the learned helpless and low worth and believes the abuser: Example: Your abuse partner tells you that you aren’t a physically affectionate person. You feel that you are. You don’t believe that you are good, worthy, or lovable so you trust what they are saying.\n\n6) This leads to a state of toxic shame about who you are. Small things can trigger you to feel shameful and you react with a fight, freeze, flight, fawn response each time your shame is triggered.\n\n7) This response leads to more shame about how you respond in away that isn’t how you want to be or act.\n\n8) You may then enter into another relationship if you don’t realize your deep psychology roots and trauma state you are in. Then the cycle begins again.\n\nAfter you know you have been abused and have C-PTSD:\n\nNow you know that you were abused and realize that you have C-PTSD. What happens in the beginning?\n\n1) Confusion and denial. You go back and forth if you were the abuser or if they were the abuser. They are so skillful at making you believe you were all these horrible things you now have to untangle that cognitive dissonance. Remember you grew up with the abuse most likely, so you already have a long history of believing you were bad like the abuser said you were. You don’t trust your memories, start to rationalize they weren’t that bad, then back to rage about what they did to you. It’s extremely confusing and cloudy. Like brain fog.\n\n2) Depression and anxiety set in. You have left this trauma bond and begin to detox off of the neurotransmitters that were firing during the traumatic states that chemically made you feel bonded to them like no other person. You feel empty, lost, alone, hopeless, uninterested in anything and possibly begin to have anxiety or obsession about what they are doing during the beginning no contact. You feel half the time like a zombie and the other half like a bomb waiting to go off with built up energy.\n\n3) You isolate yourself. You begin to deal with the feelings of being worthless and feel like you have nothing to offer anyone so you pull back and go further into depression. Questions like who am I? What am I? What do I think about who I am? Why did this happen to me, all start to circulate and torment you daily.\n\n4) You begin to turn inward and drug addiction might come into play, eating disorders, trying to not burden anyone will your struggles, self harm, thoughts of suicide. Some people end up looking like they have borderline personality disorder. You are easily dysregulated emotionally and aren’t a consistent person. Living seems unbearable because how will you ever trust anyone ever again? How could you let this happen? How did you not know for so long? Why would your parents do this to you? All being to circulate. Rage towards your family or men or your partner begin to surface and you no longer want to freeze but fight back and take control back.\n\nThese feelings and experiences can last a long long time. But not always. What comes next is to either 1) Stay in denial and end up back in the same type of abusive relationship that you don’t notice until it’s “too late.” Or 2) you educate yourself, read every article on narc abuse, C-PTSD, awakening the body, becoming empowered and being to grow self worth once you recognize how your self worth is the core of EVERYTHING.\n\nHow do you do this?\n\nWith good healthy mirrors (aka people who are healthy and care about you). Community is a key into coming back into worth. People who see you for who you really are underneath, the person you know you are but have been confused about because of the gaslighting.\n\nNow the really interesting part is then doing work like Peter Levine does on the body nervous system to reawaken these dead and dissociated parts of you. Slowly reawakening your system to be able to fight back, flee if need be, and tolerating bits of trauma again slowly with someone who helps you but holding the space for you that you need. Another story for another time.\n\nHope this helps. Thanks for asking."
                },
                {
                    "authorName": "Hyman Rabinovitch",
                    "authorUrl": "https://www.quora.com/profile/Hyman-Rabinovitch",
                    "authorDescription": "Published \"Neurosis Revealed\" written in lay language",
                    "text": "Post-traumatic Stress Disorder (PTSD) is the manifestation of Neurosis, which is the mental illness caused by psychic trauma in the past. The signs and symptoms of PTSD include unwarranted anger, anxiety, depression, fear, guilt etc. It is a spectrum disorder with the severity of the S/S being directly proportional to the severity of the psychic trauma experienced.\n Complex Post-traumatic Stress Disorder (C-PTSD) differs from PTSD in that it is the consequence of extreme and/or prolonged psychic trauma, as one might see after exposure to a war experience (as combatant or civilian), torture or repeated sexual assault. Its signs and symptoms are far more devastating and include:\n 1. Flashbacks (reliving the traumatic event)\n 2. Recurrent nightmares (about the traumatic event)\n 3. Extreme temper outbursts, easily triggered\n 4. Anxiety attacks characterized by fear, sweating and tachycardia ( very rapid heart rate)\n 5. Insomnia\n 6. Profound depression\n 7. Difficulty experiencing happiness or love\n 8. Low self-esteem\n 9. Loss of interest in life and its activities\n 10. Avoiding thoughts or conversations about the traumatic event\nC-PTSD is so devastating to the sufferer that there may well be an attempt to lessen the pain by: alcoholism\n drug addiction\n suicide"
                },
                {
                    "authorName": "Julia Catlin",
                    "authorUrl": "https://www.quora.com/profile/Julia-Catlin-1",
                    "authorDescription": "Licensed trauma therapist",
                    "text": "I am a therapist and doctoral student, so while I would never diagnose someone who is not my patient, there are a few telltale signs that make PTSD a likely story for people who exhibit some types of attitudes and behaviors.\n\nI will caveat this by saying that someone can meet many, but not all criteria, for PTSD but not have a PTSD diagnosis. Trauma is trauma. If I see someone experiencing these, I may think that PTSD is likely, but I will almost certainly know they experienced some kind of trauma. That is almost indisputable. I’m not going to list all the criteria for PTSD because you can look in the DSM-5 for that.\n\n1. Dissociation (not a main criterion for PTSD, but can be part of it):\nPeople zone out during a conversation. They may trail off, or suddenly have a blank look in their eyes as if they aren’t there inside. This might be accompanied by derealization or depersonalization, which are common traits of dissociative identity disorder (DID) as well. Note that DID often has roots in severe trauma, usually in childhood.\n2. Emotional reactivity: Sadness, anger, irritability, emptiness. Someone may suddenly snap after not being provoked. You might be having a conversation with someone and they reply hastily or sound irritated. It might not be anything you did - it is likely the person was triggered by an internal experience, such as a memory, flashback, sound, smell, or even taste. These are not measurable because they are someone’s internal experiences, so I wouldn’t go guessing what that person is experiencing. Sometimes it looks like aggression out of nowhere, where someone may actually become combative or violent, but I would say this is less common than is portrayed in media, TV, movies.\n3. Physical reactivity: Stomach aches, body aches, head aches, somatic complaints in general of pain. May not be sleeping, or may be waking due to nightmares. Don’t assume.\n4. Heightened startle response or feeling that someone is looking over your shoulder: Also called hypervigilance, which is exactly how it sounds - being acutely aware, hyper aware, or vigilant of one’s surroundings. A cupboard door closes suddenly, and someone twitches or jumps. A loud sound causes people to feel extremely uncomfortable. A common one is hearing fireworks during holidays, which cause many veterans to feel uncomfortable because they sound like gunfire. Many veterans are fine, though, so don’t assume this is a problem for every veteran.\n5. Difficulty recalling details/memory impairment: Sometimes a person cannot finish the thought they had, or suddenly forget an important detail. This really looks like forgetfulness. Have you ever been really stressed and you forget something important? That’s what this is - it just may happen more often for someone with trauma. People may forget meetings, regular appointments, a lunch or coffee date, or other details in their own life. This is connected to the brain impairment that comes with trauma - a previous post I answered I referenced Dr. Bessel van der Kolk’s book, The Body Keeps the Score, which outlines this well.\n\nThese are the ones that stand out to me - I hope this helps!\n\nBest,\n\nJulia\n"
                },
                {
                    "authorName": "Abbagail Mitchell",
                    "authorUrl": "https://www.quora.com/profile/Abbagail-Mitchell",
                    "authorDescription": "Med Student",
                    "text": "I was diagnosed with PTSD as a teenager and again as a young adult after having experienced trauma. I will list some of aspects of my PTSD;\n\n * The Depression Nap. I would come home from school and go straight to bed - never having been the type to easily fall asleep before I was diagnosed. I would lay down and just feel so heavy and hot and tired, I’d fall asleep. Sometimes even sleeping past dinner and not eating.\n * The Eating Disorder. I would shame myself for eating - or not eating - or eating too much - or eating too little. I would be starving during the day at school with really bad stomach pains - but on the weekends I’d over eat or binge on certain foods.\n * The Horrific Nightmares. Example: At one point, I (an older sister) was separated from my three younger siblings after my mother kidnapped them and ran away with them (after failing to kidnap me - my school stopped her from signing me out the day she disappeared). I’d have a reoccurring dream where my siblings and I were locked in a room and a vicious mountain lion (we lived in Colorado) got into the house and stole them away one by one. It was a bloody, gory, and jarring dream that I will never forget completely. The dream only ended when I sacrificed myself to the mountain lion so that my siblings could run away. I do believe that mountain lion represented my mother, in my dream. I’d always wake up screaming and sweating.\n * The Low Self-Esteem. I was constantly putting myself down. I would tell myself, “You don’t deserve this or that. You aren’t good enough. You’re stupid”. Once, my choir group was invited on a special trip to go sing at an amusement park festival. When I showed up, I realized I had forgotten my choir robe at home. There was no time to go get it. The choir director insisted I could borrow one, that it was OK - but I was mortified because I was convinced I was stupid and didn’t deserve to go. So I didn’t.\nExtra’s;\n\n * I was very forgetful.\n * I hated large crowds. I couldn’t attend parties, dances, or school assemblies otherwise I’d have a meltdown.\n * Loud noises would send me into a frenzy or cause me to have a panic attack. (goes hand in hand with large crowds and events - but also things like fireworks or thunder).\n * I hated when people stared directly at me. I was convinced they could see straight through me. If I showed up late to class, I wouldn’t go in until the next period or break. I was literally terrified of everyone “seeing me”.\n * I chewed on my hair, my fingernails, pencil erasers, gum - anything I could get my hands on to ease the tension.\n * I loved the quiet. A lack of stimuli. Sometimes I’d just lay on my bed and stare at the ceiling or the wall. This effectively allowed my brain to “shut off”\n * I had to be in control of everything within my space. I had rituals for everything I did in a day. Rituals were calming because you always knew what was coming next.\n * I had to pre-plan every outing. Would it be loud? Would lots of people be there? How long do I need to be there? How can I get in and out as quick as possible? etc.\n * I couldn’t be “at ease” in a public space. I was constantly hypervigilant and never felt safe. Sometimes I couldn’t even use the restroom until I got home.\n * Stomach problems. I had severe stomach pains and digestion problems. I developed ulcers.\n * I loved oversized clothes. Big hoodies and sweaters were soft and safe - like a safety blanket I could bring anywhere.\nPeople don’t always know that PTSD can occur in adolescents or young adults so I hope I was able to give some more relatable and valuable insight into the workings of an average PTSD sufferer. It is a very serious condition that should be taken seriously, no matter the person or the situation."
                },
                {
                    "authorName": "Ellison Walcott",
                    "authorUrl": "https://www.quora.com/profile/Ellison-Walcott",
                    "authorDescription": "Writer at New York City (2000-present)",
                    "text": "1. Being in constant fight or flight mode - worrying that the worst is about to happen and you can’t control it.\n2. Reliving the events - No matter how hard you try to distract yourself, you can’t stop thinking about every detail.\n3. Flashbacks and nightmares - Everything around you triggers memories of the event.\n4. Severe mood swings - Your emotions are in constant flux - anxiety, depression, anger, sadness for no reason.\n5. Constantly seeking danger and drama that will recreate the trauma or feelings that remind you of the event.\n6. Always prepared for the worst for every situation.\n7. Withdrawal from every type of social situation and support - friends, colleagues, family members, community.\n8. Self-medicating to escape and feel better. However, this coping mechanism only heightens symptoms and causes more problems. Eventually, the more you use drugs to soothe, the harder it will become to control emotions.\n9. Change in sexual behavior and relationships - Complete sexual dysfunction, which can manifest through promiscuity for self-validation or avoidance and inability to have normal, healthy romantic relationships.\n10. Inability to focus and concentrate - The mind is constantly wandering and details all but disappear.\n11. Paranoia - Irrational fear that the world is not safe, no matter where you are.\n12. Disassociation - Feeling disconnected, like nothing is real and numb.\n"
                },
                {
                    "authorName": "Tyreece Williamson",
                    "authorUrl": "https://www.quora.com/profile/Tyreece-Williamson",
                    "authorDescription": "knows Portuguese",
                    "text": "PTSD can accompany any severe psychological trauma, and it's important to understand that not everyone experiences it in the same way. There is no clear time frame for when PTSD can start; it varies from a month to several years. Here is a list of the most common signals that may indicate PTSD:\n\n * Intrusive thoughts and flashbacks of the traumatic events, which can result in insomnia and frequent nightmares\n * Intentional avoidance of places, people, and things that can trigger painful memories\n * Accumulation of negative thoughts, inability to get pleasure from favorite things and activities\n * Problems with concentration, increased anxiety, sleep, and eating disorders\nTo better understand the causes and nature of PTSD, you should take a step back and work out the trauma that caused this condition. I found one helpful article https://fherehab.com/trauma/signs-symptoms about the topic in this Quora thread Why do preteens think it’s a “flex” to be mature? I’m 13 and I’m pretty sure its a sign of childhood trauma? [ https://www.quora.com/Why-do-preteens-think-it-s-a-flex-to-be-mature-I-m-13-and-I-m-pretty-sure-its-a-sign-of-childhood-trauma/answer/Annie-Martin-153 ] so that you can examine more information in detail provided by specialists.\n\n"
                },
                {
                    "authorName": "Sam Morningstar",
                    "authorUrl": "https://www.quora.com/profile/Sam-Morningstar",
                    "authorDescription": "Native American, Ground Combat Veteran (Iraq)",
                    "text": "I'll give you a very blunt answer, as it relates to the VA nowadays. You simply go in and say you have it. No real vetting is done on the claims of trauma. It doesn't even have a proof component anymore, where you'd have to prove your specific combat experiences or incidents of legitimate trauma. I couldn't even do group therapy sessions at VA ’cause I couldn't stomach the sheer numbers of fakers looking to milk the system. Pissed me off too bad. Dudes that never saw any combat, talking about “trauma.” Fuck off! If there was no financial incentive maybe 1/3 of these folks wouldnt even bother with their claims. A huge number are just trying to get disability ratings, and a monthly check.\n\nAnd when you comment on this reality, you're suddenly the asshole. Or, you get the cavalcade of requisite counter-arguments anyway, as if you are ignorant about this subject or the stats involved. “What about MST?” Or, “There are all kinds of triggers or people experience things that might be traumatic to THEM.”\n\nMST is a small subset of PTSD. Most of these claims might be more accurate and legit. But, I can assure you a huge percentage of the guys sitting in the behavioral health lobby of any given VA hospital, do not have military related PTSD.\n\nAnyway, long story short, the VA changed their screening protocols a few years ago, because they got bad press about letting people fall through the cracks or it was too bureacratic. So, now the pendulum has swung too far the other way."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "I could list the diagnostic criteria in this answer but chosen to use some real life examples of what I've noticed in myself and fellow trauma survivors I've known and observed in the course of my life.\n\nSIGNS OF COMPLEX PTSD\n\n * Emotional suppression, being detached from emotions or when asked about what they're feeling the person responds with either confusion; inability to answer saying that he or she 'doesn't know’ or responds by saying 'nothing, I'm feeling nothing..’\n * Inability to identify or name the emotions that they are feeling at any given time, or are vague about their answer when asked about what they're feeling (also known as Alexithymia)\n * Have a vague almost literally automatic response when asked about how they're feeling when asked by others, which may often be untrue, inaccurate or automatic response or the same answer whenever asked\n * Highly reactive to relational triggers and reminders of childhood painful memories which often exist as unprocessed fragments of emotional memory which come up with reminders of childhood abuse and emotional neglect (particularly dynamics involving power or control triggers, intimacy, privacy, physical and or emotional space, abandonment triggers, rejection (perceived feared and or actual) and other triggers related to relationships between self and other/s ( otherwise known as Emotional Flashbacks))\n * Hypersensitivity to other people's emotions and sensing what others are thinking and feeling (being an Empath)\n * Hypersensitive to other people's body language and changes in a person's tone of voice and the use of triggering language and veiled underlying subtle disrespect in relationships\n * Becoming so used to being dishonest and concealing the reality of the stress they're feeling experiencing in their internal emotional landscape that has learnt to lie even to himself or herself about how they're feeling, and even suppression of their own thoughts related to painful triggers experienced in relationships with parents and or others (aka Self Abandonment and Self Betrayal)\n * Self isolation, isolating from friends, family members, avoiding going to work or school or college, reduced attendance at social events and family celebration parties or get togethers or reduced contacting friends family and loved ones\n * Symptoms of depression and or anxiety\n * Avoiding relationships, being a virgin later in life until late 20’s and or 30’s and 40’s\n * Hypersexuality, or more commonly hyposexuality\n * Codependency, codependent/narcissistic relationship dynamics, pursuer/distancer relationship dynamics, aka chaser/runner relationship dynamics\n * Stunted or delayed emotional development (EQ)\n * Comorbid ADD, ADHD and/or Autism Spectrum Disorder\n * Personality disorders comorbid with diagnosis of CPTSD\n * Immature coping mechanisms and the use of less mature defence mechanisms (denial, repression, freezing, amnesia etcetera)\n * Having difficulties with self care, self love, self compassion and self soothing. Difficulties with self parenting, self discipline and impulsivity\n * Escapism and avoiding reminders of the traumatic events\n * People pleasing types of behaviours\n * Being addicted to relationships and having dependent types of behaviour in relationships\n * Anger management issues or difficulty with accessing anger\n * Avoiding conflict\n * Having any kind of addiction to basically anything\n * Fear of being alone\n * Feeling alone in their relationship/s\n * Numbing and distraction, compulsive behaviours\n * Repeating experiences of abandonment and rejection, being either withdrawn or clingy\n * Insecure attachment style (Fearful Avoidant, Dismissive Avoidant, Anxious, Reactive Attachment Disorder, Disorganised Attachment)\n * High startle response/jumpiness\n * Nail biting, pulling out hair, self harm\n * Feeling uncomfortable being in the dark at nighttime, sleeping with a light on, being uncomfortable with silence or no background noise\n * Sensitive to loud noise\n * Symptoms and signs of Stockholm Syndrome (survivor of hostage situation/s)\n * Compulsive reenactments of traumatic elements of dysfunctional family dynamics and trauma experiences from childhood in their intimate relationships in adulthood involving powerlessness, control, feeling stuck trapped and helplessness\n * Living in a 'fog’ of dissociating from own thoughts feelings emotions and memories (can include positive memories as well as traumatic memories— aka generalised amnesia, and other dissociative amnesic disorders and related conditions\n * Memory issues (short and/or long term)\n * Well developed creative problem solving skills\n * Underlying undiscovered or untapped potential and hidden talents and skills in specific areas\n * High level of resilience, strength and modesty\n * Issues with self esteem, self worth, distorted ideas and beliefs and associated behaviours related to the definition of the world and the meaning of 'respect'\n * Negative self reproach\n * Self esteem issues\n * Development of a 'false self’/Ego based self (with trauma associated set of false negative beliefs about the self, others and the world)\n * Developing a set of 'Alters/Parts' like what is seen in the condition Dissociative Identity Disorder, but less severe (with less amnesia and more connection between alters/identities/parts) otherwise called “ANP's” and “EP's\" ('Apparently Normal Parts’ and'Emotional Parts’.\n * Tendency to internalize and or externalize painful emotions such as sadness despair grief and anger\n * Tendency to display behaviours of the 'four f's’ in times of stress. Tends to have one or two categories of coping style that they fall under from either ’Fight’ 'Flight’ 'Freeze' and/or 'Fawn’ behaviours.\n"
                },
                {
                    "authorName": "Jamie McConnell",
                    "authorUrl": "https://www.quora.com/profile/Jamie-McConnell-33",
                    "authorDescription": "lives in The United States of America (1985-present)",
                    "text": "There are so many different things that are linked to PTSD. A lot of us who suffer from PTSD, or CPTSD, hide it very well. Another thing people often are unaware of… Things like emotional neglect, not feeling like you fit in as a kid, being bullied, being scolded for expressing feelings, parents who weren't nurturers… as small as they can seem, can do as much, if not more damage emotionally as what are typically considered traumas.\n\n"
                }
            ]
        },
        {
            "question": "What causes Post-traumatic stress disorder (PTSD)?",
            "url": "https://www.quora.com/What-causes-Post-traumatic-stress-disorder-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": "Elli Routa",
                    "authorUrl": "https://www.quora.com/profile/Elli-Routa",
                    "authorDescription": null,
                    "text": "Experiencing and/or witnessing things like domestic violence, traffic accident, natural disaster, severe illness."
                },
                {
                    "authorName": "Valeri Paxton-Steele",
                    "authorUrl": "https://www.quora.com/profile/Valeri-Paxton-Steele",
                    "authorDescription": "Have lived with PTSD for 35 years due to sexual abuse, rape, been held hostage",
                    "text": "Being rouinely left alone to scream alone in the dark (wet, cold, hungry, thirsty, lonely, frightened) as an infant/toddler.\nBeing forced to give oral sex to a freind's father at age nine.\nWaking up with a different friend's father's hands down your pants at age 12.\nBeing drugged by an acqauintence and waking up with his hands down your pants at age 13.\nGetting slammed against walls and thrown down stairs by your step-father for falling asleep in front of the tv.\nBeing held captive for 12 hours by a stranger after a drug fueled party.\nBeing forced naked by your hair out of a shower, dragged through a filthy frat house, strangled and raped by a \"boyfriend\" at age 14.\nBeing raped, tortured and beaten by two strangers and left for dead in the woods at age 15.\nBeing raped 6 more times in your teens and early 20's, either by lovers or acquaintences.\nBeing physically and emotionally abused by next longterm boyfriend for 4 out of 6 years.\nMarrying a socipath, who used mental manipulation, stalked you, beat you daily, lied constantly, and consistantly told you to \"do the world a favor and kill yourself already.\"\nThat for starters. If it causes trauma, it is probably going to cause PTSD. Hugs. -V"
                },
                {
                    "authorName": "Sophie Gwinn",
                    "authorUrl": "https://www.quora.com/profile/Sophie-Gwinn-1",
                    "authorDescription": null,
                    "text": "Here ya go. Notice the first 50% please. And of course, not all causes are listed.\n\n"
                },
                {
                    "authorName": "Brooke Chang",
                    "authorUrl": "https://www.quora.com/profile/Brooke-Chang",
                    "authorDescription": "psych student w/ ADHD, major depression, and anxiety.",
                    "text": "Short answer: being pushed so far beyond the limits of how much stress you can handle that it screws up your view of yourself and/or the world around you, and makes you think you’re in constant danger.\n\nLong answer: People’s minds resist stress the same way their bodies resist stress. (The mind’s ability to do this is called psychological resilience.) The idea is very similar to a bone fracture. Your body can handle a certain amount of stress on, say, your feet. (Otherwise, we couldn’t walk.) But, if you drop something heavy on your foot or take lots of small impacts over time (as in a stress fracture), something breaks.\n\nGetting PTSD is the mental equivalent of breaking your foot. Most often, it comes from either a single traumatic event like a violent crime, natural disaster, loss in the family (death or divorce), or sudden job loss, or the effects of repeated stress building up over time, like in emergency services personnel and soldiers deployed in-theatre. Technically, though, any kind of distress (negative stress) can cause it if it pushes you far enough.\n\nThe difference is that in PTSD, what breaks is one of your core beliefs about yourself, usually involving your safety, morals, or ability to provide for yourself and others you care about. Your mind can’t easily handle having one of your core beliefs being proven wrong—imagine waking up one morning and discovering that gravity didn’t work anymore. It just doesn’t get it, so it can’t process that knowledge into a memory, which means you’re constantly reliving the experience that inflicted the trauma in the first place.\n\nAs a result, your fight-or-flight response goes haywire, because it can’t tell the difference between reliving the trauma after the fact and actually being there again. If that wasn’t bad enough, realising you’re vulnerable in a way you’d never considered before means you never really feel safe after—after all, if you didn’t see it coming the first time, how can you be sure it isn’t about to happen again?\n\nThe combination of reliving the experience and realising your own vulnerability—in other words, spending every moment of your life either re-experiencing the trauma or anticipating doing so—is what causes the symptoms of PTSD."
                },
                {
                    "authorName": "Alexis Hall",
                    "authorUrl": "https://www.quora.com/profile/Alexis-Hall-41",
                    "authorDescription": "Survivor of numerous traumas . Community volunteer .",
                    "text": "PTSD is caused by a traumatic life event . Such as : rape , car accident , the military , domestic violence , childhood abuse , witness to a murder , mass shootings, robbery , physical - verbal - sexual abuse , incest . Death of a baby or child ."
                },
                {
                    "authorName": "Larry Nutter",
                    "authorUrl": "https://www.quora.com/profile/Larry-Nutter-3",
                    "authorDescription": "M.A. Psychology, University of Northern Colorado (1983)",
                    "text": "People who are subjected to stress and trauma that goes beyond their ability to handle it are prone to developing PTSD. This would include veterans, police and correctional officers, firefighters, emergency medical staff, children, and people who have been through a physical or sexual assault, abuse, accident, disaster, or other serious events. About 7 percent of the population experience PTSD at some point in their lives."
                },
                {
                    "authorName": "Alek Pastore",
                    "authorUrl": "https://www.quora.com/profile/Alek-Pastore",
                    "authorDescription": "Data Analyst (2015-present)",
                    "text": "The most common events leading to the development of PTSD include:\n\n * Combat exposure.\n * Childhood physical abuse.\n * Sexual violence.\n * Physical assault.\n * Being threatened with a weapon.\n * An accident.\n"
                },
                {
                    "authorName": "Angie Taylor",
                    "authorUrl": "https://www.quora.com/profile/Angie-Taylor-269",
                    "authorDescription": "studied at Survivors of Narcissistic Abuse",
                    "text": "Seeing a lived one die. Seeing someone murdered. Being in a long term abusive relationship. Any tragedy which the mind cannot process. It comes out in repetitive dreams over and over again. Disrupts your sleep and adds sleep deprivation and all kinds of other mental and health issues."
                },
                {
                    "authorName": "Jamila Mikhail",
                    "authorUrl": "https://www.quora.com/profile/Jamila-Mikhail",
                    "authorDescription": "I was diagnosed with PTSD in 2012",
                    "text": "Any number of events can cause PTSD, and there's no “you must have experienced this to have PTSD” list. Psychologists aren't sure why certain people develop PTSD after a traumatic event and some don't after surviving, witnessing or learning about a traumatic event, but according to the Mayo Clinic [ http://www.mayoclinic.org/diseases-conditions/post-traumatic-stress-disorder/symptoms-causes/dxc-20308550 ] here are a list of some risk factors and common circumstances under which people often develop PTSD:\n\n\n%3E Doctors aren't sure why some people get PTSD. As with most mental health problems, PTSD is probably caused by a complex mix of:\n\nStressful experiences, including the amount and severity of trauma you've gone through in your life\n\nInherited mental health risks, such as a family history of anxiety and depression\n\nInherited features of your personality — often called your temperament\n\nThe way your brain regulates the chemicals and hormones your body releases in response to stress\nPeople of all ages can have post-traumatic stress disorder. However, some factors may make you more likely to develop PTSD after a traumatic event, such as:\n\n\n%3E Experiencing intense or long-lasting trauma\n\nHaving experienced other trauma earlier in life, such as childhood abuse\n\nHaving a job that increases your risk of being exposed to traumatic events, such as military personnel and first responders\n\nHaving other mental health problems, such as anxiety or depression\n\nHaving problems with substance misuse, such as excess drinking or drug use\n\nLacking a good support system of family and friends\n\nHaving blood relatives with mental health problems, including anxiety or depression\nThe most common events leading to the development of PTSD include:\n\n\n%3E Combat exposure\n\nChildhood abuse\n\nSexual violence\n\nPhysical assault\n\nBeing threatened with a weapon\n\nAn accident\nMany other traumatic events also can lead to PTSD, such as fire, natural disaster, mugging, robbery, plane crash, torture, kidnapping, life-threatening medical diagnosis, terrorist attack, and other extreme or life-threatening events.\n\nNote that you do not need to have been the victim yourself to develop PTSD, you could have witnessed any number of these things (among many others) happen to another person and still develop PTSD. Another version of PTSD is C-PTSD [ https://en.m.wikipedia.org/wiki/Complex_post-traumatic_stress_disorder ] which can also develop as a result of bullying, domestic violence and cult activity, among other things.\n\nThis list is incomplete, but I hope it gives you an idea of the very many things that can lead to a person developing PTSD."
                },
                {
                    "authorName": "Rand B. Lee",
                    "authorUrl": "https://www.quora.com/profile/Rand-B-Lee",
                    "authorDescription": "Diagnosed with PTSD in 2007.",
                    "text": "(1) Suffering, or witnessing another person suffering, a severely traumatizing event, in which the traumatizing event has a clear beginning, middle, and end. Examples: war; rape; natural disaster; a fatal or mostly fatal car wreck.\n\n(2)  Suffering, or witnessing another person suffering, a long series of traumatizing events which in themselves might not be sufficient to trigger PTSD, but which, given their longterm repetition, build up conflict and tension within the psyche until PTSD results. Examples: repeated instances of mild to moderate physical, sexual, or emotional abuse over a long period.  "
                }
            ]
        },
        {
            "question": "What is the meaning of PTSD?",
            "url": "https://www.quora.com/What-is-the-meaning-of-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": "Shahnawaz Mushtaq",
                    "authorUrl": "https://www.quora.com/profile/Shahnawaz-Mushtaq-2",
                    "authorDescription": "Mental Health Practitioner",
                    "text": "Posttraumatic stress disorder (PTSD), once called shell shock or battle fatigue syndrome is a serious condition that can develop after a person has experienced or witnessed a shocking, scary or dangerous event. Following are the common steps of PTSD given by Randy J. Hartman:\n\n * Acute Anxiety: (Panic/ Anxiety episodes)\n * Depression: (Self-esteem in a downward spiral)\n * Resentment: (Distrusting others)\n * Anger: (Fight or flight developing)\n * Fear: (PTSD is now forming)\n * Anxiety: (Mixed episodes occur)\n * Self-worth Dissipating: (Feeling worthless)\n * Shame: (Filled with shame; who else knows?)\n * Guilt: (Feeling guilty; How responsible am I?)\n * Confusion: (Trying to remember; can I trust my memory?)\n * Pain: (Emotional, Spiritual and Physical pain)\n * Activating events (s): Any event that causes distress.\nThanks."
                },
                {
                    "authorName": "Jennifer Ferguson",
                    "authorUrl": "https://www.quora.com/profile/Jennifer-Ferguson-99",
                    "authorDescription": "Paramedic (1998-present)",
                    "text": "Please don’t listen to all these jerks downplaying PTSD and CPTSD. They are both very real mental health issues that have even been proven to change the very structure of the brain. Although CPTSD is not mentioned in the DSM, any trauma informed with a brain that has had any level of education will tell you how real and impactful it is. You ask what PTSD is? As someone who both has it, and has studied it fairly extensively, it is pure HELL. Hearing people, especially some loser who claims to be a “highly respected professional” absolutly sickens me, and I do wish I could do something to have him removed so he could stop spewing such nonsense!"
                },
                {
                    "authorName": "Nancy Armitage",
                    "authorUrl": "https://www.quora.com/profile/Nancy-Armitage-5",
                    "authorDescription": "I live with it everyday. Have for over 20 years.",
                    "text": "Simple PTSD, I don't call any kind of PTSD simple, is what happens after a traumatic incident that changes your life forever. Our brains are not ready for the terrible things people can do to each other.\n\nThere is fear, isolation, frequent nightmares that can be about the incident, flashbacks, anxiety, depression and problems with trust. This can continue for weeks, months, years or permanently.\n\nA person must reach out for help. A good psychiatrist and a therapist who knows about PTSD will help you manage life the best you can. Don't be afraid to reach out. Medication and talk therapy is life-saving.\n\nComplex-PTSD is different. That goes back to incidents in your childhood, such as sexual, physical or emotional abuse. Mainly from someone important in your life such as your parents or a relative.\n\nI hope this helps answer your question."
                },
                {
                    "authorName": "My Restful Mind Inc.",
                    "authorUrl": "https://www.quora.com/profile/My-Restful-Mind-Inc",
                    "authorDescription": "Mental Health Service",
                    "text": "PTSD (Post Traumatic Stress Disorder) is a psychiatric disorder that disrupts many people's lives, daily. It is often mistakenly believed that only war veterans experience PTSD but that's not the case, regular people who have gone through or have witnessed something traumatic can be victims of PTSD and suffer just as much.\n\nThe symptoms of PTSD can be divided into 4 categories:\n \n 1 - Intrusive memories; Flashbacks of traumatic events & nightmares. Reliving the traumatic event\n 2 - Avoidance; Trying to avoid thinking or talking about the traumatic event. Avoiding things that remind of the traumatic event\n 3 - Negative changes in thinking & mood; Negative thoughts about yourself, other people, or the world\n 4 - Changes in physical & emotional reactions; Trouble sleeping, trouble concentrating, irritability & outbursts of anger.\n\nSome Myths & Facts about Trauma & PTSD:\n \n MYTH: Strong people can deal with trauma on their own and don't need help.\n FACT: PTSD and other trauma reactions have nothing to do with mental strength, character, or background.\n \n MYTH: PTSD only impacts soldiers.\n FACT: All humans have similar brain structures & capabilities, anyone may be at risk of PTSD after a particularly distressing and uncontrolled event.\n \n MYTH: Trauma & conditions like PTSD only impact people who have had a near-death experience.\n FACT: We all perceive stressful incidents in our own ways. Accidents, violence, & abuse can all be traumatic to some people while living in a dangerous neighborhood, having a sick child, or living near a natural disaster can be traumatic to others.\n \n MYTH: Trauma reactions last forever and are incurable.\n FACT: Some traumas feel so huge that it may seem impossible to move forward in life, but the human brain wants equilibrium. Our bodies are designed to heal over time.\n\n"
                },
                {
                    "authorName": "Regina Brown",
                    "authorUrl": "https://www.quora.com/profile/Regina-Brown-40",
                    "authorDescription": "Cashier at Plum Market (2017-present)",
                    "text": "A disorder in which a person has difficulty recovering after experiencing or witnessing a terrifying event.\n\nThe condition may last months or years, with triggers that can bring back memories of the trauma accompanied by intense emotional and physical reactions.\n\nGo to your pastor or at your job to talk to someone in Human Resources also put in the letters PTSD in Google and a lot of information will pop up for you. One more thing you can also go to your community center and find resources. Pray this helps. Blessings………..Peace , Love and Light."
                },
                {
                    "authorName": "David McPhee",
                    "authorUrl": "https://www.quora.com/profile/David-McPhee-1",
                    "authorDescription": "Ph.D. Psychology, University of Minnesota - Twin Cities (1994)",
                    "text": "EDIT: I made a snarky comment about “c-PTSD,” was appropriately called on it by several readers, apologized, and removed it from the answer permanently.\n\nIt’s losing its meaning.\n\nTons of people self-diagnose PTSD. It consistent with the fascinated desire to assign labels, or to earn one of your own.\n\nIt’s like “narcissistic abuse,” also wildly popular, typically self-diagnosed. The current fad is to call any selfish/mean person “a malignant narcissist” or something else with the “N word” in it, and call all abuse “narcissistic.”\n\nTHE FIRST CRITERION FOR A PTSD DIAGNOSIS\n\nExposure to actual or threatened death, serious injury or sexual violence.\n\nThe other criteria require that the person be significantly “disordered” (the “D” of PTSD), with symptoms causing serious lasting dysfunction in one or more major areas.\n\nI recently saw a Quora question in which the person believed his therapist had given him PTSD by ending the therapy. I’ve heard a college student claim PTSD due to a failed exam, or a friend self-diagnosing herself with PTSD due to an unkind comment on Facebook.\n\nThe meaning is all over the map, and it’s a shame. There are people in very serious suffering due to prolonged military combat and experiencing near-death, while surrounded by the actual death of comrades. Others have been violently attacked or raped repeatedly, or survived a horrible accident in which others perished.\n\nI guess I’m still a little upset from a couple of days ago, though I kept it to myself, from when a friend said she was having “major PTSD” because there was a power outage while she was preparing for a dinner party.\n\nTake a look:\n\nhttps://www.google.com/search?q=criteria+for+ptsd+dsm+v&amp;rlz=1C1CHBF_enTH947TH947&amp;sxsrf=ALeKk00BoXHs9hTDNiPRD8zZhk0o_OzrPQ:1625461874358&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=2ahUKEwjbl_eslcvxAhVd4zgGHQT-AXwQ_AUoAXoECAEQAw&amp;biw=1280&amp;bih=625#imgrc=c7l9XZn2ijAcIM\n"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "It is natural to feel frightened after a traumatic experience. Within seconds, the brain uses the fight-or-flight response to defend the individual from danger.\n\nWhilst most people recover from the initial fear naturally, some may be diagnosed with PTSD after several months, or even years later after the trauma. These people experience hyper-vigilance, and are susceptible to fear, despite being safe.\n\nNot everyone with PTSD have been through a dangerous event. Trauma such as losing a loved one unexpectedly can also create this illness.\n\nThe individual may re-experience the trauma through flashbacks and nightmares, become emotionally numb, avoiding places, people and activities that are reminders of the distressing event, and may have trouble concentrating, feeling jumpy, or become easily irritated and angered.\n\n\nI was 16-years-old when I first realized the extent of the abuse I faced as a child.\n\nThe memories were triggered through a scene in a movie. Before this scene, those memories were nothing but a meaningless chapter in my life. I had no emotional attachment to them and shrugged the trauma off as if what happened to me was ‘normal’.\n\nAnd so the sleepless nights, flashbacks, nightmares, avoidance of places began.\n\nHis face flashed before my eyes no matter where I was. My senses heightened. Every cigarette, every mustache, reminded me of him.\n\nImagine sitting in a cinema with 3D glasses on. Flashbacks feel exactly the same way. Despite it being in the past, the memories feel like you’re re-experiencing the trauma again.\n\nThe intensity of the images led me to re-decorating my bedroom, destroying objects that reminded me of him, to sometimes sleeping on the floor.\n\nPlaces that reminded me of him would bring up feelings of anger and hurt.\n\nHugs, an action that provided comfort was one I avoided.\n\n\nFor me, fortunately PTSD lasted for 2 months and no longer than that. I still experience flashbacks but they are infrequent and I now have better control.\n\nI use grounding techniques whenever I fall back into that dark place."
                },
                {
                    "authorName": "Phoenix Knormalle",
                    "authorUrl": "https://www.quora.com/profile/Phoenix-Knormalle-1",
                    "authorDescription": "former Psychic Advisor at Mysticsense.com",
                    "text": "In simple terms, to me (as someone who has PTSD) it means that you experienced something so upsetting and distressing in your life that you felt like your life was actually in danger, and this experience left a strong imprint on your brain that never really goes away. The ‘fight or flight response’ never turns off because your brain rewires itself to always feel like you’re in danger from my experience."
                },
                {
                    "authorName": "Joel Shore",
                    "authorUrl": "https://www.quora.com/profile/Joel-Shore-4",
                    "authorDescription": null,
                    "text": "ptsd is an anixety disorder where the individual has experianced a traumatic event; the event itself could be anything, war is most notable, but it also can be a car crash even self inflicted (by creating anxiety about extreme subjects such as death and constantly expanding on it eventually leading to ptsd).\n\nNormal the individual will experiance extreme anixety or even manic about what it is thwt traumatized them. war vertarins might beileve a bomb is on the way, someone who beem in a car crash migjt going on the road.. etc\n\nThey might also experiance flashbacks lr night terror where they relive events in life which they still havents accepted and because of their mind always in that mode it might start to cause external problems for the individual; being ill, headaches, lazyness or weakness and many others (studies dont completely know)\n\npeople with ptsd might often experiamce depression, ocd, anxiety, guilt, worry maybe muscle tensions sometime sleep problems. The problems that mental can cause is limitless and because of this every paitent is different,with different fears, emotions.\n\nThe way lf dealing with it for some will be medication but for others it involved truely exploring yourself and finding how to escape it in your own unique way"
                }
            ]
        },
        {
            "question": "What is post-traumatic stress disorder (PTSD), and what does it do to a human being?",
            "url": "https://www.quora.com/What-is-post-traumatic-stress-disorder-PTSD-and-what-does-it-do-to-a-human-being",
            "suggestedAnswer": [
                {
                    "authorName": "Zainab Qureshi",
                    "authorUrl": "https://www.quora.com/profile/Zainab-Qureshi-110",
                    "authorDescription": "lives in Mumbai, Maharashtra, India (2021-present)",
                    "text": "Posttraumatic stress disorder (PTSD) is a psychiatric disorder that may occur in people who have experienced or witnessed a traumatic event such as a natural disaster, a serious accident, a terrorist act, war/combat, or rape or who have been threatened with death, sexual violence or serious injury.\n\nPTSD has been known by many names in the past, such as “shell shock” during the years of World War I and “combat fatigue” after World War II, but PTSD does not just happen to combat veterans. PTSD can occur in all people, of any ethnicity, nationality or culture, and at any age. PTSD affects approximately 3.5 percent of U.S. adults every year, and an estimated one in 11 people will be diagnosed with PTSD in their lifetime. Women are twice as likely as men to have PTSD. Three ethnic groups – U.S. Latinos, African Americans, and American Indians – are disproportionately affected and have higher rates of PTSD than non-Latino whites.\n\nPeople with PTSD have intense, disturbing thoughts and feelings related to their experience that last long after the traumatic event has ended. They may relive the event through flashbacks or nightmares; they may feel sadness, fear or anger; and they may feel detached or estranged from other people. People with PTSD may avoid situations or people that remind them of the traumatic event, and they may have strong negative reactions to something as ordinary as a loud noise or an accidental touch.\n\nA diagnosis of PTSD requires exposure to an upsetting traumatic event. However, the exposure could be indirect rather than first hand. For example, PTSD could occur in an individual learning about the violent death of a close family or friend. It can also occur as a result of repeated exposure to horrible details of trauma such as police officers exposed to details of child abuse cases.\n\nIt affects the person in many ways, they may include disturbing flashbacks, trouble sleeping, emotional numbness, angry outbursts, and feelings of guilt. You might also avoid things that remind you of the event, and lose interest in things that you enjoy.\n\nThanks for the A2A"
                },
                {
                    "authorName": "Hilda Bausch",
                    "authorUrl": "https://www.quora.com/profile/Hilda-Bausch",
                    "authorDescription": "lives in Germany (1933-present)",
                    "text": "Although not diagnosed, my father suffered post-traumatic stress disorder due to his service in the First World War. He served for the Empire until being injured in 1917. It took him twelve years to marry my mother and have his first son (Hans in 1929) and later me in December 1933. He couldn’t cope with all what he saw and it impacted so deep that (fortunately) he didn’t want anything to do with the NSDAP. He ended his life in mental suffering and it affects me to this date that he was part of the Lost Generation that many countries in Europe—none more so than my dearly Germany—ever saw."
                },
                {
                    "authorName": "Kaushik M.",
                    "authorUrl": "https://www.quora.com/profile/Kaushik-M-83",
                    "authorDescription": "Recovered from Chronic Anxiety & Depression",
                    "text": "Post-traumatic stress disorder (PTSD) is a mental health condition that's triggered by a terrifying event - either experiencing it or witnessing it. Symptoms may include flashbacks, nightmares and severe anxiety, as well as uncontrollable thoughts about the event.\n\nTo be diagnosed with PTSD, an adult must have all of the following for at least 1 month:\n\n * At least one re-experiencing symptom\n * At least one avoidance symptom\n * At least two arousal and reactivity symptoms\n * At least two cognition and mood symptoms\nRe-experiencing symptoms include:\n\n * Flashbacks - reliving the trauma over and over, including physical symptoms like a racing heart or sweating\n * Bad dreams\n * Frightening thoughts\nRe-experiencing symptoms may cause problems in a person’s everyday routine. The symptoms can start from the person’s own thoughts and feelings. Words, objects, or situations that are reminders of the event can also trigger re-experiencing symptoms.\n\nAvoidance symptoms include:\n\n * Staying away from places, events, or objects that are reminders of the traumatic experience\n * Avoiding thoughts or feelings related to the traumatic event\nThings that remind a person of the traumatic event can trigger avoidance symptoms. These symptoms may cause a person to change his or her personal routine. For example, after a bad car accident, a person who usually drives may avoid driving or riding in a car.\n\nArousal and reactivity symptoms include:\n\n * Being easily startled\n * Feeling tense or “on edge”\n * Having difficulty sleeping\n * Having angry outbursts\nArousal symptoms are usually constant, instead of being triggered by things that remind one of the traumatic events. These symptoms can make the person feel stressed and angry. They may make it hard to do daily tasks, such as sleeping, eating, or concentrating.\n\nCognition and mood symptoms include:\n\n * Trouble remembering key features of the traumatic event\n * Negative thoughts about oneself or the world\n * Distorted feelings like guilt or blame\n * Loss of interest in enjoyable activities\nCognition and mood symptoms can begin or worsen after the traumatic event, but are not due to injury or substance use. These symptoms can make the person feel alienated or detached from friends or family members.\n\nIt is natural to have some of these symptoms for a few weeks after a dangerous event. When the symptoms last more than a month, seriously affect one’s ability to function, and are not due to substance use, medical illness, or anything except the event itself, they might be PTSD. Some people with PTSD don’t show any symptoms for weeks or months. PTSD is often accompanied by depression, substance abuse, or one or more of the other anxiety disorders.\n\nhttps://www.livewelltalk.com/2020/08/post-traumatic-stress-disorder-ptsd.html\nhttps://www.livewelltalk.com/2020/09/ptsd-test-coping-with-flashbacks.html\n"
                },
                {
                    "authorName": "Moshi Medlin",
                    "authorUrl": "https://www.quora.com/profile/Moshi-Medlin",
                    "authorDescription": "Business,  St Gabriel's School & Affton High School, Harris-Stowe State University (1994)",
                    "text": "It’s a mental disorder that follows a traumatic event. Can cause nightmares, derealization, depersonalization, anxiety, reliving the event, emotional problems. U can google it for more information.\n\nMoshi"
                },
                {
                    "authorName": "Rebecca Chapman",
                    "authorUrl": "https://www.quora.com/profile/Rebecca-Chapman-125",
                    "authorDescription": "M.Sc.  Psychology & Criminology, Swinburne University of Technology (2019)",
                    "text": "Post-traumatic stress disorder is an anxiety disorder that develops in response to a traumatic event. PTSD can cause flashbacks, nightmares and severe mood swings. It also interferes with daily life activities such as work or relationships. In this blog post, we will explore the symptoms of PTSD and the toll it takes on your brain and body.\n\nThe brain of a person with PTSD is constantly and involuntarily re-living the traumatic event, which creates a sense of panic. When exposed to stimuli that are reminders of the past experience, memories resurface with intensity as if it were happening in real-time again. These vivid images cause changes in brain function similar to what is seen during an anxiety attack or manic episode.\n\nWhen someone experiences PTSD symptoms for more than one month after a traumatic event, this may be considered chronic post-traumatic stress disorder (CPTSD). Symptoms can include extreme anger outbursts and suicidal thoughts.\n\nThere are also physical effects of PTSD, including:\n\n-Changes in physical structure and function of the body (increased heart rate, blood pressure, hormones)\n\n-Increased risk for chronic diseases such as cardiovascular disease, diabetes, obesity\n\nA person with PTSD may also have an increased chance of developing other mental health issues. For example, PTSD can lead to depression and a higher incidence of suicide attempts or self-harm.\n\nThe symptoms vary from one individual to another depending on what they experienced during the traumatic event. The intensity of these symptoms is dependent on how much support was available following the trauma; more support leads to less severe reactions while lack of social supports can be detrimental.\n\nSome people are at greater risk than others because their brains react differently to stressors like anxiety."
                },
                {
                    "authorName": "Jennifer C. Lenz",
                    "authorUrl": "https://www.quora.com/profile/Jennifer-C-Lenz",
                    "authorDescription": "former studying narcissism  (1991-2016)",
                    "text": "This mental health condition simply states, that the person is currently traumatised. They have experienced deeply distressing events, which were so intense that they could not process them at the time. A common example are soldiers who went to war and watched their fellow men die. However childhood abuse or neglect, especially at a very young age or adult live-in relationships with narcissist, can cause similarly deep psychological wounds.\n\nA small part of the consciousness of that person is still trapped in that trauma until they fully process it and heal. The subconscious of that person will keep perceiving reminders of the trauma (for example somebody who experienced a car accident will likely get triggered by loud noises, driving, possibly also by the sound of the song that was playing in the radio just before the accident happened or the voice of the person who sat next to them in the car, the smell of a the perfume worn that day etc.). Being confronted with these reminders will cause sudden feelings of fear and panic to surface, which can result in a wide range of symptoms. However, the person experiencing this will not be consciously aware of why they have these anxious reactions to seemingly harmless triggers.\n\nThis can lead to low self-confidence, feelings of anxiety, panic attacks, impulsive reactions, sudden emotional outbursts and similar symptoms that impact the persons life.\n\nHowever it is important to remember that one can heal from PTSD and/or C-PTSD.\n\nIn order to heal from PTSD, the person will have to work towards identifying the trauma that they still carry around with them, working through the traumatic event and healing from the traumatic event.\n\nFor this I recommend taking alone time to re-think triggering events and situations, embracing self-care & self-love, reading up on the topic and looking for external help when necessary."
                },
                {
                    "authorName": "Jamie Matter",
                    "authorUrl": "https://www.quora.com/profile/Jamie-Matter",
                    "authorDescription": "MA Marriage and Family Therapy, San Francisco State University (1994)",
                    "text": "This best single book to read about this is “Trauma and Recovery” by Judith Herman, MD. It’s considered the most definitive book on the subject. Other than that, your web search is as good as mine. There is some neuroscience that suggests a lot of the consequences are in the amygdala."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "This has been answered many times on Quora.\n\nPlease do a search.\n\nHere’s a blog that has a lot of information\n\nhttps://aboutptsdandcptsd.quora.com/\n"
                },
                {
                    "authorName": "Mary Kay Kolar",
                    "authorUrl": "https://www.quora.com/profile/Mary-Kay-Kolar",
                    "authorDescription": "lives in Madison, WI",
                    "text": "PTSD is a SERIOUS diagnosis it comes from ABUSE and TRAUMA and it MESSES up your life, BUT YOU CAN GET HELP FOR IT"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Imagine this.\n\nTonight, since you’re home alone, you decided that you were going to prepare yourself pasta, and you decide to make everything that you will eat yourself, so you get out some tomatoes to make some marinara sauce.\n\nYou clean the tomatoes, taking them out of the water, and you take out the knife to cut them into chunks.\n\nEverything is going well, you’ve already gotten through two of the four tomatoes you are preparing to reduce to chunks.\n\nThe little red cubes that you’ve already crafted are waiting impatiently in the glass bowl that you placed next to your kitchen-space to prepare the sauce.\n\nIn your hurry, you make a big mistake.\n\nThe knife slips.\n\nYour finger is suddenly ablaze with pain.\n\nThe half-sliced tomato is drowning in crimson liquid, only a shade darker than the food that you were preparing for yourself.\n\nYou clumsily drop the knife and grab a paper towel, trying to stop up the flow of blood escaping from your sliced finger.\n\nIt’s bad.\n\nYou have to call your family to take you to the hospital.\n\nThe blood won’t just stop coming out, filling every crease and spilling over your clothes, your dignity coming out with it.\n\nA couple hours later, the doctors have glued your finger back to rightful place, but it still hurts like when it happened.\n\nYour finger is blue and purple. The doctors told it was going to leave a scar.\n\nYou sleep, but something keeps nagging at the back of your mind, something isn’t right.\n\nNext morning, you feel jittery, all of your fingers tremble and shake, they’re useless, so you take the day off work.\n\nBut when you try to eat your breakfast, the glint of silver spoon you’re using reminds you of the knife that you cut yourself with last night.\n\nYou choke on your cereal, and switch out your metal spoon for a plastic one from the ones kept in the drawer where you put the cutlery that take-out gives you when you order out.\n\nYou want to put on your favorite red t-shirt, but as you look at yourself in the mirror, all you see is blood, running down your body.\n\nThe day after next, you try to prepare yourself dinner, but your hands start shaking as soon as you open the drawer where you kept the knife.\n\nYou order out instead.\n\nThat night, your consciousness is plagued with your family members and best friends being chased by shiny and sharpened knifes that drip crimson-colored blood onto the floor, slicing your loved ones apart, starting from the fingers up.\n\nThe nightmares don’t stop the next night, nor the one after the next.\n\nThe day after that, you go out to dinner with your friends, to your favorite restaurant, but when you see your friend slicing open the meal with the knife, your head starts to swim, and all you can see is the reflection of light bouncing off the metal.\n\nYou excuse yourself as quickly as you can, and you have a panic attack in the bathroom stall.\n\nYou can’t deal with it anymore.\n\nEveryone is telling you that your fears are stupid, and you manage to convince yourself that they are right.\n\nBut no amount of trying to convince yourself that nothing is wrong, and that you’re just stupid will let you enter the kitchen, that your brain has labeled as out-of-limits.\n\nYou can’t step into that room without your mind drowning under the sheer amount of thoughts that crowd your brain.\n\nYour eyes start to water, and it seems as though there are not enough tears for you to cry.\n\nAll you can do is suffer in silence, while your loved one’s calls of “just get over it already” and “it wasn’t even a big deal anyways” will drown out the cries of “you are in danger” and “you are stupid and weak” coming from your brain.\n\n\nNow put this in into perspective, imagine the exact same situation, but replace it with something else.\n\nA person watching their family or friend die before their eyes, or failing to take care of them, without being able to do anything to prevent it.\n\nA child being relentlessly bullied at school for years.\n\nA soldier watching the comrades they trusted with their lives fall in war.\n\nA person getting raped by someone they thought they trusted, or a complete stranger, in somewhere they thought was safe.\n\nA person in an abusive relationship that they can’t get out of.\n\nA child being beaten by their parents, other friends or family members without any way to retaliate or protect themself.\n\nA student coming to school only to realize that their best friend committed suicide and they couldn’t do anything to help.\n\nAnd so many more situations.\n\nThis is exactly what we feel like.\n\nPeople tell us to get over it, but that’s the one thing that we just can’t do.\n\nThat is the one thing that is wrong with our minds.\n\nWe are forced to constantly relive our past traumas, and feel the same feelings we felt then, right there in that moment.\n\nWe are plagued by the feeling we could have done something, or that it was all our faults, when it really wasn’t.\n\nSo next time, don’t judge for being forced to feel these things over and over again, we can’t just “get over it” or “forget about it” like you.\n\nWe have to feel it everyday, over and over again.\n\nNo matter what the situation may be.\n\n\nSend help.\n\n%3C/3"
                }
            ]
        },
        {
            "question": "Do you have PTSD and if so, what is your story?",
            "url": "https://www.quora.com/Do-you-have-PTSD-and-if-so-what-is-your-story",
            "suggestedAnswer": [
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "I was raped at four.\n\nDigital rape in our bathroom. I remember the dark tan of my stepfather’s finger, the cold of the tile against my face, and the jar of petroleum jelly that sat upon the toilet tank.\n\nThat’s what I focused on, that jar.\n\nHis voice was furtive as he whispered for me to stay still, be quiet. He was slightly louder, more forceful, when he assured me that I and my mother would die if I told anyone he touched me there.\n\nThat was the first time, I think. Most of my memories of sexual abuse involve an understanding of the necessity for silence, and most of them do not contain the fear or confusion of that memory. They happened, he told me what he wanted, I did it, and eventually he went away. In the later ones it feels like a rote, albeit unpleasant, transaction.\n\nIn that one memory, I didn’t understand why he asked me lie down. I didn’t understand why he wanted me to remove my panties. I didn’t usually take off my panties when anyone else was around, especially if I didn’t have to pee.\n\nI remember telling him I didn’t have to pee.\n\nIt didn’t occur to me to be afraid, not yet. That’s what’s so unique about that time. I was calm, my muscles relaxed. I said what I thought without worry or shame. I was open and trusting. I felt safe. Since that day, it’s been very difficult for me to experience any of those states.\n\nI knew what he asked was strange, but I presumed he had a good reason for it, and obeyed. I only thought what he did to me might be wrong because it hurt, he wouldn’t stop, and he threatened me. I was really scared about what he might do to my mother. I wasn’t as worried about dying myself.\n\nIt was stressful to know we were living with a person who might kill me and her. I worried he might kill her every night when I went to bed. It kept me from sleeping. But I trusted that my silence would keep her safe.\n\nFour-year-olds are not adults. Every time I am shunted back into one of those early memories, I am made acutely aware of how different my thinking was then, compared to how my brain functions now.\n\nBut it wasn’t just the sexual abuse that caused damage. I was physically abused by my stepfather as well, generally without rhyme or reason. In public or private, multiple times per day, he would deliberately hurt me, sometimes for minutes at a time. If I cried, if I responded unpleasantly in any way, that would precipitate a proper beating. Mostly, I learned not to respond to pain. To detach.\n\nI still get nervous for no apparent reason, because I was raised in an environment where severe pain could arise at any time. I become particularly anxious in stores, because he seemed especially amused by my struggles to stay calm and quiet, to show no sign of distress, when there were onlookers.\n\nMy brother took advantage of this too, venting his own frustration at the abuse he endured and watched by screaming at and hurting me for hours on end each day. This was particularly severe when my parents were not home, but they often watched impassively as he pulled my limbs backwards until I’d cry out for him to stop.\n\nThey told me it was my fault for not fighting back.\n\nI don’t really know what to say. Stuff happened. My body responds to a decent chunk of situations like I’m still that child, and still facing those threats. Sometimes my entire experience of reality gets overtaken by memories that superimpose themselves over reality, or distract me from it entirely.\n\nI do what I can."
                },
                {
                    "authorName": "R Hodge",
                    "authorUrl": "https://www.quora.com/profile/R-Hodge-4",
                    "authorDescription": "studied Enriched Visual Arts & Technical Theatre Arts",
                    "text": "The extent of my trauma doesn’t sound as bad as some of the answers on here, whom my heart breaks for, but it’s worth sharing nonetheless. PTSD has affected my memory fairly badly, but I’ll do my best.\n\nMy parents divorced when I was 3, though I don’t remember much of it. I grew up living with my mom, my twin brother, and my older sister of another father. I saw my grandparents on my dad’s side every other weekend, and I didn’t see much of my dad. My mom always told me he didn’t want us in his life.\n\nWe grew up in extreme poverty. My mom was extremely negligent, leaving us alone for weeks on end by the time we were 5. She was unbelievably abusive. By the time I started school, I showed up to my first day of kindergarten and refused to speak, as I was so ill-adjusted to being around people who weren’t cruel to me and just wanted to be with my brother. I sobbed my eyes out and hid under the coats of the other kids until it was time to go home. I was extremely bright and loved to draw with the markers and write little stories with the help of my teacher, but she knew something was wrong and to this day I’m thankful for that. She told my mother that I needed to see someone, and I was diagnosed with depression the summer before first grade. My brother was diagnosed with severe behavioural issues not shortly after.\n\nMy mother started to resent us especially after that. We wouldn’t be fed at all, and my brother and I grew so thin that we couldn’t gain weight for years afterwards, and my brother stopped growing completely from the malnourishment. He stayed the same height for years, with zero signs of development, much to the worry of doctors. But no one thought to report it. My brother was my other half at the time, and I always saw myself as his protector. We were bullied relentlessly at school for every possible thing - because we were poor, because we were so thin that we looked dead, because we always had lice, because we missed so much school, because we dressed weird, because I cried so much and my brother was so angry, every single thing you could think of. My brother was beaten on the walk home from school so many times that we stayed late and walked a different way home. We had rocks thrown at us, rocks thrown through our windows, our stuff was stolen, you name it.\n\nI would be locked in the closet with rotting food. My brother and I couldn’t cook so we ate popcorn for every meal for days until we couldn’t eat any more. We were called names, and constantly reminded of how no one wants us and how strong my mom is for taking care of us alone. She would bring home new men constantly, many of which would make sexual comments about my body, touched me, and hit my brother. I would lie if I said that by the age of 7 I hadn’t thought about killing any of them. My sister would cut my hair and threaten to kill my brother and I. My only respite was seeing my grandmother, who was a wonderful woman that I still cry over often.\n\nMy mom hit a breaking point the summer before fourth grade, and dumped my brother and I in foster care. Two separate foster homes hours from eachother. I remember my fostermother using me for cheap labour, forcing me and the other foster kids to shovel mulch with our bare hand all day in buckets to take around the house to her garden. I remember being stung by ants every day and my hands bleeding from the sharp wood. The only good part was how much I ate. I had never seen so much food on one table, and I would eat until I got sick.\n\nThere are more nuances to my mother’s abuse, but this answer would drag on forever. It was very bad, and to this day psychiatrists are shocked when anyone speaks of it.\n\nWhen I was 11, my mom and I had an argument that led to her punching me into a wall. I remember crumpling to the ground, then getting up, packing my things, and leaving. I slept at a friends house, and the next day I attempted suicide at school. I was arrested and hospitalized, and finally put in my father’s care. I was ecstatic, as my absent father was always a hero in my life, but there was some truth to what my mother said. He just didn’t want me. He wasn’t negligent or physically abusive, but verbally and emotionally abusive. He had an explosive temper, and instigated arguments left and right. To this day, he tells me I remind him of my mother.\n\nBy my 14th birthday, I had been kicked out of the house multiple times, and writing this now just past my 16th birthday, I’ve couch surfed for longer than I can remember. I’ve slept in restaurant bathrooms, buses, schools, outside. Every time I come home it doesn’t last long, just more explosive anger and him eventually telling me to leave. My brother is completely shut out now, and rarely speaks to me outside of arguments. He started living at my dad’s two years ago, when my mom dropped him off at a homeless shelter and we picked him up. I can truthfully say I have no relationship with him whatsoever anymore, and I resent my mom for making that happen.\n\nI’ve attempted suicide multiple times since then, and every day is a struggle to get better. I have severe BPD, severe PTSD, and multiple other issues including rapidly declining physical health, and suspected stomach ulcers from the chronic stress.\n\nI’ve struggled with severe substance abuse, isolation, abusive relationships, and more. But now I have people in my life now whom I love, and who love me. I’m in the first healthy relationship I’ve ever been in with the most patient boy I’ve ever met, who’s kind and helps me to be kinder. I have friends who mean the world to me. It’s gotten a little bit easier bit by bit."
                },
                {
                    "authorName": "Meagan Orr",
                    "authorUrl": "https://www.quora.com/profile/Meagan-Orr-2",
                    "authorDescription": "Senior financial specialist",
                    "text": "A premature baby is born into, not the warm receiving hands of a doctor, but the cold water of a toilet. It was mid-December in a downstairs apartment, and it was cold. The mother, who had hid her pregnancy (somehow), wraps the cold wet infant in a rough blanket and lays her on the coffee table, then passes out. This is around one on the morning.\n\nAround 7 am, the mother awakens and finds the baby blue and cold. Her umbilical cord is still attached. The mother, who is severely bipolar and has a lowered mental capacity, phones her sister, who comes to take her and the tiny 5 pound infant to the hospital.\n\nNothing has been purchased for the care of this little baby. The apartment is bare of anything to harken the arrival of an infant.\n\nIn the hospital, the mother takes a few days to heal…..and then takes off. Leaving the baby behind. The little girl was very sick with jaundice, respiratory problems, and failing to thrive.\n\nThe Grandfather heroically steps in and assumes all responsibility for this baby. He takes her home. He raises her until she is two. She grows, gets healthier. Has braces on her crooked legs, but she thrives. Meanwhile, the mother has been in a mental facility, and God knows where else.\n\nShe tries to clean up her act. The Grandfather, swayed by her manipulations, lets her move in (after all , she IS his daughter) and get reacquainted with the child she left. It was a mistake on his part.\n\nShe finally gets on her feet, and takes the girl away. Fast forward a few years. The bright, lonely little child, who has been cooking and cleaning since age seven, is a starving little thing, who eats sticks of butter, paper, weeds, gum off the ground…anything, because she is always hungry. There is never much food in the house. There is always a hole in her stomache.\n\nBut she is about to encounter a monster worse than hunger.\n\nThe stepfather enters the picture. At first loving and attentive, he quickly morphs into a drunken, sadistic pedophile who would rather molest and rape the girl instead of his wife. He does this, he beats the child, holds a gun to her head, hides drugs in her room, and does things to her no man should ever do to anyone let alone a child. Then he invites a friend over once. And gets paid for what he lets happen to her.\n\nThe mother knows. Does nothing. Just resents the child.\n\nFast forward again. Stepfather is gone, but Bipolar mother is getting worse. She develops schizophrenia. She hits the girl. Cuts off her hair in her sleep and calls her a whore for being friends with boys.\n\nOne of Mother's dates offers to babysit. The child is 11. He ends up feeding her pills and alcohol, and is the third man to violate her. When she tells her mother, the mother beats her, calling her a slut and a whore. Saying she deserved it.\n\nAt 12, the mother pushes the girl down some stairs, dislocatiing her arm. Someone from the school reports it, and the child is taken away and put into foster care. After that, she spends time living with various family members who aren't so great either. The girl tries to open up to her Aunt, who tells her stuff like that happens all the time. To get over it. Says that the child must have done something to cause him to do such things….\n\nThe girl vows to never tell anyone ever again.\n\nMother tries to commit suicide. Ends up in the nut house.\n\nGrandfather finally gets custody of the child at 15, but lets the mother move in with them.\n\nThe mother's sickness intensifies. She beats the girl, she hits the old man. She gives him so much anxiety he has to kick her out.\n\nBut the damage has been done. After a few blissful years of peace for the child, Grandpa has a massive stroke and passes away. The girl grieves beyond words.\n\nThe girl is now 18. She moves away with her boyfriend. They get married, have a baby. That little boy is the nucleus, the love of the girls life, her proudest achievement.\n\nThen the Mother commits suicide, and the family denies help, leaving the girl to clean up the broken pieces.\n\n…that child was me. And that was the cut and dry version of my childhood, my trauma.\n\nI put a cap on the whole sordid mess, hid it away, my dirty secrets, until I was 33, and then it all spewed out like a volcano. It caused a devastating blow to my psyche, a week in the hospital, and six weeks of outpatient CBT therapy.\n\nDuring that, I was diagnosed with C-PTSD.\n\nAnd so the battle to heal from these horrors continues…"
                },
                {
                    "authorName": "Kay Snap",
                    "authorUrl": "https://www.quora.com/profile/Kay-Snap",
                    "authorDescription": "Ford Technician ",
                    "text": "I was abused (physical and mental), neglected, and gaslighted by my own mother. My mental health took such a turn for the worst, that I have very few memories that I can recall.\n\nI remember when when I was 6, my sister and I were supposed to be in bed. We were, but couldn't sleep, so being kids, we talked to each other. Our mother got pissed that we were going to bed she came upstairs and beat us with a belt. This happened a lot, and it wasn't always a belt, it was whatever she could get her hands on.\n\nI learned early on to be as physically quite as possible so as not to upset her, or else risk getting beaten.\n\nAnother time, I was in fifth grade. I had to catch the bus at 8:30. I would leave the house at 8:25, and cross our backyard into the neighbors yard to catch the bus.\n\nMind you, she was never up to help us get ready for school, we were on our own. There were many times I wore clothing that didn't match because I didn't know any better.\n\nOne particular morning, I was standing by the back door watching the clock, waiting to leave. She came out screaming that I was being to loud and proceeded to hit me with a frying pan.\n\nIf I got hurt from any sort of accident, it was automatically my fault for doing something stupid. One day I was getting out of the pool and legitimately slipped and fell off the ladder. Sliced my foot open, lots of smaller scratches, and bruises. But it was my fault for “fucking around”. I broke my arm from a fall one day, and she broke it further by grabbing it, I'll never forget that cracking noise. Again, it was my fault.\n\nShe locked me out of the house because she was pissed at my sister. This happened around noon time, and I couldn't get in the house until my father got home around 7. I remember knocking, begging, pleading, crying to get inside because I needed to use the bathroom and I was starving. I ended up going behind our shed, with no TP.\n\nIf she didn't feel good, that was it. We were to stay in our rooms. Make no noise, get no food.\n\nGod forbid I got sick. If I threw up, I got screamed at for making a mess and to clean it up. It wasn't like I intentionally did it.\n\nThe biggest phrase in my life was “What the fuck is wrong with you”. After that it was “shut the fuck up” “keep your fucking mouth shut” “quit being a Wendy whiner” “that's it, fucking cry, you have it so bad” (a lot of sarcasism in that one) the one about being quiet? Anytime I tried to talk to someone about anything, I barely socialized growing up. Now I barely socialize because I don't really know how. I spent A LOT of time by my self, talking to my self because I was my only friend.\n\nShe cared more about her car than she did us. We need something? Too bad. Car needs new tail light because they look better? Definitely! Can't forget the dog, the dog was probably her first priority, her car being the second.\n\nAs I got older I tried to be more feminine. That went downhill fast. I tried on my sister's dress, got screamed at and the dress taken away. Something about playing with it. I tried to learn how to use makeup. Again, got screamed at. I ended up wearing clothes that never fit me properly because she refused to help me shop, I got a lot of second hand clothes. All this happened over 15 years ago, and I wore a dress for the first time a couple months ago. It was only because my boyfriend kept insisting. I still have not tried to use make up since.\n\nI started self harming, to feel something other than the numbing, worthlessness. When she found out, she beat the hell out of me. Any attempts at getting help resulted in more pain. I talked to counselors, who called Child Services. By chance, I was at my aunt's house when they made a surprise visit. I got beaten for that because I was the one who must have called them. Child services didn't do anything after that visit. I learned fast that no one is going to help, I can't trust anyone, and no one cares about me.\n\nShe would threaten us often, using previous beatings as examples. If we brought up any of the abusive treatments we were “dreaming” because none of this actually happened.\n\nThis is only a sliver into my story, and I'm sure someone is going to ask about my father. He never hurt us, and he was a victim too. I've never seen her hit him, but she screamed at him just as much as she did to us. He tried to help in little ways. He would always take us out places to have fun, even though he couldn't afford it. She never came with us, in fact, she never even took us anywhere other than the grocery store.\n\nI have crippling and painful anxiety attacks, and suffer from depression on top of the PTSD. Ant loud noises tend to set me off. The worst of my triggers are when other people are upset. The only time I can relax is when I'm alone, because I know no one is their, with no one their, no one can hurt me.\n\nI've been getting help and trying to get better, but sometimes I can't help but wonder if it'll ever get better."
                },
                {
                    "authorName": "Virginia Weinstein",
                    "authorUrl": "https://www.quora.com/profile/Virginia-Weinstein",
                    "authorDescription": null,
                    "text": "Almost 5 years ago I broke up with the guy I was dating, Daniel. He did not take it well - he pinned me to the bed and pulled a sword from between the mattresses, I had no idea which way that sword was going. I thought he was going to kill me. Then he said 'I told you I can't live without you, and I won't. But I'll make it so you never forget.’ He tried to stab himself, and in spite of my best efforts, given that I could barely move, he succeed. He stabbed himself in the stomach. The look of triumph on his face as he laid there bleeding still haunts me.\n\nI called 911, and when the first officer arrived he took one look at me and unsnapped his gun and held his hand on it. I was covered in blood.\n\nHe was taken away by the paramedics. He was still alive at that time. However, as the police were wrapping up the investigation the lead detective received a message, Daniel had died in the operating room. He had lacerated his liver and there was too much damage.\n\nThere is so much more that could be said about that night, but I don't think I can. I'm already shaking. The barest details is all I can do."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Yes, I’ve been told I suffer from severe PTSD, probably complex PTSD.\n\nAside from a severely abusive childhood and the trauma associated with that (which I’m not going into), I’ve had two incidents this past year, within months of each other, where I nearly died both times.\n\nFirst, I had a bedside surgery to remove an abscessed core that had led to septic shock as a result of MRSA. My organs were already failing, so that experience of fading in and out (and feeling your body giving out) was traumatic in and of itself. You have no control. You realize how easy it is to slip away.\n\nAnyway, two surgeons had to remove the infected tissue from the abscess. I had warned doctors that morphine wasn’t working for my level of pain so I was given dilaudid, which initially worked. However, the most traumatic part of the experience, which I’ve never really discussed with anyone (more so because I don’t want to remember it) was that one of the surgeons, a woman, continued to “operate” on me despite me telling her that I could suddenly and very sharply feel the pain of her cutting into several inches of my flesh and her using a suction to remove said flesh/blood.\n\nShe was a callous bitch, as my reaction was to almost hit her for not stopping. The other surgeon, seeing this and frightened by my reaction and pain, stepped away. The female surgeon coldly replied, “Don’t touch me; I’m sterile” and continued as though I said nothing to her. She should have stopped the procedure and administered more pain medication but the hospital I was at was stringent on not giving out pain meds due to it being a county hospital and every doctor assumed everyone there who was a patient was a homeless druggie. You get treated like shit when you don’t have insurance - and this experience proves it to me. I think the woman assumed I was some poor brown person that she could just gain more surgical experience on - fuck the fact that I’m a human and feel pain, fuck ethics or just basic morality. To her, she just assumed I was probably another undesirable that she had the power to do whatever she wanted with.\n\nClearly, if I have an abscess that covers my lower back down to my bottom buttock, then I’m not making any pain up. It was extremely traumatic not only because I felt like a laboratory animal being essentially tortured and experimented on but because Im laying there helpless, my voice went unheard, and ultimately, I went into shock, staring blankly into space, feeling every bit of flesh being cut out. Aware of everything but unable to move yet feeling it all. It was inhumane and has affected how I see doctors, hospitals, etc. I’d rather die than ever go back into a surgery.\n\nA few months later, I was driving to work as usual at night. Apparently, an elderly woman hit the back of an 18-wheeler. As such, her car spun into the lane I happened to be in, although I didn’t know this yet since the accident just happened seconds before, and landed in a horizontal position within that lane. With no street lights, it being dark, the curve of coming up the hill in the lane without a clear view to avoid her completely, and no warning - I see her car and immediately attempt to swerve to avoid crashing head on into the side of her car.\n\nWell, I still struck the back of her car when I swerved but this caused me to tailspin across 3 lanes of traffic. Initially, I screamed from terror….and as weird as this will sound, as I went across those lanes, I said to myself firmly that I’m going to die because someone is going to hit me and I became immediately calm. And waited. It’s funny how you can make peace with something within seconds.\n\nWhile the car continued to spin out of control, I could do nothing to stop it. It finally landed in a ditch a mile away from where the accident initially occurred. Surprisingly, I came out unharmed other than slight neck injuries. The cop who helped me claimed he was amazed I survived because he’d seen so many accidents that were similar that caused so many people to die, yet was in awe that I was standing in front of him. My car was completely totaled. It angers me to this day because I was trapped and felt death seconds away simply because some elderly person didn’t want to give up their independence, which put me, herself (I was fearful I had killed her but luckily she got out of the car in time), and others at risk for death. I’m still not over this….and don’t know if I ever will be with regard to the rage I feel.\n\nOnto symptoms….I’ll try to make this brief and as clear as I can. I initially thought I was fine after the surgery/illness and even the wreck. I was busy, worked….continued to do things as normal. But then the insomnia started. As of now, I get anywhere between 30–45 minutes of sleep, to sometimes maybe 3–4 hours a night, if that. Sometimes I’m up for 48 hours straight. When I do attempt to make myself sleep, its never restful sleep, it’s actually quite broken - tossing and turning. i’ll Just lie in bed staring at the walls.\n\nAs a huge music lover, I noticed I’ve stopped listening to the radio or any apps to enjoy what songs I like. It’s like I’m not interested. Isolation and a desire to avoid or just not be around people has become a big problem for me. Well, it’s not problematic to me but that’s the nature of the problem itself….that lack of desire to interact. It’s especially hard to fake acting like you want to talk to people when you seriously don’t care to. It’s almost as if I hate humanity, although I know this isn’t logical or fair. I wasn’t the most social person before all this happened but I at least was friendly and willing to hang with others. Now….I don’t give a shit. I’m fine working alone and doing everything alone. Not normal, I know.\n\nStrangely, I have nearly had close to 3 panic attacks in grocery stores (why? I don’t know - nothing happened to me in stores ever) but I start having intense physical symptoms (labored breathing, chest tightening, sweating, antsyness, extreme panic) - all from standing in line and being surrounded by people. No one is threatening me so I’m not sure why that triggers me. My anxiety is terrible - and strikes without notice. It can be so bad and so subconsciously rooted that I’ve had people notice whenever I tend to write anything that my fingers and hands are shaking. Badly. They get concerned but I’m not even aware it’s happening most of the time because I guess it’s just how I’ve become.\n\nLastly, everything relating to driving makes me a nervous wreck some days; other days I’m ok. But when I’m not okay, I severely panic on the road when cars are stopped (even if they’re not near me) or when people drive in crazy way (speeding or weaving in through traffic), people walking on the side of the roads or near stalled cars make me vividly relive that night I crashed and almost died. Even flashing signal lights trigger memories of the crash and spinning. A lot of times, I don’t even want to leave home because I feel safer here and don't see the world as a safe place. I don’t think I have ever seen it as safe but I sure as hell don’t now.\n\nI don’t feel depressed, surprisingly, but more so angry and rageful at my circumstances, at everything. I’m normally a nice person but since all this has happened I do tend to snap or have extreme anger in response to things that don’t warrant that amount of anger. Then there’s the emptiness - like a huge void. I think I dissociate as well because it’s like my body is here but my mind and soul are nowhere to be found. Sometimes people have to snap me back into reality because I’m either that unfocused, told I look “blank” or simply just mentally “not there”. I’m upset and disappointed with myself because I have pushed (not physically) my dogs away who seek love/affection from me but I don’t want them touching me or near me. This didn’t used to make me uncomfortable - I would welcome their love and openly shower them with affection but now…it’s different. And I don’t know why. I literally recoil when people or even my own pups try to touch me. That’s the saddest part to me….I feel robbed of who I once was and am becoming this shell of a being.\n\nI’m getting better at being attentive to their needs and getting treatment for my symptoms. But it’s difficult. It’s lonely. It’s very hard day-to-day. But im slightly hopeful because treatment is there and I’m making a point to go. Please seek help if you’re experiecing any type of trauma. If you don’t, it will manifest somehow in some way. Take care."
                },
                {
                    "authorName": "Choi Seon Yeo (Kaylee Choi)",
                    "authorUrl": "https://www.quora.com/profile/Choi-Seon-Yeo-Kaylee-Choi",
                    "authorDescription": "studied Social Studies at Dwight School Seoul (2018)",
                    "text": "It all started when I was 9 years old. We were just about to move house. I woke up to get ready for school noticing my mum didn’t look so well. I asked her what’s wrong and she shrugged it off. Before I left for school, she said sorry to me. I asked what she was apologising for and she once again turned a cold shoulder and said “Nevermind, have a good day at school.”\n\nIt was about 2:00PM, I was sat in my class, chatting and giggling with my friends and doing some art stuff when I get a call saying I had to go down to the front office where I had to collect a note. So I went down, picked up the note and read it. “Please walk to your Nans after school.” Odd, my mum always picked me up. I looked up at the receptionist and asked her why I had to walk to my Nans. She answered with “I don’t know hun.” But it was pretty clear she knew something. Looking back on it, I think she knew what happened but it wasn’t her place to say.\n\nSo I was walking to my Nans, a terrible gut feeling started coming on. It was kind of like an instinct, I knew something wasn’t right. I remembered my mum looking sick, so I thought she must’ve gotten really Ill and couldn’t pick me up. I saw my nan waiting outside her front door. When I stepped up she immediately took my inside and told me to listen. “Mummy is in the hospital.” She said (or something along those lines). “Why?” I answered back. “She accidentally took to many pills, but she’s feeling much better now.” From that moment, I knew what had happened. I may have only been 9 years old, but I wasn’t a fucking idiot. “She took them on purpose, didn’t she?” My Nan looked at me, kind of shocked at my reply but then confirmed she had. I ran up to my grandparents room and just cried.\n\nAfter the incident, I wasn’t allowed to see my mother for 5 months. I didn’t exactly know why but it wasn’t until I got my teens that I knew what “institutionalised” meant. During my 5 month stay at my Nans, I was visited by a therapist… once. Yep, one time. Therefore not receiving the proper treatment or “Comfort” if you like.\n\nwhen I was finally allowed to see my mum, it was delicate. I had to really tip toe on ice around her because I knew if I said the wrong thing or acted up in any way, it would trigger something. Unfortunately, that wasn’t the end.\n\nOver the next few years, I noticed a change in her. She was getting angry a lot more than often which would end up in her verbally discriminating me. A couple years after that, words started turning into slaps. She’d sometimes slap my some hard, my skin would break. After a while, the slaps would go from my arms, sides and back to across my ear. When I got to my teens, all hell started breaking loose. I was constantly belittled, Slapped, punched or kicked or verbally assaulted. I’ll never forgot the morning I was getting ready for school and me and my mother got in quite a bicker-y fight. I kept asking her did she take her meds (anti-depressants) and she kept brushing me off. It got so bad in fact, she started making physical hand gestures and then went to the staircase banister and started bashing her head against it. I was petrified.\n\nI soon decided enough was enough and I ended up moving in with my dad. Every day I’d be pestered by my mum to come back home and every day I’d ignore it.\n\nI was also struggling in school. A couple years prior to me moving out, I was diagnosed with Hypothyroidism which mad me gain a lot of weight and miss more and more school due to me having no energy. Though the days I did go to school, it was hell. I was constantly mocked for my chubby cheeks (Bloating in the face is a common symptom of Hypothyroidism) and it got to the point where I was sat alone in a room with no one too talk to. I was alone for nearly a year and a half which lead me to thinking I wasn’t worth anything On top of the insults I was getting from my mother. I started self harming a lot. It was brutal yet I felt a high from it. The pain kind of drowned out the memories. There’s a whole other story of my mother accusing me of copying the people In my school about self harm but there are some things that just can’t be said online.\n\nThough I’m doing much better today, I still oftentimes think about my past. As much as I try to forgot about it, the thoughts come back 1000x stronger. Sometimes I feel like life isn’t worth it and I should just end it all right here right now but the only person keeping me from doing that is my beautiful girlfriend who constantly reminds be I’m the light in her life and I’m worth something to her at least. She’s the reason I’m still going so you have her to thank for keeping me here and writing this story to you lot haha. Quite lengthy I know but I hope you took the time to read it because I think other people in similar situations can benefit off these kind of stories to remind them they’re not alone.\n\n%3C3"
                },
                {
                    "authorName": "Jessica Maradona Lahore",
                    "authorUrl": "https://www.quora.com/profile/Jessica-Maradona-Lahore",
                    "authorDescription": "Store Manager at Nike (2015-present)",
                    "text": "Yes.\n\nIt started when I was a kid. I was a very loud kid with too much character that was basically leading kids and telling them what to play with and where to go, not in a bossy way though but because I always had suggestions and good ideas that always seemed interesting to kids, I was wild.\n\nSo, because I was always leading them around all the time so automatically if anything bad has happened or someone broke something then it's attached to me. No questions asked. “Why?” I'd ask “Because you always tell them do this and that so it must be your idea so YOU are responsible, YOU are to blame, YOU are the one to be shouted at and punished.”\n\nIt didn't stop here though. At home, I was always shut down and shouted at very loudly and very harshly when I said my opinion. Followed with a very long stream of verbal abuse. Every. Single. Time.\n\nAnd sometimes physical abuse as well.\n\nAnd not only that, but also in classrooms at school. The teacher would be explaining something and everyone is asking, but when I do, I get shouted at and humiliated very badly in front of everyone in the class, because I'm either distracting them or asking ridiculous questions as myself, I was told.\n\nEventually, that taught me not to speak up and always sit alone. Did it end here? No. Other classmates would come to me and steal my stuff in front of me and when I complain to teachers, I get told “I'm glad that happened because If it didn't, I'd have done it myself”!!!!!\n\nI wish I could say it ended here also, but I was put through extreme humiliation and verbal abuse on a daily basis at home and at school. Not only that but having every word and move I make criticized to bits and pieces plus being mocked down and laughed at in every single occasion (which later taught me to shut up 100% of the time to avoid being mocked down and laughed at. How bad it hurt? I can't even begin to explain.)\n\nPlease note that this happened to me while I was completely on my own. I had no friends at all to defend me or at least tell me otherwise. I had zero support system in school and at home as well.\n\nI once told my mother about one incident that happened at school on this day and how I wish I wouldn't be there anymore. Her reply? I don't think they would be sad, probably glad that you ain't there anymore. Yeah, I was probably 7 at the time and still remember it till today.\n\nOne other time the teacher at school was joking and said we will move you to a lower grade because you don't seem to be happy in this class. I packed ALL my stuff and put it in my bag and went to the teacher and said I'm ready (I was dead serious even though I'm going a grade down because I couldn't stand being in that class any longer and I also didn't know he was kidding). His reaction? He laughed along with 2 other teachers till they literally cried. Told my mom later on and kept laughing with her even harder.\n\nThere was also another incident when the class was very very noisy and loud and I couldn't stand the noise anymore so I went to the teacher and told him “get me the hell out of here, I'm having a headache” I was probably 7–8 also at the time. Again, he kept laughing non-stop then told me to go back to my seat.\n\nTo say all of this mockery traumatized me is a huge understatement.\n\nImagine someone hitting you in a specific spot in your body. First hit? Might not hurt so bad. Second? Maybe hurt a bit. Third? Yeah, a bit more. 100th? 1000th? 100,000th? Yeah, by the time this spot would become SO sensitive that merely touching it with a finger would hurt SO bad.\n\nTHIS is exactly how I feel, even till today. 20 years later.\n\nI learned to live in the survival mode (i.e. having my mouth shut ALL day literally, not voicing my opinion at all costs even if I'm being asked directly, not speaking up even between friends now despite having amazing friends now, contrary to the past, …etc.) 24/7 because that is the only way they can't mock me and laugh at me. Because if I never say anything, what would they laugh at? Nothing.\n\nHowever, that also made me sit the whole day without saying a single word, completely as if I'm not even there. People even used to forget I'm there.\n\nTwenty years later and I'm still living in survival mode. It's as if I wore a mask for so long and for so many years that taking it off is impossible. Trust me I tried many times to speak up again between my friends, but either I get triggered and can't speak up or for some reason say something ridiculous (even though I didn't mean to) so they all go into awkward silence. Which makes me fear speaking up again so as not to be in the awkward silence again! (Probably a new trauma is forming).\n\nAlso, I have been told numerous times from friends that I hardly say anything and why is that (I can't explain and won't explain but after being told “quite” and “you hardly said anything at all” many times, I feel like a new trauma might be created now).\n\nIt is a dilemma, same as depression patients who constantly feel like they are in a dark room with no windows, no doors and no light whatsoever and therefore don't know the way out.\n\nThe trauma is very much like that. I have been living like this for so long now I don't even know when will I get out (or get over the trauma).\n\nI started talking a lot and reading even more about it recently and found it helped a bit.\n\nTrying to understand what happens inside the brain of a traumatized person, how the brain reacts to triggers and how your brain is taught to feel fear and go into fight or flight mode when a certain trigger happens.\n\nMy biggest trigger is classrooms, especially if I have to raise my hand and ask in a classroom. That is by far the only case that I haven't made any progress in at all, yet.\n\nWhenever I merely think of raising my hand, having everyone's attention on me (and remembering how I used to be mocked down back then) and actually speaking up makes my brain freeze, go into fight or flight mode, feel immense fear in my chest, hands sweat like crazy, get cold feet and feel dizziness as if I'm going to faint! And that's why I don't speak up at the end.\n\nMoral of the story? Be kind to everyone you meet because 100% of the time they are dealing with or going through something you have absolutely no idea about. I wish I could tell my friends to stop telling me “You're so quiet” Or “You hardly said a word yesterday”.\n\nThough I have a strong resting bitch face and look VERY calm and collected on the outside, nobody would ever guess that THIS calm and collected girl over there is currently having a panic attack inside. Or her brain completely shut down and went into fight or flight mode.\n\nThank you."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "A friend who I consider a brother called me “so sensitive.” He meant well, and he’s the strongest person I know. Unfortunately, I can’t be strong.\n\nI have PTSD. Several times over.\n\nIt began at the age of 11, when I witnessed a terrible a horrific act of violence. It was cruel and brutal and left me permanently changed. What was worse is it was the day I learned my parents could not shield me. They wanted to, but they were just as helpless.\n\nI still can’t talk about it. I want to but it’s scarred over so that when I do talk about it, I feel ill for days.\n\n * Then other events piled on.\n * Bullied in school.\n * My mother’s illness.\n * Full on mental breakdown by 12\n * More bullying.\n * Partner abuse.\n * Suicide attempt\n * Sexual predatory behavior by a teacher at my Yeshiva.\nAnd things I can’t talk about. Not yet. Maybe someday. It will come out eventually, once I can get the courage to let the world know.\n\nBut what I can say that the years between the ages of 11–18, I had maybe 10 happy days.\n\n18–20, I started healing.\n\nAnd then I nearly died several times.\n\nLike watching my home washed away in Hurricane Sandy, and nearly losing my parents as the water washed them away. I still remember that crash of glass and the whoosh of the water and my mother screaming. Wow. Just writing about it takes me back.\n\nAnd then my year in Israel.\n\nAnd then the Chelsea bombings.\n\nYup. Full on PTSD.\n\n\nMy PTSD makes me extremely nervous.\n\nThings can put me back in the prison cell of memory and the torture chamber of fear.\n\nCrashing glass makes me scared. I go back to that moment of nearly losing my parents.\n\nMen yelling makes me very scared. I’m always convinced I’m doing something wrong. It makes me apologize over and over, because I’m afraid someone will hurt me if I make them angry. I annoy my friends when I do it, and I don’t know how to explain to them, I do it automatically because my PTSD is always bubbling under the surface, making me associate a raised voice with “they’re going to hit you.” And they won’t hit me, especially not over the phone, but I can’t stop that terror.\n\nMen in uniform terrify me. And yes, this is from a woman who has lots of friends and family in the US and Israeli military, and one of her best friends is a cop. Honestly, as much as I love them, I have a subconscious terror that they will abuse their power on me. And it shames me. But given the act of violence (which, before anyone asks, happened in the US) it makes sense.\n\nMy high school terrifies me. Passing it on the train makes me want to vomit.\n\n\nI’m screwed up.\n\nCombined with my sensory issues, I’m really screwed up. When the perfect storm of PTSD and sensory issues happen, I go into a state where I can’t recognize what is real and what is not. I go into the dark tunnel and I have to talk myself out of it.\n\nI wish I wasn’t screwed up.\n\nBut I’m getting better."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Short answer: No.\n\nLonger answer: Not officially, but it’s possible. My therapist thinks I might, but she’s not made an official diagnosis.\n\nMost of the usual PTSD symptoms like sleeplessness, loss of interest in hobbies, emotional numbness, trouble concentrating, and feelings of self-loathing, have been attributed to my depression, so I can’t really talk too much about that.\n\nWhenever I have to pass by my old elementary school, I feel sick and begin to shake. I just try to avoid that hellhole the rest of the time.\n\nI can’t take a compliment for what it is because I’m immediately put on guard, imagining how it will later be turned against me. “Hey, nice braids.” And the next thing you know, you’ve got juice dripping down your hair and shoulders and you’re sitting in the principal’s office being asked what you did to provoke them.\n\nI have a hard time making friends. The few times I tried to “make up” with some of the girls in my grade, thinking maybe it was my fault they didn’t like me… it didn’t end well. And the one friend I did have in elementary school made it pretty clear she would rather be hanging out with other people, made fun of me, and put me down. Friends only end up using your affection for them against you; they’re not worth the time and you can’t trust them for anything.\n\nI’ve developed claustrophobia and start to panic when I find myself in a large crowd of people, everyone pressed shoulder to shoulder, and then suddenly I’m back to being suffocated on the playground.\n\nI can still go to pools, but playing dunking games results in me lashing out in blind panic the instant someone tries to force my head underwater.\n\nWhenever I hear the word “freak” being used, even in a completely normal context that doesn’t refer to me, it still makes me feel sick.\n\nI still have nightmares about elementary school and the bullying I went through.\n\nSo even if I don’t have PTSD, elementary school still fucked me up pretty good."
                }
            ]
        },
        {
            "question": "What is Post-Traumatic Stress disorder (PTSD)?",
            "url": "https://www.quora.com/What-is-Post-Traumatic-Stress-disorder-PTSD-1",
            "suggestedAnswer": [
                {
                    "authorName": "Heartfulthinker",
                    "authorUrl": "https://www.quora.com/profile/Heartfulthinker",
                    "authorDescription": "3P Life Coach & Public Speaker (1990-present)",
                    "text": "Post-Traumatic Stress Disorder – PTSD, is the term used for clinical diagnosis. It corresponds to a classification entity within the Diagnostic and Statistical Manual for Mental Disorders (DSM-5).\n\nA licensed clinician, such as a psychotherapist or psychiatrist, uses this diagnostic label to identify symptoms that parallel at least five categories within the classification.\n\nWhile the DSM-5 is based on statistical data, the classification disorder is assigned to an individual based upon observational reference rather than biochemistry.\n\nThe treatment options vary depending upon the discipline of the clinician or alternative provider. For example, in a clinical or medical setting, the treatments are medications that alter brain chemistry. These medicines are often referred to as psychotropics. The medicines are designed to reduce symptoms rather than address the cause of trauma.\n\nAdditionally, the condition or label PTSD can be stigmatizing. It only references the symptoms. Healing from PTSD is possible. There are many routes of treatment and supports along the journey. Eventually, it becomes evident that everyone in life has the right to well-being. 🌷"
                },
                {
                    "authorName": "Mike Isbad",
                    "authorUrl": "https://www.quora.com/profile/Mike-Isbad",
                    "authorDescription": "lives in Sydney, Australia",
                    "text": "It’s a mental illness caused by exposure to events that cause the person to question fundamental aspects of their safety. It is one of a number of mental illnesses that can develop after a traumatic event that is not resolved. The overwhelming feelings attached to elements of the event get committed to long term memory and begin to return at seemingly random times."
                },
                {
                    "authorName": "B-Born Nurturing Motherhood",
                    "authorUrl": "https://www.quora.com/profile/B-Born-Nurturing-Motherhood",
                    "authorDescription": null,
                    "text": "Postpartum post-traumatic stress disorder often affects women who experienced real or perceived trauma during childbirth or immediately after the baby was born. It is believed that approximately 1-6% of women experience postpartum post-traumatic stress disorder after giving birth.\n\nTraumas that might cause postpartum post-traumatic stress issue include:\n\n * Unplanned Cesarean\n * Emergency complication such as prolapsed cord\n * A birth that includes invasive interventions such as the use of vacuum extractor or forceps\n * Baby having to stay in NICU\n * Lack of support and assurance during the delivery\n * Lack of communication from the birth and support team\n * Feelings of powerlessness\nSymptoms of Postpartum (PTSD) may include:\n\n * intense mental or physical distress when you think about the event\n * trouble concentrating\n * Anxiety and panic attacks\n * Feeling a detachment from reality and life\n * negative thoughts about yourself\n * distorted feelings of guilt, worry, or blame\n * Avoidance of anything that brings reminders of the event such as people, places, smells, noises, feelings\n * May begin re-experiencing past traumatic events, including the event that triggered the disorder\n * frequent nightmares about the event\n"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Imagine this.\n\nTonight, since you’re home alone, you decided that you were going to prepare yourself pasta, and you decide to make everything that you will eat yourself, so you get out some tomatoes to make some marinara sauce.\n\nYou clean the tomatoes, taking them out of the water, and you take out the knife to cut them into chunks.\n\nEverything is going well, you’ve already gotten through two of the four tomatoes you are preparing to reduce to chunks.\n\nThe little red cubes that you’ve already crafted are waiting impatiently in the glass bowl that you placed next to your kitchen-space to prepare the sauce.\n\nIn your hurry, you make a big mistake.\n\nThe knife slips.\n\nYour finger is suddenly ablaze with pain.\n\nThe half-sliced tomato is drowning in crimson liquid, only a shade darker than the food that you were preparing for yourself.\n\nYou clumsily drop the knife and grab a paper towel, trying to stop up the flow of blood escaping from your sliced finger.\n\nIt’s bad.\n\nYou have to call your family to take you to the hospital.\n\nThe blood won’t just stop coming out, filling every crease and spilling over your clothes, your dignity coming out with it.\n\nA couple hours later, the doctors have glued your finger back to rightful place, but it still hurts like when it happened.\n\nYour finger is blue and purple. The doctors told it was going to leave a scar.\n\nYou sleep, but something keeps nagging at the back of your mind, something isn’t right.\n\nNext morning, you feel jittery, all of your fingers tremble and shake, they’re useless, so you take the day off work.\n\nBut when you try to eat your breakfast, the glint of silver spoon you’re using reminds you of the knife that you cut yourself with last night.\n\nYou choke on your cereal, and switch out your metal spoon for a plastic one from the ones kept in the drawer where you put the cutlery that take-out gives you when you order out.\n\nYou want to put on your favorite red t-shirt, but as you look at yourself in the mirror, all you see is blood, running down your body.\n\nThe day after next, you try to prepare yourself dinner, but your hands start shaking as soon as you open the drawer where you kept the knife.\n\nYou order out instead.\n\nThat night, your consciousness is plagued with your family members and best friends being chased by shiny and sharpened knifes that drip crimson-colored blood onto the floor, slicing your loved ones apart, starting from the fingers up.\n\nThe nightmares don’t stop the next night, nor the one after the next.\n\nThe day after that, you go out to dinner with your friends, to your favorite restaurant, but when you see your friend slicing open the meal with the knife, your head starts to swim, and all you can see is the reflection of light bouncing off the metal.\n\nYou excuse yourself as quickly as you can, and you have a panic attack in the bathroom stall.\n\nYou can’t deal with it anymore.\n\nEveryone is telling you that your fears are stupid, and you manage to convince yourself that they are right.\n\nBut no amount of trying to convince yourself that nothing is wrong, and that you’re just stupid will let you enter the kitchen, that your brain has labeled as out-of-limits.\n\nYou can’t step into that room without your mind drowning under the sheer amount of thoughts that crowd your brain.\n\nYour eyes start to water, and it seems as though there are not enough tears for you to cry.\n\nAll you can do is suffer in silence, while your loved one’s calls of “just get over it already” and “it wasn’t even a big deal anyways” will drown out the cries of “you are in danger” and “you are stupid and weak” coming from your brain.\n\n\nNow put this in into perspective, imagine the exact same situation, but replace it with something else.\n\nA person watching their family or friend die before their eyes, or failing to take care of them, without being able to do anything to prevent it.\n\nA child being relentlessly bullied at school for years.\n\nA soldier watching the comrades they trusted with their lives fall in war.\n\nA person getting raped by someone they thought they trusted, or a complete stranger, in somewhere they thought was safe.\n\nA person in an abusive relationship that they can’t get out of.\n\nA child being beaten by their parents, other friends or family members without any way to retaliate or protect themself.\n\nA student coming to school only to realize that their best friend committed suicide and they couldn’t do anything to help.\n\nAnd so many more situations.\n\nThis is exactly what we feel like.\n\nPeople tell us to get over it, but that’s the one thing that we just can’t do.\n\nThat is the one thing that is wrong with our minds.\n\nWe are forced to constantly relive our past traumas, and feel the same feelings we felt then, right there in that moment.\n\nWe are plagued by the feeling we could have done something, or that it was all our faults, when it really wasn’t.\n\nSo next time, don’t judge for being forced to feel these things over and over again, we can’t just “get over it” or “forget about it” like you.\n\nWe have to feel it everyday, over and over again.\n\nNo matter what the situation may be.\n\n\nSend help.\n\n%3C/3"
                },
                {
                    "authorName": "Betsy Ellen Usher",
                    "authorUrl": "https://www.quora.com/profile/Betsy-Ellen-Usher",
                    "authorDescription": "Doctor of psychology & Mental Health Film Writer/Director",
                    "text": "*Update as of June 2020 this question has wrongly been merged with Symptoms of PTSD. When I wrote this answer the question was “What are the first signs to recognize you are suffering from of C-PTSD.” Please note the answer below is NOT for P-TSD, it is for C-PTSD. They are two completely different diagnoses and are not exchangeable, do not have the same symptomology, nor the same treatment. Thank you~Dr. B\n\nWhat are the first signs to recognize you are suffering from of C-PTSD?\n\nThis is a very interesting question Leanna and I will do my best to answer it.\n\nThe difficulty with recognizing symptoms of C-PTSD (some are calling it C-PTSR now) is that for a long long time you do not know you have C-PTSD so the symptoms are complex to view from this point of view.\n\nFor instance: C-PTSD comes from long-term trauma of abuse, usually narcissistic abuse. The person begins to have low self worth. This is the leading symptom during the time you don’t know you have C-PTSD and when you find out you do. Let’s start out with symptoms when you don’t know first because they manifest differently and manifest differntly for different people of course.\n\nBefore: This means before you realized you were being abused, before you knew what gaslighting was, blame shifting, ect. These are kind of in order but doesn’t have to be in this order. This is just my opinion.\n\n1) Usual denial or confusion is the first place people begin. For most C-PTSD people this abuse starts in childhood. Therefore it is confusing and they don’t believe their caretaker would hurt them like that. Instead they take on the burden of badness which means they must be the person that is “bad” cause it’s too hard to fathom it’s your caregiver and too scary.\n\n2) A person will start to feel hopeless, like they can never do or be the right kind of person the abuser wants them to be. We call this learned helpless.\n\n3) A person will have a freeze or dissociative, fight, flight, or fawn (co-dependency) response to this continual state of trauma and not being able to flee that can appear more “dramatic” to the abuser or untrained eye.\n\n4) Rage or Anxiety can then manifest. We will turn this fear response outward against others and look like the abuser ourselves or we will turn it inward and internalize it again as we are bad in the form of anxiety and or depression.\n\n5) Then comes cognitive dissonance which is the state of confusion between a feeling that you know something usually about yourself is wrong, however, someone else is telling you the opposite. It becomes unbearable tension not knowing and so people with C-PTSD usually disbelieve themselves because of the learned helpless and low worth and believes the abuser: Example: Your abuse partner tells you that you aren’t a physically affectionate person. You feel that you are. You don’t believe that you are good, worthy, or lovable so you trust what they are saying.\n\n6) This leads to a state of toxic shame about who you are. Small things can trigger you to feel shameful and you react with a fight, freeze, flight, fawn response each time your shame is triggered.\n\n7) This response leads to more shame about how you respond in away that isn’t how you want to be or act.\n\n8) You may then enter into another relationship if you don’t realize your deep psychology roots and trauma state you are in. Then the cycle begins again.\n\nAfter you know you have been abused and have C-PTSD:\n\nNow you know that you were abused and realize that you have C-PTSD. What happens in the beginning?\n\n1) Confusion and denial. You go back and forth if you were the abuser or if they were the abuser. They are so skillful at making you believe you were all these horrible things you now have to untangle that cognitive dissonance. Remember you grew up with the abuse most likely, so you already have a long history of believing you were bad like the abuser said you were. You don’t trust your memories, start to rationalize they weren’t that bad, then back to rage about what they did to you. It’s extremely confusing and cloudy. Like brain fog.\n\n2) Depression and anxiety set in. You have left this trauma bond and begin to detox off of the neurotransmitters that were firing during the traumatic states that chemically made you feel bonded to them like no other person. You feel empty, lost, alone, hopeless, uninterested in anything and possibly begin to have anxiety or obsession about what they are doing during the beginning no contact. You feel half the time like a zombie and the other half like a bomb waiting to go off with built up energy.\n\n3) You isolate yourself. You begin to deal with the feelings of being worthless and feel like you have nothing to offer anyone so you pull back and go further into depression. Questions like who am I? What am I? What do I think about who I am? Why did this happen to me, all start to circulate and torment you daily.\n\n4) You begin to turn inward and drug addiction might come into play, eating disorders, trying to not burden anyone will your struggles, self harm, thoughts of suicide. Some people end up looking like they have borderline personality disorder. You are easily dysregulated emotionally and aren’t a consistent person. Living seems unbearable because how will you ever trust anyone ever again? How could you let this happen? How did you not know for so long? Why would your parents do this to you? All being to circulate. Rage towards your family or men or your partner begin to surface and you no longer want to freeze but fight back and take control back.\n\nThese feelings and experiences can last a long long time. But not always. What comes next is to either 1) Stay in denial and end up back in the same type of abusive relationship that you don’t notice until it’s “too late.” Or 2) you educate yourself, read every article on narc abuse, C-PTSD, awakening the body, becoming empowered and being to grow self worth once you recognize how your self worth is the core of EVERYTHING.\n\nHow do you do this?\n\nWith good healthy mirrors (aka people who are healthy and care about you). Community is a key into coming back into worth. People who see you for who you really are underneath, the person you know you are but have been confused about because of the gaslighting.\n\nNow the really interesting part is then doing work like Peter Levine does on the body nervous system to reawaken these dead and dissociated parts of you. Slowly reawakening your system to be able to fight back, flee if need be, and tolerating bits of trauma again slowly with someone who helps you but holding the space for you that you need. Another story for another time.\n\nHope this helps. Thanks for asking."
                },
                {
                    "authorName": "Kris Valar",
                    "authorUrl": "https://www.quora.com/profile/Kris-Valar",
                    "authorDescription": "Trauma Survivor",
                    "text": "First of all, did you expierence of of these:\n\nWitness death in person\n\nThreatened death/serious injury\n\nSerious injury\n\nSexual violence\n\nNatural disaster/serious accident\n\nOnly these types of events count for PTSD.\n\nHow long has it been? Greater then 3 months?\n\nIf so:\n\nAre you having regular flashbacks, nightmares or physical/emotional reactions based off of triggers?\n\nAs well as:\n\nBeing avoidant of anything related to the event such as feelings/emotions of reminders of what happened?\n\nAlong with:\n\nNegative outlook/worldview, feelings of isolation, difficulty feeling positive emotions, forget traumatic memories, no longer interested in usual activities\n\nFinally:\n\nBeing over alert and vigilant, not sleeping, difficulty concentrating, engaging in risky/aggressive/destructive behavior\n\nIf the anwser to any of those is no then you do not have PTSD."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "I have severe C-PTSD due to childhood abuse.\n\nRight now, I’m finishing medical school to become a psychiatrist and psychotherapist.\n\nI feel that my biography so far has made a perfect candidate for dealing with people who have severe mental problems, who abuse drugs, who don’t function in society, who may have been beaten, raped and abused countless times. All this I went through myself.\n\nI went through absolute hell — and still survived. To cope, at first I did drugs, I lived extremely dangerously, I hurt the ones I like or love. I sabotaged or destroyed my own relationships. I did everything to keep love far away from me. Now I’m slowly learning how to be a good human being, how to life a good life.\n\nI’m a fully integrated person nowadays, thanks to psychotherapy. I still have that part of me that is dark and want’s to fuck everything up- but my demons are under control. I function well in the medical school system and my clinical rotations were very successful. One in particular: Psychiatry!\n\nI believe it is because I simply understand psych patient’s pain, even with very little conversation.\n\nWhatever a patient tells me, it often resonates with my past. I not only understand his words, the vocabulary, I feel the unspoken meaning and implications, the feeling, the pain. I truly understand their problem instead of putting an ICD-10 or DSM-5 label on it like my colleagues do.\n\nThis gave me the opportunity to talk with them, have a real, authentic conversation. This almost never happens between a patient and a fully qualified psychiatrist.\n\nIn my psych rotation, I was very successful with patients. They loved my, they trusted me, they wanted to talk to me more and more, and they came specifically to me instead of anyone else, although there were 14 other fully qualified specialists on the same floor and I was just a lousy med student.\n\nWhat I have to offer patients with PTSD or other porblems at this point in my education is a kind of a-priory sense of sympathy (I like patients, unlike many colleagues) towards my patients and a kind of magical ability to make patients like me in less then 10 seconds. When I talk to patients, I really authentically talk in a language they recognize within their trauma or pain. It’s like were discussing a movie we’ve both seen.\n\nPsychiatry and Psychotherapy expect you to use your character, your feelings, your past trauma and entire biography as a diagnostic and therapeutic tool and use well for the better of the patient. This is what I have to offer: my biography, my sensibilities, my pain and trauma, my abnormalities, my creative and weird way of thinking.\n\nPackaged with a good psychiatric residency and a top psychoanalysis school, I believe I can be a better Shrink than 90% of my colleagues, and my C-PTSD will help rather than hinder, of that I am sure!"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Hey, I’m here because I’m having the same problem. Personally, I think you can. As an AP Psych student I’ve read the DSM diagnostic criteria for PTSD and I’m starting to believe you can (as someone who has been experiencing this problem. Also: Please note I say believe. I am in no way fully educated on the subject beyond my course and personal studies.). I wanted to ask my teacher but was too scared to.\n\nI had a really horrible dream that traumatized me. The dream was out of nowhere. Never had I been exposed to something like that so I don’t think it was caused by an existing traumatic event. But the the dream replayed itself in my mind over and over and I started having to avoid things that reminded me of it.\n\nThe nonstop thinking about the dream and the stress it cause eventually brought another dream of a similar nature. The cycle continued from there.\n\nIt sucks because I honestly feel like there should be more covering this somewhere, but there isn’t. It feels invalidating, almost.\n\n~\n\nI really hope that if there’s any professional reading and having a hard time taking my response seriously, take the time to realize that dreams are just as real for some of us as the real world is. I have to frequently count my fingers as I experience false awakenings and sleep paralysis.\n\nI didn’t know I was asleep when these dreams happened and it wasn’t a relief when I woke up. I still had it burned in my brain.\n\nDon’t overlook this question, answer it please. Thank you."
                },
                {
                    "authorName": "Cathy Flanders",
                    "authorUrl": "https://www.quora.com/profile/Cathy-Flanders-4",
                    "authorDescription": "PhD from Notre Dame of Maryland University (2023)",
                    "text": "The human brain is an amazing organ. Most likely, those who experience trauma but do not experience PTSD or an acute stress disorder were lucky enough to have not experience it over a prolonged period of time. Time has a way of softening the edges of a one time traumatic experience. This said, however, another phenomenon that often occurs with the experience of prolonged or severe trauma is dissociation from the event, the ability to view it as an observer instead of a participant. Some people do this on their own, others may need help to get to this place. Understand that PTSD and chronic stress disorders mean that an individual continually or at least periodically re-experiences the effects of trauma, unable to separate themselves from the events that caused it."
                },
                {
                    "authorName": "Barbara Richardson",
                    "authorUrl": "https://www.quora.com/profile/Barbara-Richardson-62",
                    "authorDescription": "Survived a Sociopathic Mother (1964-present)",
                    "text": "Thank You for the A2A\n\nI have C PTSD due to 50 long years of severe emotional abuse, slander, humiliation and body shaming. I literally would be so tense that on the bus ride home from school I would throw up, more times than not. When I did get off the buses that's where the games began. I would look Her in the eyes to see who I was dealing with that day. If I was extremely lucky, I would just be found guilty of some blunder that I may or may have not been responsible for and sent to My room for the night, if she knew how much I enjoyed that punishment, I'm sure the night without any family interaction would have ended. She usually said She forgot to call Me down for dinner and would bring a peanut butter and jelly or bologna sandwich around 10pm when I'd been asleep for an hour. Like I said though that was the easiest of days. Other squints of those beady little eyes where much more malevolent. Everything from humiliating me in front of friends and family to giving My belongings away to a backhand here and there to her long fingernails digging into my skin as she drug Me to the brick fireplace to kneel forever! As I got older the physical stuff stopped I assume because She could tell it didnt really bother Me anymore. She was focused of destroying accomplishment, flirting with my boyfriend and sabotaging my sporting events especially the ones that got my name in the newspaper or heaven forbid any attention at all.\n\nMy biggest issue coming out of her home and having a family of My own, I just honestly thought I was the only person to feel her wrath and I was, it just that I allowed Her to turn My youngest son into a golden child because I hadnt known of such a thing. I did know she would do and say things to spite Me when it came to Him, but I just pushed it all down until Her golden Child was obviously becoming her flying monkey and her GC.\n\nNot only do I have C PTSD, but after losing 6 immediate family members including my youngest son in a 5 year period and My very best friend, I collapsed, was flown to a large cardiac hospital with only 15% heart infraction rate. I had/have a condition called Takusabu that had mishapen my left ventricle to the point it couldnt get enough oxygenated blood flow going. My caridoligist explained to Me that its cause from anxiety and or taking loss very hard\n\nWhen he asked me how long I've had anxiety, I thought about it for a minute and sadly told him “since I was 2 or 3 years old\". He agreed that He thought it had been a while for Me because He’d never seen such a extreme case himself. Good news though is that its curable, all you need to do is a lot of cardio and steer clear of toxic people..working pretty diligently on the CPTSD too, that and grief counseling…it gets better !!"
                }
            ]
        },
        {
            "question": "What are some examples of post-traumatic stress disorder (PTSD)?",
            "url": "https://www.quora.com/What-are-some-examples-of-post-traumatic-stress-disorder-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": "April Lear",
                    "authorUrl": "https://www.quora.com/profile/April-Lear-1",
                    "authorDescription": "Raised being abused and was in therapy for many years.",
                    "text": "Here are some specific examples from my own experiences (my PTSD comes from the sexual abuse of my father and the horrendous physical, mental, and verbal abuse by my stepfather).\n\nIf someone is angry with me and snaps at me, I completely fall to pieces. I will instantly burst into tears, I stammer and stutter, I go into full on fight or flight mode, and usually choose flight. I get anxious, depressed, and obsess about it for days. One time I was in my front yard and my neighbor lady was outside in her front yard, so we started casually chatting and I said something like “it sounded like your husband and his buddy had a great time last night, his friend brought over his new motorcycle and they were riding it up and down the street”… I had no idea that the wife had just gotten home from out of town, nor was I aware that her husband had lied to her and told her that he'd had a quiet evening the night before and no one came over. She didn't say anything she just went back inside her house. A little while later, I went out into my back yard and her husband was chatting with my husband over the back fence. I approached them and suddenly the neighbor guy angrily asked me “Why are you trying to cause me and my wife to fight by running and telling on me the minute she got home?!!!” My stomach knotted, my knees went weak, and with my heart climbing into my throat I said “wh wh what do you mean? I did did didn't mean to cause a fight\" and by the end of that sentence I was crying and shaking. I ran in the house and continued crying and shaking throughout the rest of the day, and the next day I holed up in my bedroom, hiding. I still avoid that neighbor and his wife over a year later.\n\nI do not like being touched, especially any man who is not my husband. I am super overly particular about my personal space, and I prefer to have at least arm's length between myself and anyone that I'm talking to. Over the years my poor husband has had to learn NOT to snuggle up to me in my sleep. Apparently I have shoved him, kicked him, and even punched him, all while Asleep. And even said things like “GET OFF ME YOU PERVERT!” . Needless to say, we don't have a very good sexual relationship. I've never been able to get over the feeling that sex is perverted and shameful. Another example of this is that if I see a man with a female child, holding her hand while walking around in a store or something similar, I immediately worry that he might be sexually abusing her. I desperately want to run up and ask the child if she is truly okay.\n\nI hope that these examples help you understand PTSD a little better.\n\n."
                },
                {
                    "authorName": "Ybe Casteleyn",
                    "authorUrl": "https://www.quora.com/profile/Ybe-Casteleyn",
                    "authorDescription": "Psychotraumatologist and Author of The Healing Power of Pain",
                    "text": "1. Last week in my office a woman talked about how she was raped years ago. Suddenly her eyes went blank, she started shouting in her mother tongue and peed in her pants…\n2. Another patient of mine dreams over and over again of the car accident she was in a year ago - in her bed she feels her body falling to one side - just like at the moment of impact…\nIn this freshly published book [ https://www.amazon.com/Healing-Power-Pain-Stories-Recovery-ebook/dp/B0716X4SVV/ ] you can read 8 real life stories of trauma and recovery. After reading you’ll have a pretty complete picture of (C)PTS(D)."
                },
                {
                    "authorName": "Rohit Choudhary",
                    "authorUrl": "https://www.quora.com/profile/Rohit-Choudhary-189",
                    "authorDescription": "An overwhelming interest in hardware",
                    "text": "A soldier retires from battlefield after working for years. He keeps having nightmares about the wars, he craves for fighting, and craving sets in with any talk of war."
                },
                {
                    "authorName": "Betsy Ellen Usher",
                    "authorUrl": "https://www.quora.com/profile/Betsy-Ellen-Usher",
                    "authorDescription": "Doctor of psychology & Mental Health Film Writer/Director",
                    "text": "*Update as of June 2020 this question has wrongly been merged with Symptoms of PTSD. When I wrote this answer the question was “What are the first signs to recognize you are suffering from of C-PTSD.” Please note the answer below is NOT for P-TSD, it is for C-PTSD. They are two completely different diagnoses and are not exchangeable, do not have the same symptomology, nor the same treatment. Thank you~Dr. B\n\nWhat are the first signs to recognize you are suffering from of C-PTSD?\n\nThis is a very interesting question Leanna and I will do my best to answer it.\n\nThe difficulty with recognizing symptoms of C-PTSD (some are calling it C-PTSR now) is that for a long long time you do not know you have C-PTSD so the symptoms are complex to view from this point of view.\n\nFor instance: C-PTSD comes from long-term trauma of abuse, usually narcissistic abuse. The person begins to have low self worth. This is the leading symptom during the time you don’t know you have C-PTSD and when you find out you do. Let’s start out with symptoms when you don’t know first because they manifest differently and manifest differntly for different people of course.\n\nBefore: This means before you realized you were being abused, before you knew what gaslighting was, blame shifting, ect. These are kind of in order but doesn’t have to be in this order. This is just my opinion.\n\n1) Usual denial or confusion is the first place people begin. For most C-PTSD people this abuse starts in childhood. Therefore it is confusing and they don’t believe their caretaker would hurt them like that. Instead they take on the burden of badness which means they must be the person that is “bad” cause it’s too hard to fathom it’s your caregiver and too scary.\n\n2) A person will start to feel hopeless, like they can never do or be the right kind of person the abuser wants them to be. We call this learned helpless.\n\n3) A person will have a freeze or dissociative, fight, flight, or fawn (co-dependency) response to this continual state of trauma and not being able to flee that can appear more “dramatic” to the abuser or untrained eye.\n\n4) Rage or Anxiety can then manifest. We will turn this fear response outward against others and look like the abuser ourselves or we will turn it inward and internalize it again as we are bad in the form of anxiety and or depression.\n\n5) Then comes cognitive dissonance which is the state of confusion between a feeling that you know something usually about yourself is wrong, however, someone else is telling you the opposite. It becomes unbearable tension not knowing and so people with C-PTSD usually disbelieve themselves because of the learned helpless and low worth and believes the abuser: Example: Your abuse partner tells you that you aren’t a physically affectionate person. You feel that you are. You don’t believe that you are good, worthy, or lovable so you trust what they are saying.\n\n6) This leads to a state of toxic shame about who you are. Small things can trigger you to feel shameful and you react with a fight, freeze, flight, fawn response each time your shame is triggered.\n\n7) This response leads to more shame about how you respond in away that isn’t how you want to be or act.\n\n8) You may then enter into another relationship if you don’t realize your deep psychology roots and trauma state you are in. Then the cycle begins again.\n\nAfter you know you have been abused and have C-PTSD:\n\nNow you know that you were abused and realize that you have C-PTSD. What happens in the beginning?\n\n1) Confusion and denial. You go back and forth if you were the abuser or if they were the abuser. They are so skillful at making you believe you were all these horrible things you now have to untangle that cognitive dissonance. Remember you grew up with the abuse most likely, so you already have a long history of believing you were bad like the abuser said you were. You don’t trust your memories, start to rationalize they weren’t that bad, then back to rage about what they did to you. It’s extremely confusing and cloudy. Like brain fog.\n\n2) Depression and anxiety set in. You have left this trauma bond and begin to detox off of the neurotransmitters that were firing during the traumatic states that chemically made you feel bonded to them like no other person. You feel empty, lost, alone, hopeless, uninterested in anything and possibly begin to have anxiety or obsession about what they are doing during the beginning no contact. You feel half the time like a zombie and the other half like a bomb waiting to go off with built up energy.\n\n3) You isolate yourself. You begin to deal with the feelings of being worthless and feel like you have nothing to offer anyone so you pull back and go further into depression. Questions like who am I? What am I? What do I think about who I am? Why did this happen to me, all start to circulate and torment you daily.\n\n4) You begin to turn inward and drug addiction might come into play, eating disorders, trying to not burden anyone will your struggles, self harm, thoughts of suicide. Some people end up looking like they have borderline personality disorder. You are easily dysregulated emotionally and aren’t a consistent person. Living seems unbearable because how will you ever trust anyone ever again? How could you let this happen? How did you not know for so long? Why would your parents do this to you? All being to circulate. Rage towards your family or men or your partner begin to surface and you no longer want to freeze but fight back and take control back.\n\nThese feelings and experiences can last a long long time. But not always. What comes next is to either 1) Stay in denial and end up back in the same type of abusive relationship that you don’t notice until it’s “too late.” Or 2) you educate yourself, read every article on narc abuse, C-PTSD, awakening the body, becoming empowered and being to grow self worth once you recognize how your self worth is the core of EVERYTHING.\n\nHow do you do this?\n\nWith good healthy mirrors (aka people who are healthy and care about you). Community is a key into coming back into worth. People who see you for who you really are underneath, the person you know you are but have been confused about because of the gaslighting.\n\nNow the really interesting part is then doing work like Peter Levine does on the body nervous system to reawaken these dead and dissociated parts of you. Slowly reawakening your system to be able to fight back, flee if need be, and tolerating bits of trauma again slowly with someone who helps you but holding the space for you that you need. Another story for another time.\n\nHope this helps. Thanks for asking."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "I have severe C-PTSD due to childhood abuse.\n\nRight now, I’m finishing medical school to become a psychiatrist and psychotherapist.\n\nI feel that my biography so far has made a perfect candidate for dealing with people who have severe mental problems, who abuse drugs, who don’t function in society, who may have been beaten, raped and abused countless times. All this I went through myself.\n\nI went through absolute hell — and still survived. To cope, at first I did drugs, I lived extremely dangerously, I hurt the ones I like or love. I sabotaged or destroyed my own relationships. I did everything to keep love far away from me. Now I’m slowly learning how to be a good human being, how to life a good life.\n\nI’m a fully integrated person nowadays, thanks to psychotherapy. I still have that part of me that is dark and want’s to fuck everything up- but my demons are under control. I function well in the medical school system and my clinical rotations were very successful. One in particular: Psychiatry!\n\nI believe it is because I simply understand psych patient’s pain, even with very little conversation.\n\nWhatever a patient tells me, it often resonates with my past. I not only understand his words, the vocabulary, I feel the unspoken meaning and implications, the feeling, the pain. I truly understand their problem instead of putting an ICD-10 or DSM-5 label on it like my colleagues do.\n\nThis gave me the opportunity to talk with them, have a real, authentic conversation. This almost never happens between a patient and a fully qualified psychiatrist.\n\nIn my psych rotation, I was very successful with patients. They loved my, they trusted me, they wanted to talk to me more and more, and they came specifically to me instead of anyone else, although there were 14 other fully qualified specialists on the same floor and I was just a lousy med student.\n\nWhat I have to offer patients with PTSD or other porblems at this point in my education is a kind of a-priory sense of sympathy (I like patients, unlike many colleagues) towards my patients and a kind of magical ability to make patients like me in less then 10 seconds. When I talk to patients, I really authentically talk in a language they recognize within their trauma or pain. It’s like were discussing a movie we’ve both seen.\n\nPsychiatry and Psychotherapy expect you to use your character, your feelings, your past trauma and entire biography as a diagnostic and therapeutic tool and use well for the better of the patient. This is what I have to offer: my biography, my sensibilities, my pain and trauma, my abnormalities, my creative and weird way of thinking.\n\nPackaged with a good psychiatric residency and a top psychoanalysis school, I believe I can be a better Shrink than 90% of my colleagues, and my C-PTSD will help rather than hinder, of that I am sure!"
                },
                {
                    "authorName": "Antonieta Contreras",
                    "authorUrl": "https://www.quora.com/profile/Antonieta-Contreras-1",
                    "authorDescription": "Curriculum Chair at Institute for Contemporary Psychotherapy",
                    "text": "I really like your question but it’s really challenging to answer.\n\nWhen I worked at the psychiatric emergency room of a city hospital, it was my responsibility to generate an assessment of the mental status of the patients, and whether or not they needed to be admitted into the psychiatric ward. I had 36 hours to find out as much as possible about the patient directly from them, and also from their family members, co-workers, doctors, friends, or whomever I was able to interview. After I diagnosed the patient, a psychiatrist interviewed the patient and confirmed my diagnosis; if the psychiatrist didn't agree with my assessment, more interviews and another 36 hours were needed to come to a final decision. Then they either got admitted or were discharged.\n\nBut patients get into a psych ER with clear symptomatology, and we can observe every one of their movements. In regular circumstances, the clinician has to rely only on the information provided by the client in an hour or so. I don’t trust clinician that can come up with a diagnosis in one session. I think it’s unethical to do that.\n\nDiagnosing mental issues is not an easy task and different people use different methods and philosophies to come up with their diagnoses.\n\nThe difficulties start with the diagnoses themselves. We use names to identify a set of symptoms, but those names every now and then disappear or change. C-PTSD is not even an official name yet, and therefore there is no clear definition of what it is and therefore what makes the set of symptoms that apply to that name.\n\nWhen you want to know how your health is, the doctor orders some blood tests, maybe some x-rays of scans, some culture, or they go inside your body with a tiny camera to see what’s going on where it hurts. When the mind hurts, when you have emotional pain, there is no scan, blood test, or camera that can give us a picture of what’s wrong.\n\nTo explore the mind of another person you have to ask many questions and notice whether the answers are coherent with what you as a clinician observe. Some clinicians —especially psychologists— use psychometric tests, but most tests assume that the patient’s answers are reliable. If a person has a distorted sense of reality, who could you trust their answers?\n\nIn my opinion, diagnosing is an art that develops from having lots of information about the different symptoms/human-behavior/neurobiology/psychology/etc., a sharp capacity to attune and observe the client’s subtle reactions/words/thoughts, and time.\n\nTo diagnose complex traumatization you need to know a lot of the story to assess if the survival mode needed to be activated constantly and how the person dealt with the activation, with the fear, with the circumstances. You have to assess the resilience and resources of the person before you can assert that the circumstances affected them permanently. You need to check the tolerance of negative emotions, the level of activation, the duration of the activation, the level of cognitive distortion, the capacity to experience positive affect, the tendency to dissociate, and the types/frequency/ severity of dissociation, the emotional development, the autobiographical memory, the sense of self, the fragmentation, the physiological adaptations, and many other factors that could indicate the sequela that staying in survival mode for a long time could have left in the functioning of the system.\n\nA diagnosis could be really invalidating and cause more disfunction than the previous situations. Take your time before you give a diagnosis, and better yet, help on healing the symptoms and let go of the labels.\n\nThis article helps to assess dysregulation, which is one of the best indicators of the severity of the symptoms:\n\nhttps://medium.com/the-innovation/what-to-do-if-your-emotional-ups-and-downs-feel-out-of-control-f2ae02f55ca7\n"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Imagine this.\n\nTonight, since you’re home alone, you decided that you were going to prepare yourself pasta, and you decide to make everything that you will eat yourself, so you get out some tomatoes to make some marinara sauce.\n\nYou clean the tomatoes, taking them out of the water, and you take out the knife to cut them into chunks.\n\nEverything is going well, you’ve already gotten through two of the four tomatoes you are preparing to reduce to chunks.\n\nThe little red cubes that you’ve already crafted are waiting impatiently in the glass bowl that you placed next to your kitchen-space to prepare the sauce.\n\nIn your hurry, you make a big mistake.\n\nThe knife slips.\n\nYour finger is suddenly ablaze with pain.\n\nThe half-sliced tomato is drowning in crimson liquid, only a shade darker than the food that you were preparing for yourself.\n\nYou clumsily drop the knife and grab a paper towel, trying to stop up the flow of blood escaping from your sliced finger.\n\nIt’s bad.\n\nYou have to call your family to take you to the hospital.\n\nThe blood won’t just stop coming out, filling every crease and spilling over your clothes, your dignity coming out with it.\n\nA couple hours later, the doctors have glued your finger back to rightful place, but it still hurts like when it happened.\n\nYour finger is blue and purple. The doctors told it was going to leave a scar.\n\nYou sleep, but something keeps nagging at the back of your mind, something isn’t right.\n\nNext morning, you feel jittery, all of your fingers tremble and shake, they’re useless, so you take the day off work.\n\nBut when you try to eat your breakfast, the glint of silver spoon you’re using reminds you of the knife that you cut yourself with last night.\n\nYou choke on your cereal, and switch out your metal spoon for a plastic one from the ones kept in the drawer where you put the cutlery that take-out gives you when you order out.\n\nYou want to put on your favorite red t-shirt, but as you look at yourself in the mirror, all you see is blood, running down your body.\n\nThe day after next, you try to prepare yourself dinner, but your hands start shaking as soon as you open the drawer where you kept the knife.\n\nYou order out instead.\n\nThat night, your consciousness is plagued with your family members and best friends being chased by shiny and sharpened knifes that drip crimson-colored blood onto the floor, slicing your loved ones apart, starting from the fingers up.\n\nThe nightmares don’t stop the next night, nor the one after the next.\n\nThe day after that, you go out to dinner with your friends, to your favorite restaurant, but when you see your friend slicing open the meal with the knife, your head starts to swim, and all you can see is the reflection of light bouncing off the metal.\n\nYou excuse yourself as quickly as you can, and you have a panic attack in the bathroom stall.\n\nYou can’t deal with it anymore.\n\nEveryone is telling you that your fears are stupid, and you manage to convince yourself that they are right.\n\nBut no amount of trying to convince yourself that nothing is wrong, and that you’re just stupid will let you enter the kitchen, that your brain has labeled as out-of-limits.\n\nYou can’t step into that room without your mind drowning under the sheer amount of thoughts that crowd your brain.\n\nYour eyes start to water, and it seems as though there are not enough tears for you to cry.\n\nAll you can do is suffer in silence, while your loved one’s calls of “just get over it already” and “it wasn’t even a big deal anyways” will drown out the cries of “you are in danger” and “you are stupid and weak” coming from your brain.\n\n\nNow put this in into perspective, imagine the exact same situation, but replace it with something else.\n\nA person watching their family or friend die before their eyes, or failing to take care of them, without being able to do anything to prevent it.\n\nA child being relentlessly bullied at school for years.\n\nA soldier watching the comrades they trusted with their lives fall in war.\n\nA person getting raped by someone they thought they trusted, or a complete stranger, in somewhere they thought was safe.\n\nA person in an abusive relationship that they can’t get out of.\n\nA child being beaten by their parents, other friends or family members without any way to retaliate or protect themself.\n\nA student coming to school only to realize that their best friend committed suicide and they couldn’t do anything to help.\n\nAnd so many more situations.\n\nThis is exactly what we feel like.\n\nPeople tell us to get over it, but that’s the one thing that we just can’t do.\n\nThat is the one thing that is wrong with our minds.\n\nWe are forced to constantly relive our past traumas, and feel the same feelings we felt then, right there in that moment.\n\nWe are plagued by the feeling we could have done something, or that it was all our faults, when it really wasn’t.\n\nSo next time, don’t judge for being forced to feel these things over and over again, we can’t just “get over it” or “forget about it” like you.\n\nWe have to feel it everyday, over and over again.\n\nNo matter what the situation may be.\n\n\nSend help.\n\n%3C/3"
                },
                {
                    "authorName": "Michael Fitzjohn",
                    "authorUrl": "https://www.quora.com/profile/Michael-Fitzjohn-1",
                    "authorDescription": "have mentally ill  homeless son",
                    "text": "Let me give you tools you can use to stay OUT of the ICU and how to live with PTSD. PTSD never goes away no matter what drug you’re given. I have been given many drugs, including propranolol to treat my PTSD.\n\nThese drugs do calm you down but do little to treat the underlying cause of your PTSD. Your doctor is the person to chose your treatment but you have the right to say you’re still in pain.\n\nPTSD: National Center for PTSD [ https://www.ptsd.va.gov/public/treatment/therapy-med/treatment-ptsd.asp#.WSdhzQAceAQ.link ]\n\nCognitive Behavioral Therapy worked for me better than any drug I’ve ever taken. The course took 12 weeks, I had homework and it was hard. I had to write down my trauma, write how I felt about it and ask myself was the trauma my fault.\n\nI’ve been haunted for years about the death of a little Vietnamese girl. I met her shortly before she was killed and I blamed myself for her death. I was asked if I killed her and I almost hit the instructor. Her death wasn’t my fault but I still see her face.\n\nLive in the moment, not the past. Learn to stop giving any more power over you than it’s already taken.\n\nTrauma never leaves your brain. You can learn, however, to find peace."
                },
                {
                    "authorName": "Joshua Burkhart",
                    "authorUrl": "https://www.quora.com/profile/Joshua-Burkhart",
                    "authorDescription": "Peer Support Specialist",
                    "text": "Yes and No.\n\nI have seen many people heal from PTSD. Often times the experience changes them but by the time they are done going through the whole process they tend to be much happier with who they are.\n\nThat being said there are many factors that play a role in PTSD and its healing. Since there is such diversity here it’s really important to have hope that people will heal and overcome the negative symptoms of PTSD but it should never be an expectation that a person can simply heal their PTSD.\n\nWhen we create expectations such as these it may become too easy to expect someone to “fix themselves.” This can lead to judgments that people are not healing fast enough or aren’t really doing the work necessary. This ends up denying people the support and time they need to truly heal.\n\nSometimes people heal quickly, other times it takes decades. No matter how long it takes, or what it takes, people should be supported through the process they are experiencing.\n\nThere’s three things involved here.\n\n1. Intensity of the PTSD\n2. \n1. When was the initial trauma experienced?\n(For instance, childhood PTSD tends to rewrite a lot of the body’s and brains functions making it particularly hard to overcome.)\n2. How violating was the initial trauma?\nThis is subjective to each person as every individual has different reactions and sensitivities to trauma.\n3. Was the trauma repeated or compacted?\nIn many cases PTSD comes from repeated abuse or exposure to trauma. This often makes it a lot more difficult to work through.\n\n3. Resources and coping mechanisms used to heal.\n4. \n1. A lot of people do not have the resources nor are they exposed to healthy coping mechanisms that are essential for healing.\n2. \n1. An example that comes to mind is a girl I met who was sold into the sex trade as an infant. She has grown up in the criminal underworld. Fighting to survive her entire life.\n\nHealthy coping mechanisms are absolutely foreign to her, on top of this she has no financial resources with which to get help and due to the severity of her PTSD and due to the fact she really doesn’t have the social skills most people will develop to navigate the “normal world” it’s really hard for her to stay in any sort of treatment program as she really hasn’t developed the social or neurological skills to adapt to these environments.\n\nThis of course is no fault of her own. The time most of us have spent in school and learning how to navigate the “normal world,” she spent being horribly abused and trying to figure out how to get what she needed from criminals.\n\nSo while there is hope for her recovery it would really take a lot of resources both financially and in terms of time with very little expectation of immediate results.\n\nAs of yet she hasn’t found a program that works for her as she feels far more capable in her old environments than with people trying to help her.\n\n\n5. Healing from PTSD often leads Post Traumatic Growth, which changes a person’s outlook on life all together.\n6. \n1. People often experience a greater level of empathy with others after experiencing trauma or overcoming PTSD.\n2. Often times a person’s values may shift. Normally associating greater value to relationships, family, health and creative expression.\n3. \n1. This may reduce value given to career advancement, wealth or possessions.\n\n4. Often times people feel more connected to life after living through a traumatic experience and healing the PTSD that results.\n5. Many times overcoming PTSD or trauma leads to a new or invigorated passion for spirituality.\n\nAs you can see there are a lot of factors that go into healing PTSD and even when PTSD is healed it doesn’t mean you’ll be the same person afterwards.\n\nOften times society expects people to just go back to the way they were but especially with PTSD and Post Traumatic Growth that old way of living just doesn’t fit anymore.\n\nSo while healing is certainly possible it may not look like what we expected. It’s important to accept this part of the process and not hold on to old expectations of what “should happen.”"
                },
                {
                    "authorName": "Charles West",
                    "authorUrl": "https://www.quora.com/profile/Charles-West",
                    "authorDescription": "worked at Medicine and Healthcare",
                    "text": "Hi Kimberley,\n\nI guess I would have to answer this from both a provider standpoint, and a patient standpoint. Having PTSD myself, I will lend a little insight from the other side of the desk as well.\n\nAs a provider, treating persons with PTSD, true PTSD or any of its siblings, is difficult on a number of levels which I will touch on below. I say “true” PTSD in the context of a person that actually has PTSD, and suffers from its symptoms, not something else. But these are some things I feel get in the way of a person with PTSD from getting the appropriate help they need:\n\n * Diagnosis - as mentioned, this is a difficult struggle because, to be honest, a lot of providers do not want to diagnose a client with that disorder, and feel much more comfortable giving them a diagnosis that can be argued as the right one, if the need arose, such as Bipolar Disorder, or ADHD, or even Adjustment Disorder. Many colleagues argue that those all look the same, clinically. But if they do, and the person does have a trauma history, why choose Bipolar or ADHD and not PTSD? Silence. That would mean the possibility of a low amount of authorization from insurance to treat the client if they had PTSD, no medications that would give fast relief, and no brief interventions to improve symptoms quickly. Many clinicians will not even begin to ask about Adverse Childhood Experiences (ACE’s) or Social Determinates of Health (SDOH). If they do, they gloss over it very briefly, so picking up on the red flags of trauma or PTSD, wont even factor into the equation. They are so stuck on looking for the big flags like psychosis (which persons with PTSD can have a micro version of), suicidality, mood disturbances, or homicidality, that they miss the possibility that all of those symptoms can also be symptoms of PTSD. Cant treat what you dont have.\n * Lack of medications approved to treat it - as mentioned there are no medications approved to treat the effects of trauma specifically. Which is why I have seen so many clients that have trauma as their true diagnosis end up on benzodiazepines (which i do agree with to a degree), stimulants, anti-psychotics, and mood stabilizers(these I do agree with to a degree as well). This is why my theory is that the one drug out there that is rather effective in treating symptoms of trauma, particularly flashbacks/dissociation, is causing an epidemic in this country - opiates. Doubt the FDA will ever approve them for treatment of PTSD.\n * Time - As mentioned earlier, you cant fix the issues with PTSD over the weekend. This is a long-term, pervasive, and physiological disorder that a person suffers from. It takes time - a lot of time. Insurance companies do not like to hear that, and clinicians who are pressed for time in a practice with seeing many clients per day, are hard pressed to want to do the real work with treating this disorder, because of the old “Don’t open what you can’t close in an hour” rule. I have investigated and witnessed many clinicians over the years who have knowingly derailed their clients who wanted to talk about trauma and PTSD, and who finally came to the conclusion that they needed to face their past issues in order to move forward. Its one thing when a client isn't at the point to work on their past to move forward, but something totally different when they are and the clinician keeps switching the subject because of their own internal reasons, and that I will address in the next section.\n * Competency - another struggle is competency. Of this I mean, clinicians that are competent to deal with clients that suffer from PTSD, and who treat them. Again, I have investigated many clinicians over the years that have said that they treat PTSD, accept patients that suffer from PTSD, but when under the lamp, have formally admitted that they have had no formal experience with the disorder, no training other than their college experience(which was Masters at best), no continuing education, and no certificates of advanced study. If that was a doctor that specialized in treating gallbladders, and they told you at the appointment that they believed you need the gallbladder removed (which they would do for you), but they had no formal training in surgery, gallbladders, or treating them - would you be ok with them cutting you open? Why do people allow this with their minds? To make matters worse, out of all of the disorders in the DSM that I can think of off of the top of my head, there are few that I can think of that have a more profound negative impact on a client, if the clinician does not know what they are doing in treating the disorder. I believe that there should be regulations in place that any clinician that treats PTSD should hold a CTS (certified trauma specialist) accreditation before they are even allowed to breath on a client. But, I digress.\n * Accountability -The previous paragraph is allowed to perpetuate in our field because of the absence of the content in this paragraph. Accountability, for the most part, is an urban legend in the mental health field. Lots of institutions and practices will say that they have oversight and watch the daily operations for accountability, but nothing could be further from the truth. There is little, if any authority or overseer coming out of the woodwork on the client’s behalf to say “Hey, its been 2 years now….why haven't things improved?” As long as the reports look good, no questions are asked. Many times, if assessment and evaluation is not done or incomplete, and a client is not getting the correct treatment, it will go on anyways, and that can be something to work on later.\nAs a patient, I can say that going through the past was not an easy task at all for me, but one thing that a counselor said that resonated with me all these years was that “sometimes back is forward.” When I was able to make some sense of the things that I struggled with, put a new perspective on my ways of thinking, and better equip myself with a skill set to manage what I was feeling, Things improved for me. It took time, it took support, and it took feeling icky sometimes. But that was the work that set me free. As mentioned, it took me a long time to find a counselor that knew what they were doing, that I felt made a difference, whose eyes weren't constantly checking the clock when we were talking, and who could walk me through the issues I had. Anxiety, self-esteem, and my self-worth were damaged from what I went through, but my therapy helped to rebuild that and I was able to gain a measure of control and stability back.\n\nJust my thoughts.\n\n-CW"
                }
            ]
        },
        {
            "question": "What are some methods to relieve PTSD?",
            "url": "https://www.quora.com/What-are-some-methods-to-relieve-PTSD",
            "suggestedAnswer": [
                {
                    "authorName": "Bett Willett",
                    "authorUrl": "https://www.quora.com/profile/Bett-Willett",
                    "authorDescription": "former Teacher, Administrator",
                    "text": "A2A\n\nThe best I can do with this question is refer you to this, that I answered for the question, What have you learnt by recovering from C-PTSD.\n\nAdvice to all who had a neglected traumatized or abused childhood:\n\nFirst, some certainties, if you have C-PTSD, you may or may not know it, but you compensated for your childhood problems by finding ways to shield you. You became an independent, emotionally numb avoidant adult with many walls erected against you getting hurt. You were like a wary feral kitten, so afraid to trust that you would rather starve.\n\nYou may not have had the concentration for schoolwork, and if, as I did, you had cold rigid teachers, you were further traumatized by their remarks. You tried to fit in at school but because of your shields you were as alone in a crowd as at home. You perfected a persona that hid your perceived shame and faults.\n\nWhat you did to dull the confusion and fear of criticism and rejection is what you had to do. No one has any right to criticize what you did to survive. You tried to win approval by pleasing, you may have dropped out and turned to drugs, alcohol, or self-harm. What you certainly did was repress the worst of what you endured, if you don’t remember you can’t be hurt.\n\nYou lived behind walls built by your sub-conscious when you were small and vulnerable, walls that told you that you must keep everything in, that what happened to you was shameful and must be hidden, and you must never let your feelings betray you. Those walls endure to the present, even if they are no longer relevant, they are tall and almost impenetrable.\n\nIf you became an over-achiever, you chameleon-like fit yourself into the work culture and became the perfect worker. You made sure everything you did was done perfectly, you had to as you couldn’t handle criticism. Your friends were many, and none. You were helpful and pleasant, and no one realized, as they poured out their troubles to you that they had no idea who you were or how you grew up.\n\nYour need for the approval you never felt growing up governed your life. If you did what others wanted, you received thanks or a promotion or even a simple pat on the head. You lived for those moments, they were/are never enough, you had to seek more and more to try to fill that gaping hole in your being, the hole that has no bottom.\n\nMore than likely you chose partners poorly, we attract those who see our needs, our vulnerabilities, and they latch on to one who will do what they want. Often, we wind up with sadists or narcissists who can never be pleased no matter what we do.\n\nAs time went by, the strain of always being wary, always waiting for the other shoe to fall, always fearing rejection or criticism, always having to be perfect, or numbing the fear with substance abuse took a giant toll on you physically.\n\nYou started to have unspecified aches and pains, insomnia, and as more time went by, perhaps autoimmune diseases or even cancer. It is terribly hard on your limbic system to always be in the fight, flight or freeze mode with no letup.\n\nThen you crashed. You became unable to handle daily life; you were depressed and perhaps suicidal and you had nowhere to turn because you couldn’t tell anyone why you crashed. You believed in your shame and inadequacy and knew if it were known that you would be shunned and rejected.\n\nWith any luck you sought help from a therapist trained in working with the traumatized. Just talking to someone who listened to what you said was novel, of course you could never let him/her know your shame, but it felt good to talk.\n\nIt may have taken months or years to build the ability to trust enough to tell your therapist about your trauma, neglect, and/or abuse, and even longer to start to understand why you are the way you are.\n\nNow my advice. Take it from someone who waited much, much too long to get help, and wound up deep in a pit of despair and physical pain.\n\nDo not wait, you cannot recover from childhood trauma by yourself, do not worry that a therapist will blame you, his/her acceptance will be the greatest thing you have ever experienced, you will soon see that you, a child, were not responsible for what the adults around you did to you. You will learn that you were amazing and courageous and that you survived how you could, and you will learn how to trust your therapist to help you recover. After three years I still have trust issues, and walls that won’t crumble, but I now have hope."
                },
                {
                    "authorName": "ChrisCanada",
                    "authorUrl": "https://www.quora.com/profile/ChrisCanada",
                    "authorDescription": "Three Combat Deployments and 13 years of counseling.",
                    "text": "This is my first question/post on Quora. I served in the military for eight years until I was medically retired in 2012. I was an Infantryman with the 82nd Airborne, and for the first time, I am going to share publicly.\n\nPTSD is a battle. It’s a battle that I have Somedays it feels constant. Triggers and flashes will happen at the most random of times. I have flashes of images that cause me to have severe panic attacks. I hear the voices of soldiers I once served with. I lost my best friend in the army to suicide. I have had an intimate relationship with death. My first deployment was in 2005. I deployed three times–each time to combat zones. I have lost soldiers and I have taken life. I am not boasting as it is nothing to boast over; but how does one live with themself after living through and reliving through so much death and destruction?\n\nFirst of all, I feel that it is important to note that PTSD comes in many forms, and that my PTSD from combat is just as justifiable as anyone else’s traumatic event. I hope that this helps someone, as I have had several suicide attempts and learned to manage this after over a decade of counseling.\n\nHere are some of the techniques that have helped me:\n\nFirstly, it is important to know that, YES, life is worth living. YES, you and I are both worthy of love. Even on the worst of days, YES, PTSD is manageable.\n\nMeditation is probably the biggest helper. Meditation is a practice. It takes time for it to really kick in; but, I can say with confidence that if one puts in the effort to stick with meditation for at least six weeks, you will begin to notice a difference. There are many techniques and just like a muscle, you have to commit and continue to work that muscle (your brain). Also, meditation brings forth a higher and more enlightened consciousness. Almost anyone you ask has multiple things on their plate. Also, many have so many thoughts that it may sound like a sea of voices speaking in your mind; at least that’s how it is in my head. Meditation teaches us to focus on one simple thing. Over time, this becomes easier and easier.\n\nHaving a good support system. Not everyone will understand you. Do not expect others to know exactly what you have been through. But, a support system of friends and family that will listen is crucial. I will say that not everyone is a candidate for this. I have a hard time talking with my loved ones as my experiences may cause them to suffer my trauma, and I do not want to place this on them. So, having said that, group therapy and one-on-one therapy sessions help.\n\nMedical Marijuana. Many therapist are against this idea, but I will swear by it. On days that meditation and medication isn’t working, one hit from my bowl will completely change my thought direction.\n\nPurpose. This is another big one for me. Everyone needs purpose. Lately, I study. The more I read and learn about anything keeps me hungry for more. Hobbies help as well. Also, my family needs me. When I identify reasons to live, I feel obligated, which for me gives purpose.\n\nSo, what helps you?"
                },
                {
                    "authorName": "Jessica Evans",
                    "authorUrl": "https://www.quora.com/profile/Jessica-Evans-251",
                    "authorDescription": "ASPD, BiPolar II, PTSD, Anxiety and Depression Buff",
                    "text": "From my own personal experience, yes. It requires cognitive behavioral therapy, and possibly using temporary medications to treat symptoms. But yes. It is absolutely possible."
                },
                {
                    "authorName": "Claire Lee",
                    "authorUrl": "https://www.quora.com/profile/Claire-Lee-543",
                    "authorDescription": "former Administrator in university",
                    "text": "We usually think that when someone has a nasty or mean look to them that we would rather avoid dealing with them. We might judge them too and consider ourselves to be a better person than them.\n\nBut what if your little nephew comes to you with a bright smile asking you to play, and you have fears inside you that leave you nervous and sorrowful? What if I had an experience that made my chest tight and hard to breathe, even when no one was next to me? That is my story. I found out that it wasn’t outside circumstances that were causing my fear and anxiety but what was in my mind that was the cause.\n\nWhat made me so scared was everything that I was holding in my mind. What was in my mind was just a collection of things I saw, heard, and felt, not the reality that existed in the world.\n\nThis world of my mind was full of the good and the bad, the clean and dirty, the past and the future. This was a world separated from the real world only living to protect and support a false self or ego. Living in this mind world is like a dream since we are living in pictures from the past and worries about the future. We are not in the real world that is existing right here and now, but in a daydream like world. Even if we are happy in that world, it is still just like a dream.👻\n\nThe degree to which the ego is strong or weak varies from person to person and is determined by the events each person has experienced. In my case, while I was in my mother’s womb, my mother experienced extreme stress caused by her mother-in-law. It was thought that her experience was passed down to me. I also had the trauma of severe burns that I suffered the day after my first birthday. These incidents made me look at the world as a victim and made me perceive everyone is attacking me. As a result, these images of being a victim piled up in my mind. Life became more and more painful and eventually this turned into a mental illness.🤦‍♀️\n\nMeditation made me aware of my trauma and helped me get out of it.\n\nIt was one night during intensive meditation. Not long after I was lying down to sleep. I felt detached from my body, and I was wandering around the endless universe at an unthinkable speed. There was being guiding me that I clearly recognized. This entity could freely roam the universe without limits. In the dream I felt I wanted to quit because it was such a tremendous speed, I opened my eyes. My body didn't have any strength, so I couldn't move even one finger for a long time, and I felt I didn't even have strength to breathe. My body gradually recovered as I breathed weakly little by little. It was as if my body really died and then came back to life.\n\nThis was a very strange experience, but there was one thing that I clearly realized from that experience. This body is not me. That fact gave me freedom. That realization was a great help in overcoming the difficulties that I had encountered in life.\n\nHowever, the mistaken belief that this body is “I” was so strong, I forgot the realization I had, and I found myself again living with the ups and downs of emotions due to external conditions.😓\n\nLook at the little child. A young child does not have conceptions of good or bad except when adults give them these conceptions. Likewise, they don’t have judgements about people, they accept everyone without minds of judgements When we are able drop these minds that we hold we can drop the trauma that we hold also.\n\nThe ego, strong enough to make me forget enlightenment, became more and more gone with persistent meditation.\n\nNothing shakes me anymore. The true me is an existence that cannot be shaken by the outside environment. Now that I have found my precious true self, the reason I am writing this is just because I want to help others. I hope that the day will come when everyone can see the world right, feel it right, and live.🌱🍀\n\nhttps://youtu.be/xzECw4m2fUc\n"
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "I’m managing it. It is a functional change in my brain meat that would show up on MRI if my doctor were bored enough to order one. Essentially, it is a traumatic brain injury.\n\nI have the world’s best therapist, who is a trauma specialist. I can process large emotions with her and actually, you’ve reminded me that we’re coming up on five years working together, in which time she had an entire baby and I changed careers… and got through it all.\n\nI can live with it because I have to. I would prefer not to have to, but I’d also like a pony."
                },
                {
                    "authorName": "Adrian Yates",
                    "authorUrl": "https://www.quora.com/profile/Adrian-Yates-5",
                    "authorDescription": "Principal Therapist  at Onlinetherapyservice.com (2011-present)",
                    "text": "I can confirm that people do recover from PTSD.\n\nIt takes careful exploration without pushing or pressurising, it’s very important that the client has full control to start or stop when they want.\n\nUnfortunately, as well as there being good therapists, I think there are so call trained experts in PTSD who are full of their own self-importance. are often over confident, and push people to fast, or the client feels obligated by the therapist’s pushy attitude to do what the therapist says, and the client can get into all kinds of emotional trouble.\n\nA few clients have come to me over the years after having a bad reaction to being pushed to fast in past therapy. That always make everything so much harder.\n\nThe relationship is very important, trust needs to be there and the therapist needs to build up an understanding that helps them know when to offer ideas and support and when to be quiet and let the client do their own thing. Its not the speed that’s important it’s the quality of the journey.\n\nIt can be a difficult path finding active/reactive triggers and disassembling memories and emotional trauma and it does work, but it can also take a long time and the road can be very bumpy and may require some rest stops along the way.\n\nIt can and does work, my advice if you have PTSD, take your time to find a therapist that will help therapy work for you."
                },
                {
                    "authorName": null,
                    "authorUrl": null,
                    "authorDescription": null,
                    "text": "Probably in the worst way possible, I just accept and see of it as “this is my life now”. Definitely takes a lot of acceptance and obviously a lot of downs with almost 0 ups plus at the beginning, its more of “why am I being like that” but over time, seemingly because I've came to terms with its effects and everything, yes it still hurts, yes its still sucky but I become less suicidal (not completely not suicidal anymore but LESS) and while it still affects me quite greatly during each episodes, I am able to resume back to doing whatever I was doing unlike being affected the entire day previously. But of course, there's also downside to what I'm doing.\n\nSo for context, I'm a SA victim and it was an invasion so I get extra extra jumpy whenever I'm in bed and about to sleep in which led to worsening my existing insomnia, so now I have bad bad insomnia (I've gone almost a month of no sleep and had to be on IV drip together with some other reasons). I came to terms with it as “if it happens, it happens” and so initially half of myself was like “u wanna get hurt so badly again, then go get hurt again” but part of me was also like “we can't help it but we can prevent it” and so hypervigilance started playing a huge part into the build up of bad insomnia, then it became a thought of “if I stay in, wouldn't I be less likely to interact with people which had caused such pain?” and this was a little before Covid so I was enjoying my time indoors plus covid lockdown in my country so even more the reasons to stay indoors. That was how I started to recover, because of how much I had stayed and loved staying indoors, to the point where I am trying to avoid seeing the psychiatrist, it was just a spark in me that I had to first accept and understand why this and that happens so that I can work on it and to start working on it, I have to accept that that is a part of me and that's my new life now.\n\nBasically that's how I deal with it, except the fact that I feel the need to point out that this happened 10 years ago and I lost memories of it along the way so now it hits double as hard whenever I remember it because its like a repeated event every single time. I decided upon no therapy whatsoever because talking to humans scares me a lot. A trip to the psychiatrist's office gives me panic attacks already and so I decided against it. This probably isn't a common way of dealing with such blockages in life but I also would NEVER recommend because of how painful it was. I just really hate to interact with strangers, that's the root of it, and even more so after this barrier of mine. Also I think I should also include the part about much more recent events, I still stay at home as much as I can so I'm doing alright however I get anxiety spikes and panic attacks going outside so that's a lot more worse than before but that's okay, its something easier to work on than my situation before."
                },
                {
                    "authorName": "Richard Tierney",
                    "authorUrl": "https://www.quora.com/profile/Richard-Tierney-7",
                    "authorDescription": "Spiritual Energy Healer therapist (2021-present)",
                    "text": "Chris\n\nI have written a series of blogs on this subject based on my own personal journey of recovery\n\nToday I and up to 200 clients I have worked with have experienced freedom from their past trauma memories\n\nBasically\n\nWe can't be in two places at once\n\nIf I am in existence in this present moment, today, then the past trauma event is not mine to deal with, but a memory belonging to a younger aspect of myself\n\nI am carrying the memory of an event that happened to another,unknowingly suffering it for then as a show of empathetic love & support for them.\n\nBut that was never my job, that was not my purpose!\n\nI cannot to be two places at once.\n\nThis being the case, these is no power on this earth that can free me of this\n\nI need to find a spiritual solution.\n\nFor me, this meant setting aside my old beliefs and prejudices about man made religion and God, so that I could see the woods for the trees.\n\nI accepted The Teachings of Christ to be truth\n\nEither they are truth or they are lies\n\nIf they are lies, I'm fucked!!!\n\nBut if they are truth, I'm saved!!\n\nIt wasn't a hard choice\n\nI don't do man-made religion or church\n\nBut I found a pastor to introduce me to and teach me about how to claim The Miracle of Casting Out My own Demons( my ptsd )\n\nIt was a choice I had to make\n\nThe Good News tells us\n\nFath Without Works is Death\n\nThe first step is putting my blind faith in the Holy Spirit\n\nThe second step is to do whatever it takes to make this work( putting in the action)\n\nhttp://www.tierneytherapy.com\n"
                },
                {
                    "authorName": "The Real Cat Williamson",
                    "authorUrl": "https://www.quora.com/profile/The-Real-Cat-Williamson",
                    "authorDescription": "Overcame Mental Illness; Suicide Survivor",
                    "text": "THE VERY FIRST STEP IN DEALING WITH PTSD IS TO CALL A MENTAL HEALTH PROFESSIONAL AS SOON AS YOUR FINGERS CAN DIAL, MAKING AN APPOINTMENT, AND GETTING A DIAGNOSES!\n\nFor the record, if the person on whose behalf you are asking this question is YOU - KUDOS! Simply even recognizing that perhaps you may have a PTSD issue is actually the “first step”.\n\nIf, on the other hand, you are asking on behalf of someone else, THANK YOU! You, are, amazing! So many people simply don’t want to broach the subject of PTSD because they either don’t believe it’s a real thing, they’re too scared of any potential consequences, or, they simply don’t care. Either way, I applaud you.\n\nOh, and by the way, the reason the first part of this answer is \"ALL CAPS and BOLD” is because this question made me excited! To me, any conversation about mental health is a step in the right direction towards bringing it out of the darkness out into the light!\n\n❤️"
                },
                {
                    "authorName": "Dr Mark de Teliga",
                    "authorUrl": "https://www.quora.com/profile/Dr-Mark-de-Teliga",
                    "authorDescription": "Doctor & Psychotherapist",
                    "text": "The best thing you can do to treat PTSD is to speak with a specialist therapist in PTSD.\n\nThere are several very effective ways to treat PTSD, such treatments as EMDR, medications, CBT and other focused therapies like DBT… quite a few actually.\n\nSometimes professional practitioners combine methodologies to treat complex PTSD, so rest assured that there is great hope of getting over it.\n\nHere in Australia the first step is to see your doctor, or indeed a medical doctor, discuss the issues and then get a referral to see a specialist."
                }
            ]
        }
    ]
}